[NoCoverage] BlockStatement
features/auth/hooks/useAuth.ts:8:69
 
 const AuthContext = createContext<AuthContextValue | null>(null);
 
-export function AuthProvider({ children }: { children: ReactNode }) {
-   const auth = useAuthState();
-   return createElement(AuthContext.Provider, { value: auth }, children);
-}
+export function AuthProvider({ children }: { children: ReactNode }) {}
 
 export function useAuth(): AuthContextValue {

[NoCoverage] ObjectLiteral
features/auth/hooks/useAuth.ts:10:47
 
 export function AuthProvider({ children }: { children: ReactNode }) {
    const auth = useAuthState();
-   return createElement(AuthContext.Provider, { value: auth }, children);
+   return createElement(AuthContext.Provider, {}, children);
 }
 

[NoCoverage] BlockStatement
features/auth/hooks/useAuth.ts:13:45
    return createElement(AuthContext.Provider, { value: auth }, children);
 }
 
-export function useAuth(): AuthContextValue {
-   const context = useContext(AuthContext);
-   if (!context) {
-      throw new Error("useAuth deve ser usado dentro de <AuthProvider>");
-   }
-   return context;
-}
+export function useAuth(): AuthContextValue {}
 

[NoCoverage] BlockStatement
features/auth/hooks/useAuth.ts:15:18
 
 export function useAuth(): AuthContextValue {
    const context = useContext(AuthContext);
-   if (!context) {
-      throw new Error("useAuth deve ser usado dentro de <AuthProvider>");
-   }
+   if (!context) {}
    return context;
 }

[NoCoverage] BooleanLiteral
features/auth/hooks/useAuth.ts:15:8
 
 export function useAuth(): AuthContextValue {
    const context = useContext(AuthContext);
-   if (!context) {
+   if (context) {
       throw new Error("useAuth deve ser usado dentro de <AuthProvider>");
    }

[NoCoverage] StringLiteral
features/auth/hooks/useAuth.ts:16:23
 export function useAuth(): AuthContextValue {
    const context = useContext(AuthContext);
    if (!context) {
-      throw new Error("useAuth deve ser usado dentro de <AuthProvider>");
+      throw new Error("");
    }
    return context;
