[Killed] BlockStatement
features/battle/logic/battleOperations.ts:5:50
 
 export type SelectionCriteria = "random" | "top_rated" | "worst_rated" | "recent" | "oscar" | "national";
 
-export function shuffleArray<T>(array: T[]): T[] {
-   const shuffled = [...array];
-   for (let i = shuffled.length - 1; i > 0; i--) {
-      const j = Math.floor(Math.random() * (i + 1));
-      [shuffled[i], shuffled[j]] = [shuffled[j], shuffled[i]];
-   }
-   return shuffled;
-}
+export function shuffleArray<T>(array: T[]): T[] {}
 
 export function nextPowerOfTwo(n: number): number {
killedBy: battleOperations (Functional Core) 3. setupTournament deve criar um torneio perfeito se a quantidade de filmes for potência de 2 (Ex: 8 filmes)
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] BlockStatement
features/battle/logic/battleOperations.ts:14:51
    return shuffled;
 }
 
-export function nextPowerOfTwo(n: number): number {
-   if (n <= 0) return 0;
-   return Math.pow(2, Math.ceil(Math.log2(n)));
-}
+export function nextPowerOfTwo(n: number): number {}
 
 export function filterMoviesByCriteria(allMovies: MovieData[], criteria: SelectionCriteria): MovieData[] {
killedBy: battleOperations (Functional Core) 1. nextPowerOfTwo deve retornar a próxima potência de 2 corretamente
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:15:8
 }
 
 export function nextPowerOfTwo(n: number): number {
-   if (n <= 0) return 0;
+   if (true) return 0;
    return Math.pow(2, Math.ceil(Math.log2(n)));
 }
killedBy: battleOperations (Functional Core) 1. nextPowerOfTwo deve retornar a próxima potência de 2 corretamente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
features/battle/logic/battleOperations.ts:15:8
 }
 
 export function nextPowerOfTwo(n: number): number {
-   if (n <= 0) return 0;
+   if (n > 0) return 0;
    return Math.pow(2, Math.ceil(Math.log2(n)));
 }
killedBy: battleOperations (Functional Core) 1. nextPowerOfTwo deve retornar a próxima potência de 2 corretamente
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
features/battle/logic/battleOperations.ts:19:106
    return Math.pow(2, Math.ceil(Math.log2(n)));
 }
 
-export function filterMoviesByCriteria(allMovies: MovieData[], criteria: SelectionCriteria): MovieData[] {
-   const watchedMovies = allMovies.filter((m) => m.status === "watched" && m.rating !== null);
-
-   switch (criteria) {
-      case "oscar":
-         return watchedMovies.filter((m) => m.isOscar);
-      case "national":
-         return watchedMovies.filter((m) => m.isNational);
-      default:
-         return watchedMovies;
-   }
-}
+export function filterMoviesByCriteria(allMovies: MovieData[], criteria: SelectionCriteria): MovieData[] {}
 
 interface TournamentSetup {
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
features/battle/logic/battleOperations.ts:20:43
 }
 
 export function filterMoviesByCriteria(allMovies: MovieData[], criteria: SelectionCriteria): MovieData[] {
-   const watchedMovies = allMovies.filter((m) => m.status === "watched" && m.rating !== null);
+   const watchedMovies = allMovies.filter(() => undefined);
 
    switch (criteria) {
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:20:50
 }
 
 export function filterMoviesByCriteria(allMovies: MovieData[], criteria: SelectionCriteria): MovieData[] {
-   const watchedMovies = allMovies.filter((m) => m.status === "watched" && m.rating !== null);
+   const watchedMovies = allMovies.filter((m) => true);
 
    switch (criteria) {
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: expected [ { id: 1, title: 'A', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:23:7
    const watchedMovies = allMovies.filter((m) => m.status === "watched" && m.rating !== null);
 
    switch (criteria) {
-      case "oscar":
-         return watchedMovies.filter((m) => m.isOscar);
+      case "oscar":
       case "national":
          return watchedMovies.filter((m) => m.isNational);
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: expected 'B' to be 'A' // Object.is equality

[Killed] StringLiteral
features/battle/logic/battleOperations.ts:23:12
    const watchedMovies = allMovies.filter((m) => m.status === "watched" && m.rating !== null);
 
    switch (criteria) {
-      case "oscar":
+      case "":
          return watchedMovies.filter((m) => m.isOscar);
       case "national":
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: expected [ { id: 1, title: 'A', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] MethodExpression
features/battle/logic/battleOperations.ts:24:17
 
    switch (criteria) {
       case "oscar":
-         return watchedMovies.filter((m) => m.isOscar);
+         return watchedMovies;
       case "national":
          return watchedMovies.filter((m) => m.isNational);
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: expected [ { id: 1, title: 'A', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ArrowFunction
features/battle/logic/battleOperations.ts:24:38
 
    switch (criteria) {
       case "oscar":
-         return watchedMovies.filter((m) => m.isOscar);
+         return watchedMovies.filter(() => undefined);
       case "national":
          return watchedMovies.filter((m) => m.isNational);
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos com nota, aplicando o critério 'oscar'
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:25:7
    switch (criteria) {
       case "oscar":
          return watchedMovies.filter((m) => m.isOscar);
-      case "national":
-         return watchedMovies.filter((m) => m.isNational);
+      case "national":
       default:
          return watchedMovies;
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos aplicando o critério 'national'
statusReason: expected [ { id: 1, title: 'A', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ArrowFunction
features/battle/logic/battleOperations.ts:26:38
       case "oscar":
          return watchedMovies.filter((m) => m.isOscar);
       case "national":
-         return watchedMovies.filter((m) => m.isNational);
+         return watchedMovies.filter(() => undefined);
       default:
          return watchedMovies;
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos aplicando o critério 'national'
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
features/battle/logic/battleOperations.ts:26:17
       case "oscar":
          return watchedMovies.filter((m) => m.isOscar);
       case "national":
-         return watchedMovies.filter((m) => m.isNational);
+         return watchedMovies;
       default:
          return watchedMovies;
killedBy: battleOperations (Functional Core) 2. filterMoviesByCriteria deve filtrar apenas os assistidos aplicando o critério 'national'
statusReason: expected [ { id: 1, title: 'A', …(4) }, …(1) ] to have a length of 1 but got 2

[NoCoverage] ConditionalExpression
features/battle/logic/battleOperations.ts:27:7
          return watchedMovies.filter((m) => m.isOscar);
       case "national":
          return watchedMovies.filter((m) => m.isNational);
-      default:
-         return watchedMovies;
+      default:
    }
 }

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:44:8
    quantity: number
 ): TournamentSetup {
    
-   if (availableMovies.length < 2) {
+   if (false) {
       throw new Error("Mínimo de 2 filmes necessários para uma batalha.");
    }
killedBy: battleOperations (Functional Core) 3. setupTournament Sad Path: deve lançar erro se tentar iniciar torneio com menos de 2 filmes
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:44:8
    quantity: number
 ): TournamentSetup {
    
-   if (availableMovies.length < 2) {
+   if (true) {
       throw new Error("Mínimo de 2 filmes necessários para uma batalha.");
    }
killedBy: battleOperations (Functional Core) 3. setupTournament deve criar um torneio perfeito se a quantidade de filmes for potência de 2 (Ex: 8 filmes)
statusReason: Mínimo de 2 filmes necessários para uma batalha.

[Killed] BlockStatement
features/battle/logic/battleOperations.ts:49:25
    }
 
    let targetCount = quantity;
-   if (quantity === -1) {
-      targetCount = availableMovies.length;
-   } else {
+   if (quantity === -1) {} else {
       targetCount = Math.min(quantity, availableMovies.length);
    }
killedBy: battleOperations (Functional Core) 4. setupTournament - Cenários de Ordenação (Coverage Boost) deve selecionar todos os filmes se quantity for -1
statusReason: expected 5 to be 6 // Object.is equality

[Killed] ConditionalExpression
features/battle/logic/battleOperations.ts:49:8
    }
 
    let targetCount = quantity;
-   if (quantity === -1) {
+   if (false) {
       targetCount = availableMovies.length;
    } else {
killedBy: battleOperations (Functional Core) 4. setupTournament - Cenários de Ordenação (Coverage Boost) deve selecionar todos os filmes se quantity for -1
statusReason: expected 5 to be 6 // Object.is equality

[Survived] BlockStatement
features/battle/logic/battleOperations.ts:51:11
    let targetCount = quantity;
    if (quantity === -1) {
       targetCount = availableMovies.length;
-   } else {
-      targetCount = Math.min(quantity, availableMovies.length);
-   }
+   } else {}
 
    let selected = [...availableMovies];

[Survived] MethodExpression
features/battle/logic/battleOperations.ts:52:21
    if (quantity === -1) {
       targetCount = availableMovies.length;
    } else {
-      targetCount = Math.min(quantity, availableMovies.length);
+      targetCount = Math.max(quantity, availableMovies.length);
    }
 

[Survived] ConditionalExpression
features/battle/logic/battleOperations.ts:57:7
 
    let selected = [...availableMovies];
    switch (criteria) {
-      case "top_rated":
-         selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
-         break;
+      case "top_rated":
       case "worst_rated":
          selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));

[Survived] StringLiteral
features/battle/logic/battleOperations.ts:57:12
 
    let selected = [...availableMovies];
    switch (criteria) {
-      case "top_rated":
+      case "":
          selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
          break;

[Survived] LogicalOperator
features/battle/logic/battleOperations.ts:58:35
    let selected = [...availableMovies];
    switch (criteria) {
       case "top_rated":
-         selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
+         selected.sort((a, b) => (b.rating && 0) - (a.rating || 0));
          break;
       case "worst_rated":

[Survived] ArithmeticOperator
features/battle/logic/battleOperations.ts:58:34
    let selected = [...availableMovies];
    switch (criteria) {
       case "top_rated":
-         selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
+         selected.sort((a, b) => (b.rating || 0) + (a.rating || 0));
          break;
       case "worst_rated":

[Survived] ConditionalExpression
features/battle/logic/battleOperations.ts:60:7
       case "top_rated":
          selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
          break;
-      case "worst_rated":
-         selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
-         break;
+      case "worst_rated":
       case "recent":
          selected.sort((a, b) => b.id - a.id);

[Survived] StringLiteral
features/battle/logic/battleOperations.ts:60:12
       case "top_rated":
          selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
          break;
-      case "worst_rated":
+      case "":
          selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
          break;

[Survived] MethodExpression
features/battle/logic/battleOperations.ts:61:10
          selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
          break;
       case "worst_rated":
-         selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
+         selected;
          break;
       case "recent":

[Survived] LogicalOperator
features/battle/logic/battleOperations.ts:61:35
          selected.sort((a, b) => (b.rating || 0) - (a.rating || 0));
          break;
       case "worst_rated":
-         selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
+         selected.sort((a, b) => (a.rating && 0) - (b.rating || 0));
          break;
       case "recent":

[Survived] ConditionalExpression
features/battle/logic/battleOperations.ts:63:7
       case "worst_rated":
          selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
          break;
-      case "recent":
-         selected.sort((a, b) => b.id - a.id);
-         break;
+      case "recent":
       default:
          selected = shuffleArray(selected);

[Survived] ArrowFunction
features/battle/logic/battleOperations.ts:64:24
          selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
          break;
       case "recent":
-         selected.sort((a, b) => b.id - a.id);
+         selected.sort(() => undefined);
          break;
       default:

[Survived] ArithmeticOperator
features/battle/logic/battleOperations.ts:64:34
          selected.sort((a, b) => (a.rating || 0) - (b.rating || 0));
          break;
       case "recent":
-         selected.sort((a, b) => b.id - a.id);
+         selected.sort((a, b) => b.id + a.id);
          break;
       default:

[Survived] ConditionalExpression
features/battle/logic/battleOperations.ts:66:7
       case "recent":
          selected.sort((a, b) => b.id - a.id);
          break;
-      default:
-         selected = shuffleArray(selected);
-         break;
+      default:
    }
 

[Survived] MethodExpression
features/battle/logic/battleOperations.ts:71:23
          break;
    }
 
-   let participants = selected.slice(0, targetCount);
+   let participants = selected;
 
    const bracketSize = nextPowerOfTwo(participants.length);

[Killed] ArithmeticOperator
features/battle/logic/battleOperations.ts:74:22
    let participants = selected.slice(0, targetCount);
 
    const bracketSize = nextPowerOfTwo(participants.length);
-   const byesCount = bracketSize - participants.length;
+   const byesCount = bracketSize + participants.length;
    const fightersCount = participants.length - byesCount;
 
killedBy: battleOperations (Functional Core) 3. setupTournament deve criar um torneio perfeito se a quantidade de filmes for potência de 2 (Ex: 8 filmes)
statusReason: expected [] to have a length of 8 but got +0

[Killed] ArithmeticOperator
features/battle/logic/battleOperations.ts:75:26
 
    const bracketSize = nextPowerOfTwo(participants.length);
    const byesCount = bracketSize - participants.length;
-   const fightersCount = participants.length - byesCount;
+   const fightersCount = participants.length + byesCount;
 
    if (criteria !== "random") {
killedBy: battleOperations (Functional Core) 3. setupTournament deve calcular lutadores e folgas (byes) corretamente para números ímpares (Ex: 5 filmes)
statusReason: expected [ …(5) ] to have a length of 2 but got 5

[Survived] EqualityOperator
features/battle/logic/battleOperations.ts:77:8
    const byesCount = bracketSize - participants.length;
    const fightersCount = participants.length - byesCount;
 
-   if (criteria !== "random") {
+   if (criteria === "random") {
       participants = shuffleArray(participants);
    }

[Survived] BlockStatement
features/battle/logic/battleOperations.ts:77:31
    const byesCount = bracketSize - participants.length;
    const fightersCount = participants.length - byesCount;
 
-   if (criteria !== "random") {
-      participants = shuffleArray(participants);
-   }
+   if (criteria !== "random") {}
 
    return {

[Killed] MethodExpression
features/battle/logic/battleOperations.ts:82:17
    }
 
    return {
-      fighters: participants.slice(0, fightersCount),
+      fighters: participants,
       byes: participants.slice(fightersCount),
       bracketSize,
killedBy: battleOperations (Functional Core) 3. setupTournament deve calcular lutadores e folgas (byes) corretamente para números ímpares (Ex: 5 filmes)
statusReason: expected [ …(5) ] to have a length of 2 but got 5

[Killed] MethodExpression
features/battle/logic/battleOperations.ts:83:13
 
    return {
       fighters: participants.slice(0, fightersCount),
-      byes: participants.slice(fightersCount),
+      byes: participants,
       bracketSize,
    };
killedBy: battleOperations (Functional Core) 3. setupTournament deve criar um torneio perfeito se a quantidade de filmes for potência de 2 (Ex: 8 filmes)
statusReason: expected [ …(8) ] to have a length of +0 but got 8
