[Survived] BooleanLiteral
features/auth/hooks/useAuthState.ts:18:43
    const [session, setSession] = useState<Session | null>(null);
    const [username, setUsername] = useState("");
    const [avatarUrl, setAvatarUrl] = useState<string | null>(null);
-   const [loading, setLoading] = useState(true);
+   const [loading, setLoading] = useState(false);
 
    const fetchProfile = useCallback(async (userId: string) => {

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:20:63
    const [avatarUrl, setAvatarUrl] = useState<string | null>(null);
    const [loading, setLoading] = useState(true);
 
-   const fetchProfile = useCallback(async (userId: string) => {
-      try {
-         const data = await fetchProfileByUserId(userId);
-
-         const profile = toAuthProfile(data);
-         setUsername(profile.username);
-         setAvatarUrl(profile.avatarUrl);
-      } catch (err) {
-         console.error("Erro ao buscar perfil:", err);
-      }
-   }, []);
+   const fetchProfile = useCallback(async (userId: string) => {}, []);
 
    useEffect(() => {
killedBy: useAuthState loads session profile on startup
statusReason: expected '' to be 'joao' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:21:11
    const [loading, setLoading] = useState(true);
 
    const fetchProfile = useCallback(async (userId: string) => {
-      try {
-         const data = await fetchProfileByUserId(userId);
-
-         const profile = toAuthProfile(data);
-         setUsername(profile.username);
-         setAvatarUrl(profile.avatarUrl);
-      } catch (err) {
+      try {} catch (err) {
          console.error("Erro ao buscar perfil:", err);
       }
killedBy: useAuthState loads session profile on startup
statusReason: expected '' to be 'joao' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[NoCoverage] BlockStatement
features/auth/hooks/useAuthState.ts:27:21
          const profile = toAuthProfile(data);
          setUsername(profile.username);
          setAvatarUrl(profile.avatarUrl);
-      } catch (err) {
-         console.error("Erro ao buscar perfil:", err);
-      }
+      } catch (err) {}
    }, []);
 

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:32:20
       }
    }, []);
 
-   useEffect(() => {
-      getCurrentSession().then((session) => {
-         setSession(session);
-         if (session) fetchProfile(session.user.id);
-         setLoading(false);
-      });
-
-      const unsubscribe = subscribeToAuthStateChanges((session) => {
-         setSession(session);
-         if (session) {
-            fetchProfile(session.user.id);
-         } else {
-            setUsername("");
-            setAvatarUrl(null);
-         }
-      });
-
-      return unsubscribe;
-   }, [fetchProfile]);
+   useEffect(() => {}, [fetchProfile]);
 
    const logout = useCallback(async () => {
killedBy: useAuthState loads session profile on startup
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:33:45
    }, []);
 
    useEffect(() => {
-      getCurrentSession().then((session) => {
-         setSession(session);
-         if (session) fetchProfile(session.user.id);
-         setLoading(false);
-      });
+      getCurrentSession().then((session) => {});
 
       const unsubscribe = subscribeToAuthStateChanges((session) => {
killedBy: useAuthState loads session profile on startup
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
features/auth/hooks/useAuthState.ts:35:14
    useEffect(() => {
       getCurrentSession().then((session) => {
          setSession(session);
-         if (session) fetchProfile(session.user.id);
+         if (true) fetchProfile(session.user.id);
          setLoading(false);
       });
killedBy: useAuthState reacts to auth state changes
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
features/auth/hooks/useAuthState.ts:35:14
    useEffect(() => {
       getCurrentSession().then((session) => {
          setSession(session);
-         if (session) fetchProfile(session.user.id);
+         if (false) fetchProfile(session.user.id);
          setLoading(false);
       });
killedBy: useAuthState loads session profile on startup
statusReason: expected '' to be 'joao' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
features/auth/hooks/useAuthState.ts:36:21
       getCurrentSession().then((session) => {
          setSession(session);
          if (session) fetchProfile(session.user.id);
-         setLoading(false);
+         setLoading(true);
       });
 
killedBy: useAuthState loads session profile on startup
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:39:68
          setLoading(false);
       });
 
-      const unsubscribe = subscribeToAuthStateChanges((session) => {
-         setSession(session);
-         if (session) {
-            fetchProfile(session.user.id);
-         } else {
-            setUsername("");
-            setAvatarUrl(null);
-         }
-      });
+      const unsubscribe = subscribeToAuthStateChanges((session) => {});
 
       return unsubscribe;
killedBy: useAuthState reacts to auth state changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'u2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:41:23
 
       const unsubscribe = subscribeToAuthStateChanges((session) => {
          setSession(session);
-         if (session) {
-            fetchProfile(session.user.id);
-         } else {
+         if (session) {} else {
             setUsername("");
             setAvatarUrl(null);
killedBy: useAuthState reacts to auth state changes
statusReason: expected "vi.fn()" to be called with arguments: [ 'u2' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
features/auth/hooks/useAuthState.ts:41:14
 
       const unsubscribe = subscribeToAuthStateChanges((session) => {
          setSession(session);
-         if (session) {
+         if (true) {
             fetchProfile(session.user.id);
          } else {
killedBy: useAuthState reacts to auth state changes
statusReason: Cannot read properties of null (reading 'user')

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:43:17
          setSession(session);
          if (session) {
             fetchProfile(session.user.id);
-         } else {
-            setUsername("");
-            setAvatarUrl(null);
-         }
+         } else {}
       });
 
killedBy: useAuthState reacts to auth state changes
statusReason: expected 'maria' to be '' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
features/auth/hooks/useAuthState.ts:44:25
          if (session) {
             fetchProfile(session.user.id);
          } else {
-            setUsername("");
+            setUsername("Stryker was here!");
             setAvatarUrl(null);
          }
killedBy: useAuthState reacts to auth state changes
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
features/auth/hooks/useAuthState.ts:52:43
       return unsubscribe;
    }, [fetchProfile]);
 
-   const logout = useCallback(async () => {
-      await signOutCurrentUser();
-      window.location.href = "/";
-   }, []);
+   const logout = useCallback(async () => {}, []);
 
    const updateUsername = useCallback((newUsername: string) => {
killedBy: useAuthState logout delegates to auth service
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
features/auth/hooks/useAuthState.ts:54:30
 
    const logout = useCallback(async () => {
       await signOutCurrentUser();
-      window.location.href = "/";
+      window.location.href = "";
    }, []);
 

[NoCoverage] BlockStatement
features/auth/hooks/useAuthState.ts:57:64
       window.location.href = "/";
    }, []);
 
-   const updateUsername = useCallback((newUsername: string) => {
-      setUsername(newUsername);
-   }, []);
+   const updateUsername = useCallback((newUsername: string) => {}, []);
 
    return { session, username, avatarUrl, logout, updateUsername, fetchProfile, loading };

[Killed] ObjectLiteral
features/auth/hooks/useAuthState.ts:61:11
       setUsername(newUsername);
    }, []);
 
-   return { session, username, avatarUrl, logout, updateUsername, fetchProfile, loading };
+   return {};
 }
 
killedBy: useAuthState loads session profile on startup
statusReason: expected undefined to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
