[Killed] EqualityOperator
features/dashboard/logic/calculateStats.ts:14:41
 
 export function calculateDashboardStats(movies: MovieData[]): DashboardStats {
    // Filtrar apenas os assistidos (a base de todos os cálculos)
-   const watched = movies.filter((m) => m.status === "watched" || !m.status);
+   const watched = movies.filter((m) => m.status !== "watched" || !m.status);
    const totalMovies = watched.length;
 
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:14:41
 
 export function calculateDashboardStats(movies: MovieData[]): DashboardStats {
    // Filtrar apenas os assistidos (a base de todos os cálculos)
-   const watched = movies.filter((m) => m.status === "watched" || !m.status);
+   const watched = movies.filter((m) => true);
    const totalMovies = watched.length;
 
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected 4 to be 3 // Object.is equality

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:17:8
    const watched = movies.filter((m) => m.status === "watched" || !m.status);
    const totalMovies = watched.length;
 
-   if (totalMovies === 0) {
+   if (true) {
       return {
          totalMovies: 0,
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 3 // Object.is equality

[Killed] EqualityOperator
features/dashboard/logic/calculateStats.ts:17:8
    const watched = movies.filter((m) => m.status === "watched" || !m.status);
    const totalMovies = watched.length;
 
-   if (totalMovies === 0) {
+   if (totalMovies !== 0) {
       return {
          totalMovies: 0,
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 3 // Object.is equality

[NoCoverage] ObjectLiteral
features/dashboard/logic/calculateStats.ts:18:14
    const totalMovies = watched.length;
 
    if (totalMovies === 0) {
-      return {
-         totalMovies: 0,
-         averageRating: 0,
-         totalRuntimeMinutes: 0,
-         internationalCount: 0,
-         internationalPercent: 0,
-         topDirector: null,
-      };
+      return {};
    }
 

[Killed] EqualityOperator
features/dashboard/logic/calculateStats.ts:29:46
    }
 
    // Média Geral (só de filmes com nota)
-   const ratedMovies = watched.filter((m) => m.rating != null);
+   const ratedMovies = watched.filter((m) => m.rating == null);
    const averageRating = ratedMovies.length > 0
       ? ratedMovies.reduce((sum, m) => sum + (m.rating || 0), 0) / ratedMovies.length
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 7 // Object.is equality

[Killed] ArrowFunction
features/dashboard/logic/calculateStats.ts:29:39
    }
 
    // Média Geral (só de filmes com nota)
-   const ratedMovies = watched.filter((m) => m.rating != null);
+   const ratedMovies = watched.filter(() => undefined);
    const averageRating = ratedMovies.length > 0
       ? ratedMovies.reduce((sum, m) => sum + (m.rating || 0), 0) / ratedMovies.length
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 7 // Object.is equality

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:30:26
 
    // Média Geral (só de filmes com nota)
    const ratedMovies = watched.filter((m) => m.rating != null);
-   const averageRating = ratedMovies.length > 0
+   const averageRating = false
       ? ratedMovies.reduce((sum, m) => sum + (m.rating || 0), 0) / ratedMovies.length
       : 0;
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 7 // Object.is equality

[Killed] EqualityOperator
features/dashboard/logic/calculateStats.ts:30:26
 
    // Média Geral (só de filmes com nota)
    const ratedMovies = watched.filter((m) => m.rating != null);
-   const averageRating = ratedMovies.length > 0
+   const averageRating = ratedMovies.length <= 0
       ? ratedMovies.reduce((sum, m) => sum + (m.rating || 0), 0) / ratedMovies.length
       : 0;
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 7 // Object.is equality

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:31:47
    // Média Geral (só de filmes com nota)
    const ratedMovies = watched.filter((m) => m.rating != null);
    const averageRating = ratedMovies.length > 0
-      ? ratedMovies.reduce((sum, m) => sum + (m.rating || 0), 0) / ratedMovies.length
+      ? ratedMovies.reduce((sum, m) => sum + (true), 0) / ratedMovies.length
       : 0;
 
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected 1 to be 7 // Object.is equality

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:31:47
    // Média Geral (só de filmes com nota)
    const ratedMovies = watched.filter((m) => m.rating != null);
    const averageRating = ratedMovies.length > 0
-      ? ratedMovies.reduce((sum, m) => sum + (m.rating || 0), 0) / ratedMovies.length
+      ? ratedMovies.reduce((sum, m) => sum + (false), 0) / ratedMovies.length
       : 0;
 
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected +0 to be 7 // Object.is equality

[Killed] BlockStatement
features/dashboard/logic/calculateStats.ts:35:59
       : 0;
 
    // Tempo de Vida
-   const totalRuntimeMinutes = watched.reduce((sum, m) => {
-      const validRuntime = m.runtime && m.runtime > 0 ? m.runtime : 0;
-      return sum + validRuntime;
-   }, 0);
+   const totalRuntimeMinutes = watched.reduce((sum, m) => {}, 0);
 
    // Filmes Internacionais (NÃO têm 'Estados Unidos' na lista de países)
killedBy: calculateDashboardStats (Functional Core) deve somar o runtime corretamente
statusReason: expected undefined to be 210 // Object.is equality

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:36:28
 
    // Tempo de Vida
    const totalRuntimeMinutes = watched.reduce((sum, m) => {
-      const validRuntime = m.runtime && m.runtime > 0 ? m.runtime : 0;
+      const validRuntime = true ? m.runtime : 0;
       return sum + validRuntime;
    }, 0);
killedBy: Sad Paths (Tratamento de Falhas e Dados Ausentes) deve lidar de forma segura com valores nulos ou inválidos no runtime e ratings
statusReason: expected NaN to be +0 // Object.is equality

[Killed] LogicalOperator
features/dashboard/logic/calculateStats.ts:36:28
 
    // Tempo de Vida
    const totalRuntimeMinutes = watched.reduce((sum, m) => {
-      const validRuntime = m.runtime && m.runtime > 0 ? m.runtime : 0;
+      const validRuntime = m.runtime || m.runtime > 0 ? m.runtime : 0;
       return sum + validRuntime;
    }, 0);
killedBy: Sad Paths (Tratamento de Falhas e Dados Ausentes) deve lidar de forma segura com valores nulos ou inválidos no runtime e ratings
statusReason: expected -50 to be +0 // Object.is equality

[Killed] ArithmeticOperator
features/dashboard/logic/calculateStats.ts:37:14
    // Tempo de Vida
    const totalRuntimeMinutes = watched.reduce((sum, m) => {
       const validRuntime = m.runtime && m.runtime > 0 ? m.runtime : 0;
-      return sum + validRuntime;
+      return sum - validRuntime;
    }, 0);
 
killedBy: calculateDashboardStats (Functional Core) deve somar o runtime corretamente
statusReason: expected -210 to be 210 // Object.is equality

[Killed] MethodExpression
features/dashboard/logic/calculateStats.ts:41:32
    }, 0);
 
    // Filmes Internacionais (NÃO têm 'Estados Unidos' na lista de países)
-   const internationalMovies = watched.filter(
-      (m) => m.countries && m.countries.length > 0 && !m.countries.includes("Estados Unidos")
-   );
+   const internationalMovies = watched;
    const internationalCount = internationalMovies.length;
    const internationalPercent = Math.round((internationalCount / totalMovies) * 100);
killedBy: calculateDashboardStats (Functional Core) deve calcular a percentagem de filmes internacionais (que não contêm EUA)
statusReason: expected 3 to be 2 // Object.is equality

[Killed] EqualityOperator
features/dashboard/logic/calculateStats.ts:42:29
 
    // Filmes Internacionais (NÃO têm 'Estados Unidos' na lista de países)
    const internationalMovies = watched.filter(
-      (m) => m.countries && m.countries.length > 0 && !m.countries.includes("Estados Unidos")
+      (m) => m.countries && m.countries.length <= 0 && !m.countries.includes("Estados Unidos")
    );
    const internationalCount = internationalMovies.length;
killedBy: calculateDashboardStats (Functional Core) deve calcular a percentagem de filmes internacionais (que não contêm EUA)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
features/dashboard/logic/calculateStats.ts:42:14
 
    // Filmes Internacionais (NÃO têm 'Estados Unidos' na lista de países)
    const internationalMovies = watched.filter(
-      (m) => m.countries && m.countries.length > 0 && !m.countries.includes("Estados Unidos")
+      (m) => m.countries || m.countries.length > 0 && !m.countries.includes("Estados Unidos")
    );
    const internationalCount = internationalMovies.length;
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArithmeticOperator
features/dashboard/logic/calculateStats.ts:45:45
       (m) => m.countries && m.countries.length > 0 && !m.countries.includes("Estados Unidos")
    );
    const internationalCount = internationalMovies.length;
-   const internationalPercent = Math.round((internationalCount / totalMovies) * 100);
+   const internationalPercent = Math.round((internationalCount * totalMovies) * 100);
 
    // Diretor Favorito
killedBy: calculateDashboardStats (Functional Core) deve calcular a percentagem de filmes internacionais (que não contêm EUA)
statusReason: expected 600 to be 67 // Object.is equality

[Killed] ArithmeticOperator
features/dashboard/logic/calculateStats.ts:45:44
       (m) => m.countries && m.countries.length > 0 && !m.countries.includes("Estados Unidos")
    );
    const internationalCount = internationalMovies.length;
-   const internationalPercent = Math.round((internationalCount / totalMovies) * 100);
+   const internationalPercent = Math.round(internationalCount / totalMovies / 100);
 
    // Diretor Favorito
killedBy: calculateDashboardStats (Functional Core) deve calcular a percentagem de filmes internacionais (que não contêm EUA)
statusReason: expected +0 to be 67 // Object.is equality

[Killed] BlockStatement
features/dashboard/logic/calculateStats.ts:49:27
 
    // Diretor Favorito
    const directorMap = new Map<string, number>();
-   watched.forEach((m) => {
-      if (m.director && m.director !== "Desconhecido" && m.director !== "Diretor Desconhecido") {
-         directorMap.set(m.director, (directorMap.get(m.director) || 0) + 1);
-      }
-   });
+   watched.forEach((m) => {});
 
    let topDirector: { name: string; count: number } | null = null;
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected null to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:50:11
    // Diretor Favorito
    const directorMap = new Map<string, number>();
    watched.forEach((m) => {
-      if (m.director && m.director !== "Desconhecido" && m.director !== "Diretor Desconhecido") {
+      if (true) {
          directorMap.set(m.director, (directorMap.get(m.director) || 0) + 1);
       }
killedBy: Sad Paths (Tratamento de Falhas e Dados Ausentes) não deve contar 'Desconhecido' ou 'Diretor Desconhecido' como Diretor Favorito
statusReason: expected { name: 'Desconhecido', count: 2 } to be null

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:50:11
    // Diretor Favorito
    const directorMap = new Map<string, number>();
    watched.forEach((m) => {
-      if (m.director && m.director !== "Desconhecido" && m.director !== "Diretor Desconhecido") {
+      if (true && m.director !== "Diretor Desconhecido") {
          directorMap.set(m.director, (directorMap.get(m.director) || 0) + 1);
       }
killedBy: Sad Paths (Tratamento de Falhas e Dados Ausentes) não deve contar 'Desconhecido' ou 'Diretor Desconhecido' como Diretor Favorito
statusReason: expected { name: 'Desconhecido', count: 2 } to be null

[Killed] ArithmeticOperator
features/dashboard/logic/calculateStats.ts:51:38
    const directorMap = new Map<string, number>();
    watched.forEach((m) => {
       if (m.director && m.director !== "Desconhecido" && m.director !== "Diretor Desconhecido") {
-         directorMap.set(m.director, (directorMap.get(m.director) || 0) + 1);
+         directorMap.set(m.director, (directorMap.get(m.director) || 0) - 1);
       }
    });
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected null to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] LogicalOperator
features/dashboard/logic/calculateStats.ts:51:39
    const directorMap = new Map<string, number>();
    watched.forEach((m) => {
       if (m.director && m.director !== "Desconhecido" && m.director !== "Diretor Desconhecido") {
-         directorMap.set(m.director, (directorMap.get(m.director) || 0) + 1);
+         directorMap.set(m.director, (directorMap.get(m.director) && 0) + 1);
       }
    });
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected { name: 'Christopher Nolan', …(1) } to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] BlockStatement
features/dashboard/logic/calculateStats.ts:57:55
 
    let topDirector: { name: string; count: number } | null = null;
 
-   for (const [name, count] of directorMap.entries()) {
-      if (!topDirector || count > topDirector.count) {
-         topDirector = { name, count };
-      }
-   }
+   for (const [name, count] of directorMap.entries()) {}
 
    if (topDirector && topDirector.count < 2) {
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected null to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] LogicalOperator
features/dashboard/logic/calculateStats.ts:58:11
    let topDirector: { name: string; count: number } | null = null;
 
    for (const [name, count] of directorMap.entries()) {
-      if (!topDirector || count > topDirector.count) {
+      if (!topDirector && count > topDirector.count) {
          topDirector = { name, count };
       }
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: Cannot read properties of null (reading 'count')

[Killed] BlockStatement
features/dashboard/logic/calculateStats.ts:58:54
    let topDirector: { name: string; count: number } | null = null;
 
    for (const [name, count] of directorMap.entries()) {
-      if (!topDirector || count > topDirector.count) {
-         topDirector = { name, count };
-      }
+      if (!topDirector || count > topDirector.count) {}
    }
 
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected null to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] ObjectLiteral
features/dashboard/logic/calculateStats.ts:59:24
 
    for (const [name, count] of directorMap.entries()) {
       if (!topDirector || count > topDirector.count) {
-         topDirector = { name, count };
+         topDirector = {};
       }
    }
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected {} to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] EqualityOperator
features/dashboard/logic/calculateStats.ts:63:23
       }
    }
 
-   if (topDirector && topDirector.count < 2) {
+   if (topDirector && topDirector.count <= 2) {
       topDirector = null;
    }
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected null to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] ConditionalExpression
features/dashboard/logic/calculateStats.ts:63:8
       }
    }
 
-   if (topDirector && topDirector.count < 2) {
+   if (true) {
       topDirector = null;
    }
killedBy: calculateDashboardStats (Functional Core) deve encontrar o diretor mais frequente (se tiver 2 ou mais filmes)
statusReason: expected null to deeply equal { name: 'Christopher Nolan', count: 2 }

[Killed] ArithmeticOperator
features/dashboard/logic/calculateStats.ts:69:33
 
    return {
       totalMovies,
-      averageRating: Math.round(averageRating * 10) / 10, 
+      averageRating: Math.round(averageRating / 10) / 10, 
       totalRuntimeMinutes,
       internationalCount,
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected 0.1 to be 7 // Object.is equality

[Killed] ArithmeticOperator
features/dashboard/logic/calculateStats.ts:69:22
 
    return {
       totalMovies,
-      averageRating: Math.round(averageRating * 10) / 10, 
+      averageRating: Math.round(averageRating * 10) * 10, 
       totalRuntimeMinutes,
       internationalCount,
killedBy: calculateDashboardStats (Functional Core) deve calcular a média correta apenas dos filmes assistidos com nota
statusReason: expected 700 to be 7 // Object.is equality
