[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:15:57
    const [currentPassword, setCurrentPassword] = useState("");
    const [newPassword, setNewPassword] = useState("");
    const [confirmPassword, setConfirmPassword] = useState("");
-   const [savingPassword, setSavingPassword] = useState(false);
+   const [savingPassword, setSavingPassword] = useState(true);
    
    const [showDeleteConfirm, setShowDeleteConfirm] = useState(false);

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:17:63
    const [confirmPassword, setConfirmPassword] = useState("");
    const [savingPassword, setSavingPassword] = useState(false);
    
-   const [showDeleteConfirm, setShowDeleteConfirm] = useState(false);
+   const [showDeleteConfirm, setShowDeleteConfirm] = useState(true);
    const [isDeleting, setIsDeleting] = useState(false);
 

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:18:49
    const [savingPassword, setSavingPassword] = useState(false);
    
    const [showDeleteConfirm, setShowDeleteConfirm] = useState(false);
-   const [isDeleting, setIsDeleting] = useState(false);
+   const [isDeleting, setIsDeleting] = useState(true);
 
    const handleSavePassword = async (e: React.FormEvent, onSuccess: () => void) => {

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:20:84
    const [showDeleteConfirm, setShowDeleteConfirm] = useState(false);
    const [isDeleting, setIsDeleting] = useState(false);
 
-   const handleSavePassword = async (e: React.FormEvent, onSuccess: () => void) => {
-      e.preventDefault();
-
-      const passwordValidation = validatePasswordChange(currentPassword, newPassword, confirmPassword);
-      if (!passwordValidation.valid) {
-         return toast.error(passwordValidation.error || "Dados de senha inválidos.");
-      }
-
-      setSavingPassword(true);
-      try {
-         await verifyCurrentPassword(session?.user.email || "", currentPassword);
-         await updateCurrentUserPassword(newPassword);
-         
-         toast.success("Senha atualizada com sucesso!");
-         setCurrentPassword("");
-         setNewPassword("");
-         setConfirmPassword("");
-         onSuccess(); // Retorna para a aba de perfil
-      } catch (err) {
-         toast.error(err instanceof Error ? err.message : "Erro ao atualizar a senha.");
-      } finally {
-         setSavingPassword(false);
-      }
-   };
+   const handleSavePassword = async (e: React.FormEvent, onSuccess: () => void) => {};
 
    const handleDeleteAccount = async () => {

[NoCoverage] ConditionalExpression
features/profile/hooks/useSecurityManager.ts:24:11
       e.preventDefault();
 
       const passwordValidation = validatePasswordChange(currentPassword, newPassword, confirmPassword);
-      if (!passwordValidation.valid) {
+      if (true) {
          return toast.error(passwordValidation.error || "Dados de senha inválidos.");
       }

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:24:38
       e.preventDefault();
 
       const passwordValidation = validatePasswordChange(currentPassword, newPassword, confirmPassword);
-      if (!passwordValidation.valid) {
-         return toast.error(passwordValidation.error || "Dados de senha inválidos.");
-      }
+      if (!passwordValidation.valid) {}
 
       setSavingPassword(true);

[NoCoverage] ConditionalExpression
features/profile/hooks/useSecurityManager.ts:25:29
 
       const passwordValidation = validatePasswordChange(currentPassword, newPassword, confirmPassword);
       if (!passwordValidation.valid) {
-         return toast.error(passwordValidation.error || "Dados de senha inválidos.");
+         return toast.error(true);
       }
 

[NoCoverage] LogicalOperator
features/profile/hooks/useSecurityManager.ts:25:29
 
       const passwordValidation = validatePasswordChange(currentPassword, newPassword, confirmPassword);
       if (!passwordValidation.valid) {
-         return toast.error(passwordValidation.error || "Dados de senha inválidos.");
+         return toast.error(passwordValidation.error && "Dados de senha inválidos.");
       }
 

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:28:25
          return toast.error(passwordValidation.error || "Dados de senha inválidos.");
       }
 
-      setSavingPassword(true);
+      setSavingPassword(false);
       try {
          await verifyCurrentPassword(session?.user.email || "", currentPassword);

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:29:11
       }
 
       setSavingPassword(true);
-      try {
-         await verifyCurrentPassword(session?.user.email || "", currentPassword);
-         await updateCurrentUserPassword(newPassword);
-         
-         toast.success("Senha atualizada com sucesso!");
-         setCurrentPassword("");
-         setNewPassword("");
-         setConfirmPassword("");
-         onSuccess(); // Retorna para a aba de perfil
-      } catch (err) {
+      try {} catch (err) {
          toast.error(err instanceof Error ? err.message : "Erro ao atualizar a senha.");
       } finally {

[NoCoverage] ConditionalExpression
features/profile/hooks/useSecurityManager.ts:30:38
 
       setSavingPassword(true);
       try {
-         await verifyCurrentPassword(session?.user.email || "", currentPassword);
+         await verifyCurrentPassword(false, currentPassword);
          await updateCurrentUserPassword(newPassword);
          

[NoCoverage] LogicalOperator
features/profile/hooks/useSecurityManager.ts:30:38
 
       setSavingPassword(true);
       try {
-         await verifyCurrentPassword(session?.user.email || "", currentPassword);
+         await verifyCurrentPassword(session?.user.email && "", currentPassword);
          await updateCurrentUserPassword(newPassword);
          

[NoCoverage] StringLiteral
features/profile/hooks/useSecurityManager.ts:33:24
          await verifyCurrentPassword(session?.user.email || "", currentPassword);
          await updateCurrentUserPassword(newPassword);
          
-         toast.success("Senha atualizada com sucesso!");
+         toast.success("");
          setCurrentPassword("");
          setNewPassword("");

[NoCoverage] StringLiteral
features/profile/hooks/useSecurityManager.ts:35:25
          
          toast.success("Senha atualizada com sucesso!");
          setCurrentPassword("");
-         setNewPassword("");
+         setNewPassword("Stryker was here!");
          setConfirmPassword("");
          onSuccess(); // Retorna para a aba de perfil

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:38:21
          setNewPassword("");
          setConfirmPassword("");
          onSuccess(); // Retorna para a aba de perfil
-      } catch (err) {
-         toast.error(err instanceof Error ? err.message : "Erro ao atualizar a senha.");
-      } finally {
+      } catch (err) {} finally {
          setSavingPassword(false);
       }

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:40:17
          onSuccess(); // Retorna para a aba de perfil
       } catch (err) {
          toast.error(err instanceof Error ? err.message : "Erro ao atualizar a senha.");
-      } finally {
-         setSavingPassword(false);
-      }
+      } finally {}
    };
 

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:41:28
       } catch (err) {
          toast.error(err instanceof Error ? err.message : "Erro ao atualizar a senha.");
       } finally {
-         setSavingPassword(false);
+         setSavingPassword(true);
       }
    };

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:45:44
       }
    };
 
-   const handleDeleteAccount = async () => {
-      setIsDeleting(true);
-      try {
-         await deleteCurrentUserAccount();
-         toast.success("Conta excluída com sucesso.");
-         setShowDeleteConfirm(false);
-         onLogoutSuccess(); // Desloga e redireciona
-      } catch (err) {
-         toast.error("Erro ao excluir conta. Contacte o suporte." + err);
-      } finally {
-         setIsDeleting(false);
-      }
-   };
+   const handleDeleteAccount = async () => {};
 
    return {

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:46:21
    };
 
    const handleDeleteAccount = async () => {
-      setIsDeleting(true);
+      setIsDeleting(false);
       try {
          await deleteCurrentUserAccount();

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:47:11
 
    const handleDeleteAccount = async () => {
       setIsDeleting(true);
-      try {
-         await deleteCurrentUserAccount();
-         toast.success("Conta excluída com sucesso.");
-         setShowDeleteConfirm(false);
-         onLogoutSuccess(); // Desloga e redireciona
-      } catch (err) {
+      try {} catch (err) {
          toast.error("Erro ao excluir conta. Contacte o suporte." + err);
       } finally {

[NoCoverage] StringLiteral
features/profile/hooks/useSecurityManager.ts:49:24
       setIsDeleting(true);
       try {
          await deleteCurrentUserAccount();
-         toast.success("Conta excluída com sucesso.");
+         toast.success("");
          setShowDeleteConfirm(false);
          onLogoutSuccess(); // Desloga e redireciona

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:50:31
       try {
          await deleteCurrentUserAccount();
          toast.success("Conta excluída com sucesso.");
-         setShowDeleteConfirm(false);
+         setShowDeleteConfirm(true);
          onLogoutSuccess(); // Desloga e redireciona
       } catch (err) {

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:52:21
          toast.success("Conta excluída com sucesso.");
          setShowDeleteConfirm(false);
          onLogoutSuccess(); // Desloga e redireciona
-      } catch (err) {
-         toast.error("Erro ao excluir conta. Contacte o suporte." + err);
-      } finally {
+      } catch (err) {} finally {
          setIsDeleting(false);
       }

[NoCoverage] BlockStatement
features/profile/hooks/useSecurityManager.ts:54:17
          onLogoutSuccess(); // Desloga e redireciona
       } catch (err) {
          toast.error("Erro ao excluir conta. Contacte o suporte." + err);
-      } finally {
-         setIsDeleting(false);
-      }
+      } finally {}
    };
 

[NoCoverage] BooleanLiteral
features/profile/hooks/useSecurityManager.ts:55:24
       } catch (err) {
          toast.error("Erro ao excluir conta. Contacte o suporte." + err);
       } finally {
-         setIsDeleting(false);
+         setIsDeleting(true);
       }
    };
