[NoCoverage] ObjectLiteral
features/diary/hooks/useDiary.ts:20:53
 }
 
 export function useDiary(userId: string | undefined) {
-  const [state, setState] = useState<UseDiaryState>({
-    entries: [],
-    loading: false,
-    error: null,
-    shareDiaryActivity: true,
-    notifyFriendActivity: false,
-  });
+  const [state, setState] = useState<UseDiaryState>({});
 
   const refresh = useCallback(async () => {

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:22:14
 export function useDiary(userId: string | undefined) {
   const [state, setState] = useState<UseDiaryState>({
     entries: [],
-    loading: false,
+    loading: true,
     error: null,
     shareDiaryActivity: true,

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:24:25
     entries: [],
     loading: false,
     error: null,
-    shareDiaryActivity: true,
+    shareDiaryActivity: false,
     notifyFriendActivity: false,
   });

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:25:27
     loading: false,
     error: null,
     shareDiaryActivity: true,
-    notifyFriendActivity: false,
+    notifyFriendActivity: true,
   });
 

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:29:9
   });
 
   const refresh = useCallback(async () => {
-    if (!userId) {
+    if (false) {
       setState((previous) => ({
         ...previous,

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:29:9
   });
 
   const refresh = useCallback(async () => {
-    if (!userId) {
+    if (true) {
       setState((previous) => ({
         ...previous,

[NoCoverage] ArrowFunction
features/diary/hooks/useDiary.ts:30:16
 
   const refresh = useCallback(async () => {
     if (!userId) {
-      setState((previous) => ({
-        ...previous,
-        entries: [],
-        loading: false,
-      }));
+      setState(() => undefined);
       return;
     }

[NoCoverage] ObjectLiteral
features/diary/hooks/useDiary.ts:30:31
 
   const refresh = useCallback(async () => {
     if (!userId) {
-      setState((previous) => ({
-        ...previous,
-        entries: [],
-        loading: false,
-      }));
+      setState((previous) => ({}));
       return;
     }

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:38:53
       return;
     }
 
-    setState((previous) => ({ ...previous, loading: true, error: null }));
+    setState((previous) => ({ ...previous, loading: false, error: null }));
 
     try {

[NoCoverage] ArrowFunction
features/diary/hooks/useDiary.ts:38:14
       return;
     }
 
-    setState((previous) => ({ ...previous, loading: true, error: null }));
+    setState(() => undefined);
 
     try {

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:40:9
 
     setState((previous) => ({ ...previous, loading: true, error: null }));
 
-    try {
-      const [entries, preference] = await Promise.all([
-        getDiaryEntries(userId),
-        getDiaryPreference(userId),
-      ]);
-
-      setState((previous) => ({
-        ...previous,
-        entries,
-        shareDiaryActivity: preference.share_diary_activity,
-        notifyFriendActivity: preference.notify_friend_activity,
-        loading: false,
-      }));
-    } catch (error) {
+    try {} catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar diary.";
       setState((previous) => ({ ...previous, loading: false, error: message }));

[NoCoverage] ArrowFunction
features/diary/hooks/useDiary.ts:46:16
         getDiaryPreference(userId),
       ]);
 
-      setState((previous) => ({
-        ...previous,
-        entries,
-        shareDiaryActivity: preference.share_diary_activity,
-        notifyFriendActivity: preference.notify_friend_activity,
-        loading: false,
-      }));
+      setState(() => undefined);
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar diary.";

[NoCoverage] ObjectLiteral
features/diary/hooks/useDiary.ts:46:31
         getDiaryPreference(userId),
       ]);
 
-      setState((previous) => ({
-        ...previous,
-        entries,
-        shareDiaryActivity: preference.share_diary_activity,
-        notifyFriendActivity: preference.notify_friend_activity,
-        loading: false,
-      }));
+      setState((previous) => ({}));
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar diary.";

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:51:18
         entries,
         shareDiaryActivity: preference.share_diary_activity,
         notifyFriendActivity: preference.notify_friend_activity,
-        loading: false,
+        loading: true,
       }));
     } catch (error) {

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:53:21
         notifyFriendActivity: preference.notify_friend_activity,
         loading: false,
       }));
-    } catch (error) {
-      const message = error instanceof Error ? error.message : "Falha ao carregar diary.";
-      setState((previous) => ({ ...previous, loading: false, error: message }));
-    }
+    } catch (error) {}
   }, [userId]);
 

[NoCoverage] ArrowFunction
features/diary/hooks/useDiary.ts:55:16
       }));
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar diary.";
-      setState((previous) => ({ ...previous, loading: false, error: message }));
+      setState(() => undefined);
     }
   }, [userId]);

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:55:55
       }));
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar diary.";
-      setState((previous) => ({ ...previous, loading: false, error: message }));
+      setState((previous) => ({ ...previous, loading: true, error: message }));
     }
   }, [userId]);

[NoCoverage] ArrayDeclaration
features/diary/hooks/useDiary.ts:57:6
       const message = error instanceof Error ? error.message : "Falha ao carregar diary.";
       setState((previous) => ({ ...previous, loading: false, error: message }));
     }
-  }, [userId]);
+  }, []);
 
   useEffect(() => {

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:59:19
     }
   }, [userId]);
 
-  useEffect(() => {
-    const timerId = window.setTimeout(() => {
-      void refresh();
-    }, 0);
-
-    return () => {
-      window.clearTimeout(timerId);
-    };
-  }, [refresh]);
+  useEffect(() => {}, [refresh]);
 
   const addEntry = useCallback(

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:60:45
   }, [userId]);
 
   useEffect(() => {
-    const timerId = window.setTimeout(() => {
-      void refresh();
-    }, 0);
+    const timerId = window.setTimeout(() => {}, 0);
 
     return () => {

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:64:18
       void refresh();
     }, 0);
 
-    return () => {
-      window.clearTimeout(timerId);
-    };
+    return () => {};
   }, [refresh]);
 

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:70:52
   }, [refresh]);
 
   const addEntry = useCallback(
-    async (tmdbId: number, watchedDate: string) => {
-      if (!userId) return;
-      await saveDiaryEntry(userId, tmdbId, watchedDate);
-      await refresh();
-    },
+    async (tmdbId: number, watchedDate: string) => {},
     [refresh, userId]
   );

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:71:11
 
   const addEntry = useCallback(
     async (tmdbId: number, watchedDate: string) => {
-      if (!userId) return;
+      if (true) return;
       await saveDiaryEntry(userId, tmdbId, watchedDate);
       await refresh();

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:71:11
 
   const addEntry = useCallback(
     async (tmdbId: number, watchedDate: string) => {
-      if (!userId) return;
+      if (false) return;
       await saveDiaryEntry(userId, tmdbId, watchedDate);
       await refresh();

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:79:32
   );
 
   const removeEntry = useCallback(
-    async (entryId: string) => {
-      if (!userId) return;
-      await deleteDiaryEntry(userId, entryId);
-      await refresh();
-    },
+    async (entryId: string) => {},
     [refresh, userId]
   );

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:80:11
 
   const removeEntry = useCallback(
     async (entryId: string) => {
-      if (!userId) return;
+      if (userId) return;
       await deleteDiaryEntry(userId, entryId);
       await refresh();

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:80:11
 
   const removeEntry = useCallback(
     async (entryId: string) => {
-      if (!userId) return;
+      if (false) return;
       await deleteDiaryEntry(userId, entryId);
       await refresh();

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:88:33
   );
 
   const setShareDiaryActivity = useCallback(
-    async (enabled: boolean) => {
-      if (!userId) return;
-      await updateDiaryPreference(userId, { share_diary_activity: enabled });
-      setState((previous) => ({ ...previous, shareDiaryActivity: enabled }));
-    },
+    async (enabled: boolean) => {},
     [userId]
   );

[NoCoverage] BooleanLiteral
features/diary/hooks/useDiary.ts:89:11
 
   const setShareDiaryActivity = useCallback(
     async (enabled: boolean) => {
-      if (!userId) return;
+      if (userId) return;
       await updateDiaryPreference(userId, { share_diary_activity: enabled });
       setState((previous) => ({ ...previous, shareDiaryActivity: enabled }));

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:89:11
 
   const setShareDiaryActivity = useCallback(
     async (enabled: boolean) => {
-      if (!userId) return;
+      if (false) return;
       await updateDiaryPreference(userId, { share_diary_activity: enabled });
       setState((previous) => ({ ...previous, shareDiaryActivity: enabled }));

[NoCoverage] ArrowFunction
features/diary/hooks/useDiary.ts:91:16
     async (enabled: boolean) => {
       if (!userId) return;
       await updateDiaryPreference(userId, { share_diary_activity: enabled });
-      setState((previous) => ({ ...previous, shareDiaryActivity: enabled }));
+      setState(() => undefined);
     },
     [userId]

[NoCoverage] ObjectLiteral
features/diary/hooks/useDiary.ts:91:31
     async (enabled: boolean) => {
       if (!userId) return;
       await updateDiaryPreference(userId, { share_diary_activity: enabled });
-      setState((previous) => ({ ...previous, shareDiaryActivity: enabled }));
+      setState((previous) => ({}));
     },
     [userId]

[NoCoverage] ArrayDeclaration
features/diary/hooks/useDiary.ts:93:5
       await updateDiaryPreference(userId, { share_diary_activity: enabled });
       setState((previous) => ({ ...previous, shareDiaryActivity: enabled }));
     },
-    [userId]
+    []
   );
 

[NoCoverage] BlockStatement
features/diary/hooks/useDiary.ts:97:33
   );
 
   const setNotifyFriendActivity = useCallback(
-    async (enabled: boolean) => {
-      if (!userId) return;
-      await updateDiaryPreference(userId, { notify_friend_activity: enabled });
-      setState((previous) => ({ ...previous, notifyFriendActivity: enabled }));
-    },
+    async (enabled: boolean) => {},
     [userId]
   );

[NoCoverage] ConditionalExpression
features/diary/hooks/useDiary.ts:98:11
 
   const setNotifyFriendActivity = useCallback(
     async (enabled: boolean) => {
-      if (!userId) return;
+      if (true) return;
       await updateDiaryPreference(userId, { notify_friend_activity: enabled });
       setState((previous) => ({ ...previous, notifyFriendActivity: enabled }));

[NoCoverage] ArrowFunction
features/diary/hooks/useDiary.ts:100:16
     async (enabled: boolean) => {
       if (!userId) return;
       await updateDiaryPreference(userId, { notify_friend_activity: enabled });
-      setState((previous) => ({ ...previous, notifyFriendActivity: enabled }));
+      setState(() => undefined);
     },
     [userId]

[NoCoverage] ObjectLiteral
features/diary/hooks/useDiary.ts:100:31
     async (enabled: boolean) => {
       if (!userId) return;
       await updateDiaryPreference(userId, { notify_friend_activity: enabled });
-      setState((previous) => ({ ...previous, notifyFriendActivity: enabled }));
+      setState((previous) => ({}));
     },
     [userId]

[NoCoverage] ObjectLiteral
features/diary/hooks/useDiary.ts:105:10
     [userId]
   );
 
-  return {
-    entries: state.entries,
-    loading: state.loading,
-    error: state.error,
-    shareDiaryActivity: state.shareDiaryActivity,
-    notifyFriendActivity: state.notifyFriendActivity,
-    refresh,
-    addEntry,
-    removeEntry,
-    setShareDiaryActivity,
-    setNotifyFriendActivity,
-  };
+  return {};
 }
 
