[NoCoverage] BooleanLiteral
features/diary/hooks/useFriendDiaryActivities.ts:10:80
   error: string | null;
 }
 
-export function useFriendDiaryActivities(userId: string | undefined, enabled = true) {
+export function useFriendDiaryActivities(userId: string | undefined, enabled = false) {
   const [state, setState] = useState<State>({
     activities: [],

[NoCoverage] ObjectLiteral
features/diary/hooks/useFriendDiaryActivities.ts:11:45
 }
 
 export function useFriendDiaryActivities(userId: string | undefined, enabled = true) {
-  const [state, setState] = useState<State>({
-    activities: [],
-    loading: false,
-    error: null,
-  });
+  const [state, setState] = useState<State>({});
 
   const refresh = useCallback(async () => {

[NoCoverage] ArrayDeclaration
features/diary/hooks/useFriendDiaryActivities.ts:12:17
 
 export function useFriendDiaryActivities(userId: string | undefined, enabled = true) {
   const [state, setState] = useState<State>({
-    activities: [],
+    activities: ["Stryker was here"],
     loading: false,
     error: null,

[NoCoverage] BooleanLiteral
features/diary/hooks/useFriendDiaryActivities.ts:13:14
 export function useFriendDiaryActivities(userId: string | undefined, enabled = true) {
   const [state, setState] = useState<State>({
     activities: [],
-    loading: false,
+    loading: true,
     error: null,
   });

[NoCoverage] BlockStatement
features/diary/hooks/useFriendDiaryActivities.ts:17:43
     error: null,
   });
 
-  const refresh = useCallback(async () => {
-    if (!userId || !enabled) {
-      setState({ activities: [], loading: false, error: null });
-      return;
-    }
-
-    setState((previous) => ({ ...previous, loading: true, error: null }));
-
-    try {
-      const activities = await getFriendDiaryActivities(userId);
-      setState({ activities, loading: false, error: null });
-    } catch (error) {
-      const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";
-      setState({ activities: [], loading: false, error: message });
-    }
-  }, [enabled, userId]);
+  const refresh = useCallback(async () => {}, [enabled, userId]);
 
   useEffect(() => {

[NoCoverage] ConditionalExpression
features/diary/hooks/useFriendDiaryActivities.ts:18:9
   });
 
   const refresh = useCallback(async () => {
-    if (!userId || !enabled) {
+    if (false) {
       setState({ activities: [], loading: false, error: null });
       return;

[NoCoverage] BlockStatement
features/diary/hooks/useFriendDiaryActivities.ts:18:30
   });
 
   const refresh = useCallback(async () => {
-    if (!userId || !enabled) {
-      setState({ activities: [], loading: false, error: null });
-      return;
-    }
+    if (!userId || !enabled) {}
 
     setState((previous) => ({ ...previous, loading: true, error: null }));

[NoCoverage] BooleanLiteral
features/diary/hooks/useFriendDiaryActivities.ts:19:43
 
   const refresh = useCallback(async () => {
     if (!userId || !enabled) {
-      setState({ activities: [], loading: false, error: null });
+      setState({ activities: [], loading: true, error: null });
       return;
     }

[NoCoverage] BlockStatement
features/diary/hooks/useFriendDiaryActivities.ts:25:9
 
     setState((previous) => ({ ...previous, loading: true, error: null }));
 
-    try {
-      const activities = await getFriendDiaryActivities(userId);
-      setState({ activities, loading: false, error: null });
-    } catch (error) {
+    try {} catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";
       setState({ activities: [], loading: false, error: message });

[NoCoverage] BooleanLiteral
features/diary/hooks/useFriendDiaryActivities.ts:27:39
 
     try {
       const activities = await getFriendDiaryActivities(userId);
-      setState({ activities, loading: false, error: null });
+      setState({ activities, loading: true, error: null });
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";

[NoCoverage] BlockStatement
features/diary/hooks/useFriendDiaryActivities.ts:28:21
     try {
       const activities = await getFriendDiaryActivities(userId);
       setState({ activities, loading: false, error: null });
-    } catch (error) {
-      const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";
-      setState({ activities: [], loading: false, error: message });
-    }
+    } catch (error) {}
   }, [enabled, userId]);
 

[NoCoverage] BooleanLiteral
features/diary/hooks/useFriendDiaryActivities.ts:30:43
       setState({ activities, loading: false, error: null });
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";
-      setState({ activities: [], loading: false, error: message });
+      setState({ activities: [], loading: true, error: message });
     }
   }, [enabled, userId]);

[NoCoverage] ArrayDeclaration
features/diary/hooks/useFriendDiaryActivities.ts:30:30
       setState({ activities, loading: false, error: null });
     } catch (error) {
       const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";
-      setState({ activities: [], loading: false, error: message });
+      setState({ activities: ["Stryker was here"], loading: false, error: message });
     }
   }, [enabled, userId]);

[NoCoverage] ArrayDeclaration
features/diary/hooks/useFriendDiaryActivities.ts:32:6
       const message = error instanceof Error ? error.message : "Falha ao carregar atividade dos amigos.";
       setState({ activities: [], loading: false, error: message });
     }
-  }, [enabled, userId]);
+  }, []);
 
   useEffect(() => {
