[Killed] BlockStatement
features/auth/logic/profileSync.ts:11:84
    avatarUrl: string | null;
 }
 
-export function toAuthProfile(raw: RawAuthProfile | null | undefined): AuthProfile {
-   return {
-      username: raw?.username ?? "",
-      avatarUrl: raw?.avatar_url ?? null,
-   };
-}
+export function toAuthProfile(raw: RawAuthProfile | null | undefined): AuthProfile {}
 
 export function shouldRefreshProfileOnPath(pathname: string): boolean {
killedBy: useAuthState loads session profile on startup
statusReason: expected '' to be 'joao' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
features/auth/logic/profileSync.ts:13:17
 
 export function toAuthProfile(raw: RawAuthProfile | null | undefined): AuthProfile {
    return {
-      username: raw?.username ?? "",
+      username: raw?.username && "",
       avatarUrl: raw?.avatar_url ?? null,
    };
killedBy: useAuthState loads session profile on startup
statusReason: expected '' to be 'joao' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
features/auth/logic/profileSync.ts:13:17
 
 export function toAuthProfile(raw: RawAuthProfile | null | undefined): AuthProfile {
    return {
-      username: raw?.username ?? "",
+      username: raw.username ?? "",
       avatarUrl: raw?.avatar_url ?? null,
    };
killedBy: profileSync logic normalizes profile payload from Supabase
statusReason: Cannot read properties of null (reading 'username')

[Killed] LogicalOperator
features/auth/logic/profileSync.ts:14:18
 export function toAuthProfile(raw: RawAuthProfile | null | undefined): AuthProfile {
    return {
       username: raw?.username ?? "",
-      avatarUrl: raw?.avatar_url ?? null,
+      avatarUrl: raw?.avatar_url && null,
    };
 }
killedBy: useAuthState loads session profile on startup
statusReason: expected null to be 'avatar.png' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] OptionalChaining
features/auth/logic/profileSync.ts:14:18
 export function toAuthProfile(raw: RawAuthProfile | null | undefined): AuthProfile {
    return {
       username: raw?.username ?? "",
-      avatarUrl: raw?.avatar_url ?? null,
+      avatarUrl: raw.avatar_url ?? null,
    };
 }
killedBy: profileSync logic normalizes profile payload from Supabase
statusReason: Cannot read properties of null (reading 'avatar_url')

[Killed] BlockStatement
features/auth/logic/profileSync.ts:18:71
    };
 }
 
-export function shouldRefreshProfileOnPath(pathname: string): boolean {
-   return pathname === "/" || pathname === "/batalha";
-}
+export function shouldRefreshProfileOnPath(pathname: string): boolean {}
 
killedBy: profileSync logic refreshes profile on home and battle routes
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
features/auth/logic/profileSync.ts:19:11
 }
 
 export function shouldRefreshProfileOnPath(pathname: string): boolean {
-   return pathname === "/" || pathname === "/batalha";
+   return pathname === "/" && pathname === "/batalha";
 }
 
killedBy: profileSync logic refreshes profile on home and battle routes
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
features/auth/logic/profileSync.ts:19:11
 }
 
 export function shouldRefreshProfileOnPath(pathname: string): boolean {
-   return pathname === "/" || pathname === "/batalha";
+   return pathname !== "/" || pathname === "/batalha";
 }
 
killedBy: profileSync logic refreshes profile on home and battle routes
statusReason: expected false to be true // Object.is equality
