[Killed] BlockStatement
features/profile/services/securityService.ts:3:100
 import { supabase } from "@/lib/supabase";
 
-export async function verifyCurrentPassword(email: string, currentPassword: string): Promise<void> {
-   const { error } = await supabase.auth.signInWithPassword({
-      email,
-      password: currentPassword,
-   });
-
-   if (error) {
-      throw new Error("A senha atual está incorreta.");
-   }
-}
+export async function verifyCurrentPassword(email: string, currentPassword: string): Promise<void> {}
 
 export async function updateCurrentUserPassword(newPassword: string): Promise<void> {
killedBy: securityService throws a friendly error when current password is invalid
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
features/profile/services/securityService.ts:9:15
       password: currentPassword,
    });
 
-   if (error) {
-      throw new Error("A senha atual está incorreta.");
-   }
+   if (error) {}
 }
 
killedBy: securityService throws a friendly error when current password is invalid
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
features/profile/services/securityService.ts:19:65
    if (error) throw error;
 }
 
-export async function deleteCurrentUserAccount(): Promise<void> {
-   const { error } = await supabase.rpc("delete_user");
-   if (error) throw error;
-}
+export async function deleteCurrentUserAccount(): Promise<void> {}
 
killedBy: securityService throws when deleting current user account fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
features/profile/services/securityService.ts:21:8
 
 export async function deleteCurrentUserAccount(): Promise<void> {
    const { error } = await supabase.rpc("delete_user");
-   if (error) throw error;
+   if (true) throw error;
 }
 
killedBy: securityService deletes current user account
statusReason: promise rejected "null" instead of resolving

[Killed] ConditionalExpression
features/profile/services/securityService.ts:21:8
 
 export async function deleteCurrentUserAccount(): Promise<void> {
    const { error } = await supabase.rpc("delete_user");
-   if (error) throw error;
+   if (false) throw error;
 }
 
killedBy: securityService throws when deleting current user account fails
statusReason: promise resolved "undefined" instead of rejecting
