[Killed] BlockStatement
features/friends/logic/mapFriendshipStatus.ts:21:28
    currentUserId: string | undefined,
    profileId: string | undefined,
    friendship: FriendshipLike | null
-): DerivedFriendshipStatus {
-   
-   if (!currentUserId || !profileId) return "none";
-
-   if (currentUserId === profileId) return "self";
-
-   if (!friendship || friendship.status === "declined") return "none";
-
-   if (friendship.status === "accepted") return "friends";
-
-   if (friendship.status === "pending") {
-      if (friendship.requester_id === currentUserId) {
-         return "request_sent";
-      }
-      if (friendship.receiver_id === currentUserId) {
-         return "request_received";
-      }
-   }
-
-   return "none";
-}
+): DerivedFriendshipStatus {}
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'self' se o usuário estiver vendo o próprio perfil
statusReason: expected undefined to be 'self' // Object.is equality

[Killed] BooleanLiteral
features/friends/logic/mapFriendshipStatus.ts:23:26
    friendship: FriendshipLike | null
 ): DerivedFriendshipStatus {
    
-   if (!currentUserId || !profileId) return "none";
+   if (!currentUserId || profileId) return "none";
 
    if (currentUserId === profileId) return "self";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'self' se o usuário estiver vendo o próprio perfil
statusReason: expected 'none' to be 'self' // Object.is equality

[Killed] ConditionalExpression
features/friends/logic/mapFriendshipStatus.ts:23:8
    friendship: FriendshipLike | null
 ): DerivedFriendshipStatus {
    
-   if (!currentUserId || !profileId) return "none";
+   if (true) return "none";
 
    if (currentUserId === profileId) return "self";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'self' se o usuário estiver vendo o próprio perfil
statusReason: expected 'none' to be 'self' // Object.is equality

[Killed] EqualityOperator
features/friends/logic/mapFriendshipStatus.ts:25:8
    
    if (!currentUserId || !profileId) return "none";
 
-   if (currentUserId === profileId) return "self";
+   if (currentUserId !== profileId) return "self";
 
    if (!friendship || friendship.status === "declined") return "none";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'self' se o usuário estiver vendo o próprio perfil
statusReason: expected 'none' to be 'self' // Object.is equality

[Killed] ConditionalExpression
features/friends/logic/mapFriendshipStatus.ts:25:8
    
    if (!currentUserId || !profileId) return "none";
 
-   if (currentUserId === profileId) return "self";
+   if (true) return "self";
 
    if (!friendship || friendship.status === "declined") return "none";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'none' se não houver registro de amizade
statusReason: expected 'self' to be 'none' // Object.is equality

[Killed] EqualityOperator
features/friends/logic/mapFriendshipStatus.ts:27:23
 
    if (currentUserId === profileId) return "self";
 
-   if (!friendship || friendship.status === "declined") return "none";
+   if (!friendship || friendship.status !== "declined") return "none";
 
    if (friendship.status === "accepted") return "friends";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'friends' se o convite foi aceito
statusReason: expected 'none' to be 'friends' // Object.is equality

[Killed] LogicalOperator
features/friends/logic/mapFriendshipStatus.ts:27:8
 
    if (currentUserId === profileId) return "self";
 
-   if (!friendship || friendship.status === "declined") return "none";
+   if (!friendship && friendship.status === "declined") return "none";
 
    if (friendship.status === "accepted") return "friends";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'none' se não houver registro de amizade
statusReason: Cannot read properties of null (reading 'status')

[Killed] ConditionalExpression
features/friends/logic/mapFriendshipStatus.ts:29:8
 
    if (!friendship || friendship.status === "declined") return "none";
 
-   if (friendship.status === "accepted") return "friends";
+   if (true) return "friends";
 
    if (friendship.status === "pending") {
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_sent' se o usuário logado enviou o convite pendente
statusReason: expected 'friends' to be 'request_sent' // Object.is equality

[Killed] EqualityOperator
features/friends/logic/mapFriendshipStatus.ts:29:8
 
    if (!friendship || friendship.status === "declined") return "none";
 
-   if (friendship.status === "accepted") return "friends";
+   if (friendship.status !== "accepted") return "friends";
 
    if (friendship.status === "pending") {
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'friends' se o convite foi aceito
statusReason: expected 'none' to be 'friends' // Object.is equality

[Killed] BlockStatement
features/friends/logic/mapFriendshipStatus.ts:31:41
 
    if (friendship.status === "accepted") return "friends";
 
-   if (friendship.status === "pending") {
-      if (friendship.requester_id === currentUserId) {
-         return "request_sent";
-      }
-      if (friendship.receiver_id === currentUserId) {
-         return "request_received";
-      }
-   }
+   if (friendship.status === "pending") {}
 
    return "none";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_sent' se o usuário logado enviou o convite pendente
statusReason: expected 'none' to be 'request_sent' // Object.is equality

[Killed] EqualityOperator
features/friends/logic/mapFriendshipStatus.ts:31:8
 
    if (friendship.status === "accepted") return "friends";
 
-   if (friendship.status === "pending") {
+   if (friendship.status !== "pending") {
       if (friendship.requester_id === currentUserId) {
          return "request_sent";
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_sent' se o usuário logado enviou o convite pendente
statusReason: expected 'none' to be 'request_sent' // Object.is equality

[Killed] ConditionalExpression
features/friends/logic/mapFriendshipStatus.ts:32:11
    if (friendship.status === "accepted") return "friends";
 
    if (friendship.status === "pending") {
-      if (friendship.requester_id === currentUserId) {
+      if (false) {
          return "request_sent";
       }
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_sent' se o usuário logado enviou o convite pendente
statusReason: expected 'none' to be 'request_sent' // Object.is equality

[Killed] EqualityOperator
features/friends/logic/mapFriendshipStatus.ts:32:11
    if (friendship.status === "accepted") return "friends";
 
    if (friendship.status === "pending") {
-      if (friendship.requester_id === currentUserId) {
+      if (friendship.requester_id !== currentUserId) {
          return "request_sent";
       }
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_sent' se o usuário logado enviou o convite pendente
statusReason: expected 'none' to be 'request_sent' // Object.is equality

[Killed] EqualityOperator
features/friends/logic/mapFriendshipStatus.ts:35:11
       if (friendship.requester_id === currentUserId) {
          return "request_sent";
       }
-      if (friendship.receiver_id === currentUserId) {
+      if (friendship.receiver_id !== currentUserId) {
          return "request_received";
       }
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_received' se o usuário logado recebeu o convite pendente
statusReason: expected 'none' to be 'request_received' // Object.is equality

[Killed] BlockStatement
features/friends/logic/mapFriendshipStatus.ts:35:53
       if (friendship.requester_id === currentUserId) {
          return "request_sent";
       }
-      if (friendship.receiver_id === currentUserId) {
-         return "request_received";
-      }
+      if (friendship.receiver_id === currentUserId) {}
    }
 
killedBy: mapFriendshipStatus (Functional Core) Caminhos de Corretude deve retornar 'request_received' se o usuário logado recebeu o convite pendente
statusReason: expected 'none' to be 'request_received' // Object.is equality

[NoCoverage] StringLiteral
features/friends/logic/mapFriendshipStatus.ts:40:11
       }
    }
 
-   return "none";
+   return "";
 }
