[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyGuessSuggestions.ts:28:69
    source,
 }: UseDailyGuessSuggestionsParams) {
    const [suggestions, setSuggestions] = useState<GuessSuggestion[]>([]);
-   const [isLoadingSuggestions, setIsLoadingSuggestions] = useState(false);
+   const [isLoadingSuggestions, setIsLoadingSuggestions] = useState(true);
 
    useEffect(() => {

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyGuessSuggestions.ts:31:20
    const [isLoadingSuggestions, setIsLoadingSuggestions] = useState(false);
 
    useEffect(() => {
-      let ignore = false;
+      let ignore = true;
 
       async function loadSuggestions() {

[NoCoverage] MethodExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:34:24
       let ignore = false;
 
       async function loadSuggestions() {
-         const query = guessText.trim();
+         const query = guessText;
          if (query.length < 2 || selectedGuessTitle === guessText) {
             setSuggestions([]);

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyGuessSuggestions.ts:35:14
 
       async function loadSuggestions() {
          const query = guessText.trim();
-         if (query.length < 2 || selectedGuessTitle === guessText) {
+         if (query.length >= 2 || selectedGuessTitle === guessText) {
             setSuggestions([]);
             return;

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:35:14
 
       async function loadSuggestions() {
          const query = guessText.trim();
-         if (query.length < 2 || selectedGuessTitle === guessText) {
+         if (true) {
             setSuggestions([]);
             return;

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyGuessSuggestions.ts:40:34
             return;
          }
 
-         setIsLoadingSuggestions(true);
+         setIsLoadingSuggestions(false);
 
          try {

[NoCoverage] MethodExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:43:27
          setIsLoadingSuggestions(true);
 
          try {
-            const local = customPool
-               .filter((movie) => normalizeText(movie.title).includes(normalizeText(query)))
-               .slice(0, 5)
+            const local = customPool.filter(movie => normalizeText(movie.title).includes(normalizeText(query)))
                .map((movie) => ({
                   id: movie.tmdb_id,

[NoCoverage] MethodExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:43:27
          setIsLoadingSuggestions(true);
 
          try {
-            const local = customPool
-               .filter((movie) => normalizeText(movie.title).includes(normalizeText(query)))
+            const local = customPool
                .slice(0, 5)
                .map((movie) => ({

[NoCoverage] ArrowFunction
components/GamesHub/hooks/useDailyGuessSuggestions.ts:44:24
 
          try {
             const local = customPool
-               .filter((movie) => normalizeText(movie.title).includes(normalizeText(query)))
+               .filter(() => undefined)
                .slice(0, 5)
                .map((movie) => ({

[NoCoverage] ArrowFunction
components/GamesHub/hooks/useDailyGuessSuggestions.ts:46:21
             const local = customPool
                .filter((movie) => normalizeText(movie.title).includes(normalizeText(query)))
                .slice(0, 5)
-               .map((movie) => ({
-                  id: movie.tmdb_id,
-                  title: movie.title || "Sem titulo",
-                  localMovie: movie,
-               }));
+               .map(() => undefined);
 
             const tmdb = shouldUseTmdbSuggestions(source)

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:48:26
                .slice(0, 5)
                .map((movie) => ({
                   id: movie.tmdb_id,
-                  title: movie.title || "Sem titulo",
+                  title: false,
                   localMovie: movie,
                }));

[NoCoverage] LogicalOperator
components/GamesHub/hooks/useDailyGuessSuggestions.ts:48:26
                .slice(0, 5)
                .map((movie) => ({
                   id: movie.tmdb_id,
-                  title: movie.title || "Sem titulo",
+                  title: movie.title && "Sem titulo",
                   localMovie: movie,
                }));

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:53:19
                }));
 
             const tmdb = shouldUseTmdbSuggestions(source)
-               ? (((await searchMovies(query)) as TmdbSearchMovieResult[]) || []).slice(0, 6).map((item) => ({
+               ? (false).slice(0, 6).map((item) => ({
                   id: item.id,
                   title: item.title || "Sem titulo",

[NoCoverage] LogicalOperator
components/GamesHub/hooks/useDailyGuessSuggestions.ts:53:19
                }));
 
             const tmdb = shouldUseTmdbSuggestions(source)
-               ? (((await searchMovies(query)) as TmdbSearchMovieResult[]) || []).slice(0, 6).map((item) => ({
+               ? ((await searchMovies(query)) as TmdbSearchMovieResult[] && []).slice(0, 6).map((item) => ({
                   id: item.id,
                   title: item.title || "Sem titulo",

[NoCoverage] LogicalOperator
components/GamesHub/hooks/useDailyGuessSuggestions.ts:55:26
             const tmdb = shouldUseTmdbSuggestions(source)
                ? (((await searchMovies(query)) as TmdbSearchMovieResult[]) || []).slice(0, 6).map((item) => ({
                   id: item.id,
-                  title: item.title || "Sem titulo",
+                  title: item.title && "Sem titulo",
                }))
                : [];

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:55:26
             const tmdb = shouldUseTmdbSuggestions(source)
                ? (((await searchMovies(query)) as TmdbSearchMovieResult[]) || []).slice(0, 6).map((item) => ({
                   id: item.id,
-                  title: item.title || "Sem titulo",
+                  title: false,
                }))
                : [];

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyGuessSuggestions.ts:59:77
                }))
                : [];
 
-            const merged = [...local, ...tmdb].filter((item, index, arr) => {
-               const key = normalizeText(item.title);
-               return arr.findIndex((other) => normalizeText(other.title) === key) === index;
-            }).slice(0, 8);
+            const merged = [...local, ...tmdb].filter((item, index, arr) => {}).slice(0, 8);
 
             if (!ignore) {

[NoCoverage] MethodExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:59:28
                }))
                : [];
 
-            const merged = [...local, ...tmdb].filter((item, index, arr) => {
-               const key = normalizeText(item.title);
-               return arr.findIndex((other) => normalizeText(other.title) === key) === index;
-            }).slice(0, 8);
+            const merged = [...local, ...tmdb].filter((item, index, arr) => {
+  const key = normalizeText(item.title);
+  return arr.findIndex(other => normalizeText(other.title) === key) === index;
+});
 
             if (!ignore) {

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:61:23
 
             const merged = [...local, ...tmdb].filter((item, index, arr) => {
                const key = normalizeText(item.title);
-               return arr.findIndex((other) => normalizeText(other.title) === key) === index;
+               return true;
             }).slice(0, 8);
 

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:61:23
 
             const merged = [...local, ...tmdb].filter((item, index, arr) => {
                const key = normalizeText(item.title);
-               return arr.findIndex((other) => normalizeText(other.title) === key) === index;
+               return false;
             }).slice(0, 8);
 

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:64:17
                return arr.findIndex((other) => normalizeText(other.title) === key) === index;
             }).slice(0, 8);
 
-            if (!ignore) {
+            if (false) {
                setSuggestions(merged);
             }

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:64:17
                return arr.findIndex((other) => normalizeText(other.title) === key) === index;
             }).slice(0, 8);
 
-            if (!ignore) {
+            if (true) {
                setSuggestions(merged);
             }

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyGuessSuggestions.ts:67:20
             if (!ignore) {
                setSuggestions(merged);
             }
-         } finally {
-            if (!ignore) {
-               setIsLoadingSuggestions(false);
-            }
-         }
+         } finally {}
       }
 

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:68:17
                setSuggestions(merged);
             }
          } finally {
-            if (!ignore) {
+            if (false) {
                setIsLoadingSuggestions(false);
             }

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyGuessSuggestions.ts:68:17
                setSuggestions(merged);
             }
          } finally {
-            if (!ignore) {
+            if (true) {
                setIsLoadingSuggestions(false);
             }

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyGuessSuggestions.ts:69:40
             }
          } finally {
             if (!ignore) {
-               setIsLoadingSuggestions(false);
+               setIsLoadingSuggestions(true);
             }
          }

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyGuessSuggestions.ts:74:38
          }
       }
 
-      const timer = setTimeout(() => {
-         void loadSuggestions();
-      }, 220);
+      const timer = setTimeout(() => {}, 220);
 
       return () => {

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyGuessSuggestions.ts:78:20
          void loadSuggestions();
       }, 220);
 
-      return () => {
-         ignore = true;
-         clearTimeout(timer);
-      };
+      return () => {};
    }, [guessText, customPool, selectedGuessTitle, source]);
 

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyGuessSuggestions.ts:79:19
       }, 220);
 
       return () => {
-         ignore = true;
+         ignore = false;
          clearTimeout(timer);
       };

[NoCoverage] ArrayDeclaration
components/GamesHub/hooks/useDailyGuessSuggestions.ts:82:7
          ignore = true;
          clearTimeout(timer);
       };
-   }, [guessText, customPool, selectedGuessTitle, source]);
+   }, []);
 
    return {

[NoCoverage] ArrowFunction
components/GamesHub/hooks/useDailyGuessSuggestions.ts:87:25
    return {
       suggestions,
       isLoadingSuggestions,
-      clearSuggestions: () => setSuggestions([]),
+      clearSuggestions: () => undefined,
    };
 }
