[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:59:63
 }: UseDailyMovieGameParams) {
    const [guessText, setGuessText] = useState("");
    const [selectedGuess, setSelectedGuess] = useState<GuessSuggestion | null>(null);
-   const [isSubmittingGuess, setIsSubmittingGuess] = useState(false);
+   const [isSubmittingGuess, setIsSubmittingGuess] = useState(true);
    const [lives, setLives] = useState(MAX_LIVES);
    const [guesses, setGuesses] = useState<GuessResult[]>([]);

[NoCoverage] ArrayDeclaration
components/GamesHub/hooks/useDailyMovieGame.ts:61:58
    const [selectedGuess, setSelectedGuess] = useState<GuessSuggestion | null>(null);
    const [isSubmittingGuess, setIsSubmittingGuess] = useState(false);
    const [lives, setLives] = useState(MAX_LIVES);
-   const [guesses, setGuesses] = useState<GuessResult[]>([]);
+   const [guesses, setGuesses] = useState<GuessResult[]>(["Stryker was here"]);
    const [targetMovie, setTargetMovie] = useState<GameMovieProfile | null>(null);
    const [sessionId, setSessionId] = useState<string | null>(null);

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:64:55
    const [guesses, setGuesses] = useState<GuessResult[]>([]);
    const [targetMovie, setTargetMovie] = useState<GameMovieProfile | null>(null);
    const [sessionId, setSessionId] = useState<string | null>(null);
-   const [targetLoading, setTargetLoading] = useState(false);
+   const [targetLoading, setTargetLoading] = useState(true);
    const [targetError, setTargetError] = useState<string | null>(null);
    const [runId, setRunId] = useState(0);

[NoCoverage] ArrowFunction
components/GamesHub/hooks/useDailyMovieGame.ts:71:7
 
    const dateKey = getTodayKey();
    const progressStorageKey = useMemo(
-      () => `daily-game-progress:${mode}:${source}:${selectedListId}:${dateKey}`,
+      () => undefined,
       [mode, source, selectedListId, dateKey]
    );

[NoCoverage] ArrayDeclaration
components/GamesHub/hooks/useDailyMovieGame.ts:72:7
    const dateKey = getTodayKey();
    const progressStorageKey = useMemo(
       () => `daily-game-progress:${mode}:${source}:${selectedListId}:${dateKey}`,
-      [mode, source, selectedListId, dateKey]
+      []
    );
 

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:75:38
       [mode, source, selectedListId, dateKey]
    );
 
-   const sourceLabel = useMemo(() => {
-      if (source === "global_daily") return "Filme do dia global";
-      if (source === "my_watched") return "Meus assistidos";
-      const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";
-      return `Lista: ${selectedListName}`;
-   }, [lists, selectedListId, source]);
+   const sourceLabel = useMemo(() => {}, [lists, selectedListId, source]);
 
    const customPool = useMemo(() => {

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:76:11
    );
 
    const sourceLabel = useMemo(() => {
-      if (source === "global_daily") return "Filme do dia global";
+      if (false) return "Filme do dia global";
       if (source === "my_watched") return "Meus assistidos";
       const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:76:11
    );
 
    const sourceLabel = useMemo(() => {
-      if (source === "global_daily") return "Filme do dia global";
+      if (true) return "Filme do dia global";
       if (source === "my_watched") return "Meus assistidos";
       const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:77:11
 
    const sourceLabel = useMemo(() => {
       if (source === "global_daily") return "Filme do dia global";
-      if (source === "my_watched") return "Meus assistidos";
+      if (true) return "Meus assistidos";
       const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";
       return `Lista: ${selectedListName}`;

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:77:11
 
    const sourceLabel = useMemo(() => {
       if (source === "global_daily") return "Filme do dia global";
-      if (source === "my_watched") return "Meus assistidos";
+      if (source !== "my_watched") return "Meus assistidos";
       const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";
       return `Lista: ${selectedListName}`;

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:78:53
    const sourceLabel = useMemo(() => {
       if (source === "global_daily") return "Filme do dia global";
       if (source === "my_watched") return "Meus assistidos";
-      const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";
+      const selectedListName = lists.find((list) => false)?.name || "Lista selecionada";
       return `Lista: ${selectedListName}`;
    }, [lists, selectedListId, source]);

[NoCoverage] OptionalChaining
components/GamesHub/hooks/useDailyMovieGame.ts:78:32
    const sourceLabel = useMemo(() => {
       if (source === "global_daily") return "Filme do dia global";
       if (source === "my_watched") return "Meus assistidos";
-      const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";
+      const selectedListName = lists.find(list => list.id === selectedListId).name || "Lista selecionada";
       return `Lista: ${selectedListName}`;
    }, [lists, selectedListId, source]);

[NoCoverage] StringLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:79:14
       if (source === "global_daily") return "Filme do dia global";
       if (source === "my_watched") return "Meus assistidos";
       const selectedListName = lists.find((list) => list.id === selectedListId)?.name || "Lista selecionada";
-      return `Lista: ${selectedListName}`;
+      return ``;
    }, [lists, selectedListId, source]);
 

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:82:37
       return `Lista: ${selectedListName}`;
    }, [lists, selectedListId, source]);
 
-   const customPool = useMemo(() => {
-      if (source === "my_watched") return watchedMovies;
-      if (source === "list_scope") return listMovies;
-      return watchedMovies;
-   }, [source, watchedMovies, listMovies]);
+   const customPool = useMemo(() => {}, [source, watchedMovies, listMovies]);
 
    const {

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:83:11
    }, [lists, selectedListId, source]);
 
    const customPool = useMemo(() => {
-      if (source === "my_watched") return watchedMovies;
+      if (true) return watchedMovies;
       if (source === "list_scope") return listMovies;
       return watchedMovies;

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:83:11
    }, [lists, selectedListId, source]);
 
    const customPool = useMemo(() => {
-      if (source === "my_watched") return watchedMovies;
+      if (false) return watchedMovies;
       if (source === "list_scope") return listMovies;
       return watchedMovies;

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:84:11
 
    const customPool = useMemo(() => {
       if (source === "my_watched") return watchedMovies;
-      if (source === "list_scope") return listMovies;
+      if (source !== "list_scope") return listMovies;
       return watchedMovies;
    }, [source, watchedMovies, listMovies]);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:84:11
 
    const customPool = useMemo(() => {
       if (source === "my_watched") return watchedMovies;
-      if (source === "list_scope") return listMovies;
+      if (false) return listMovies;
       return watchedMovies;
    }, [source, watchedMovies, listMovies]);

[NoCoverage] ArrayDeclaration
components/GamesHub/hooks/useDailyMovieGame.ts:86:7
       if (source === "my_watched") return watchedMovies;
       if (source === "list_scope") return listMovies;
       return watchedMovies;
-   }, [source, watchedMovies, listMovies]);
+   }, []);
 
    const {

[NoCoverage] OptionalChaining
components/GamesHub/hooks/useDailyMovieGame.ts:94:27
       clearSuggestions,
    } = useDailyGuessSuggestions({
       guessText,
-      selectedGuessTitle: selectedGuess?.title,
+      selectedGuessTitle: selectedGuess.title,
       customPool,
       source,

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:103:14
       let ignore = false;
 
       async function loadTargetMovie() {
-         if (runId === 0) {
+         if (false) {
             const persisted = loadDailyGameProgress(progressStorageKey);
 

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:103:14
       let ignore = false;
 
       async function loadTargetMovie() {
-         if (runId === 0) {
+         if (runId !== 0) {
             const persisted = loadDailyGameProgress(progressStorageKey);
 

[NoCoverage] LogicalOperator
components/GamesHub/hooks/useDailyMovieGame.ts:106:17
          if (runId === 0) {
             const persisted = loadDailyGameProgress(progressStorageKey);
 
-            if (persisted?.dateKey === dateKey && persisted?.targetMovie) {
+            if (persisted?.dateKey === dateKey || persisted?.targetMovie) {
                if (!ignore) {
                   setTargetError(null);

[NoCoverage] OptionalChaining
components/GamesHub/hooks/useDailyMovieGame.ts:106:51
          if (runId === 0) {
             const persisted = loadDailyGameProgress(progressStorageKey);
 
-            if (persisted?.dateKey === dateKey && persisted?.targetMovie) {
+            if (persisted?.dateKey === dateKey && persisted.targetMovie) {
                if (!ignore) {
                   setTargetError(null);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:107:20
             const persisted = loadDailyGameProgress(progressStorageKey);
 
             if (persisted?.dateKey === dateKey && persisted?.targetMovie) {
-               if (!ignore) {
+               if (true) {
                   setTargetError(null);
                   setTargetMovie(persisted.targetMovie);

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:107:20
             const persisted = loadDailyGameProgress(progressStorageKey);
 
             if (persisted?.dateKey === dateKey && persisted?.targetMovie) {
-               if (!ignore) {
+               if (ignore) {
                   setTargetError(null);
                   setTargetMovie(persisted.targetMovie);

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:110:28
                if (!ignore) {
                   setTargetError(null);
                   setTargetMovie(persisted.targetMovie);
-                  setLives(typeof persisted.lives === "number" ? persisted.lives : MAX_LIVES);
+                  setLives(typeof persisted.lives !== "number" ? persisted.lives : MAX_LIVES);
                   setGuesses(Array.isArray(persisted.guesses) ? persisted.guesses : []);
                   setSessionId(persisted.sessionId || null);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:110:28
                if (!ignore) {
                   setTargetError(null);
                   setTargetMovie(persisted.targetMovie);
-                  setLives(typeof persisted.lives === "number" ? persisted.lives : MAX_LIVES);
+                  setLives(false ? persisted.lives : MAX_LIVES);
                   setGuesses(Array.isArray(persisted.guesses) ? persisted.guesses : []);
                   setSessionId(persisted.sessionId || null);

[NoCoverage] LogicalOperator
components/GamesHub/hooks/useDailyMovieGame.ts:112:32
                   setTargetMovie(persisted.targetMovie);
                   setLives(typeof persisted.lives === "number" ? persisted.lives : MAX_LIVES);
                   setGuesses(Array.isArray(persisted.guesses) ? persisted.guesses : []);
-                  setSessionId(persisted.sessionId || null);
+                  setSessionId(persisted.sessionId && null);
                   setRevealedHintFields(Array.isArray(persisted.revealedHintFields) ? persisted.revealedHintFields : []);
                   setGuessText("");

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:112:32
                   setTargetMovie(persisted.targetMovie);
                   setLives(typeof persisted.lives === "number" ? persisted.lives : MAX_LIVES);
                   setGuesses(Array.isArray(persisted.guesses) ? persisted.guesses : []);
-                  setSessionId(persisted.sessionId || null);
+                  setSessionId(true);
                   setRevealedHintFields(Array.isArray(persisted.revealedHintFields) ? persisted.revealedHintFields : []);
                   setGuessText("");

[NoCoverage] StringLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:114:32
                   setGuesses(Array.isArray(persisted.guesses) ? persisted.guesses : []);
                   setSessionId(persisted.sessionId || null);
                   setRevealedHintFields(Array.isArray(persisted.revealedHintFields) ? persisted.revealedHintFields : []);
-                  setGuessText("");
+                  setGuessText("Stryker was here!");
                   setSelectedGuess(null);
                   setTargetLoading(false);

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:116:36
                   setRevealedHintFields(Array.isArray(persisted.revealedHintFields) ? persisted.revealedHintFields : []);
                   setGuessText("");
                   setSelectedGuess(null);
-                  setTargetLoading(false);
+                  setTargetLoading(true);
                }
                return;

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:122:27
             }
          }
 
-         setTargetLoading(true);
+         setTargetLoading(false);
          setTargetError(null);
          setTargetMovie(null);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:135:17
          try {
             let target: GameMovieProfile | null = null;
 
-            if (source === "global_daily") {
+            if (false) {
                const dailySeed = buildDailySeed(dateKey, "global", mode);
                const tmdbId = pickDeterministicMovie(GLOBAL_DAILY_TMDB_IDS, dailySeed);

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:135:17
          try {
             let target: GameMovieProfile | null = null;
 
-            if (source === "global_daily") {
+            if (source !== "global_daily") {
                const dailySeed = buildDailySeed(dateKey, "global", mode);
                const tmdbId = pickDeterministicMovie(GLOBAL_DAILY_TMDB_IDS, dailySeed);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:139:20
                const dailySeed = buildDailySeed(dateKey, "global", mode);
                const tmdbId = pickDeterministicMovie(GLOBAL_DAILY_TMDB_IDS, dailySeed);
 
-               if (!tmdbId) {
+               if (false) {
                   if (!ignore) setTargetError("Nao foi possivel gerar o filme do dia global.");
                   return;

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:139:20
                const dailySeed = buildDailySeed(dateKey, "global", mode);
                const tmdbId = pickDeterministicMovie(GLOBAL_DAILY_TMDB_IDS, dailySeed);
 
-               if (!tmdbId) {
+               if (tmdbId) {
                   if (!ignore) setTargetError("Nao foi possivel gerar o filme do dia global.");
                   return;

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:140:23
                const tmdbId = pickDeterministicMovie(GLOBAL_DAILY_TMDB_IDS, dailySeed);
 
                if (!tmdbId) {
-                  if (!ignore) setTargetError("Nao foi possivel gerar o filme do dia global.");
+                  if (ignore) setTargetError("Nao foi possivel gerar o filme do dia global.");
                   return;
                }

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:140:23
                const tmdbId = pickDeterministicMovie(GLOBAL_DAILY_TMDB_IDS, dailySeed);
 
                if (!tmdbId) {
-                  if (!ignore) setTargetError("Nao foi possivel gerar o filme do dia global.");
+                  if (false) setTargetError("Nao foi possivel gerar o filme do dia global.");
                   return;
                }

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:145:20
                }
 
                const details = await getMovieDetails(tmdbId);
-               if (!details) {
+               if (details) {
                   if (!ignore) setTargetError("Nao foi possivel carregar os detalhes do filme do dia.");
                   return;

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:145:30
                }
 
                const details = await getMovieDetails(tmdbId);
-               if (!details) {
-                  if (!ignore) setTargetError("Nao foi possivel carregar os detalhes do filme do dia.");
-                  return;
-               }
+               if (!details) {}
 
                target = toMovieProfileFromTmdb(details as TmdbMovieDetails);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:146:23
 
                const details = await getMovieDetails(tmdbId);
                if (!details) {
-                  if (!ignore) setTargetError("Nao foi possivel carregar os detalhes do filme do dia.");
+                  if (true) setTargetError("Nao foi possivel carregar os detalhes do filme do dia.");
                   return;
                }

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:146:23
 
                const details = await getMovieDetails(tmdbId);
                if (!details) {
-                  if (!ignore) setTargetError("Nao foi possivel carregar os detalhes do filme do dia.");
+                  if (false) setTargetError("Nao foi possivel carregar os detalhes do filme do dia.");
                   return;
                }

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:151:20
                }
 
                target = toMovieProfileFromTmdb(details as TmdbMovieDetails);
-            } else {
-               const scopeKey = source === "my_watched" ? "my_watched" : `list:${selectedListId || "none"}`;
-               const dailySeed = buildDailySeed(dateKey, scopeKey, mode);
-               const pickedMovie = pickDeterministicMovie(customPool, dailySeed);
-
-               if (!pickedMovie) {
-                  if (!ignore) {
-                     setTargetError(
-                        source === "list_scope"
-                           ? "Nao foi possivel gerar o filme do dia desta lista."
-                           : "Nao foi possivel gerar o filme do dia com seus assistidos."
-                     );
-                  }
-                  return;
-               }
-
-               target = toMovieProfileFromApp(pickedMovie);
-            }
+            } else {}
 
             if (!target) {

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:152:33
 
                target = toMovieProfileFromTmdb(details as TmdbMovieDetails);
             } else {
-               const scopeKey = source === "my_watched" ? "my_watched" : `list:${selectedListId || "none"}`;
+               const scopeKey = true ? "my_watched" : `list:${selectedListId || "none"}`;
                const dailySeed = buildDailySeed(dateKey, scopeKey, mode);
                const pickedMovie = pickDeterministicMovie(customPool, dailySeed);

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:152:33
 
                target = toMovieProfileFromTmdb(details as TmdbMovieDetails);
             } else {
-               const scopeKey = source === "my_watched" ? "my_watched" : `list:${selectedListId || "none"}`;
+               const scopeKey = false ? "my_watched" : `list:${selectedListId || "none"}`;
                const dailySeed = buildDailySeed(dateKey, scopeKey, mode);
                const pickedMovie = pickDeterministicMovie(customPool, dailySeed);

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:156:34
                const dailySeed = buildDailySeed(dateKey, scopeKey, mode);
                const pickedMovie = pickDeterministicMovie(customPool, dailySeed);
 
-               if (!pickedMovie) {
-                  if (!ignore) {
-                     setTargetError(
-                        source === "list_scope"
-                           ? "Nao foi possivel gerar o filme do dia desta lista."
-                           : "Nao foi possivel gerar o filme do dia com seus assistidos."
-                     );
-                  }
-                  return;
-               }
+               if (!pickedMovie) {}
 
                target = toMovieProfileFromApp(pickedMovie);

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:156:20
                const dailySeed = buildDailySeed(dateKey, scopeKey, mode);
                const pickedMovie = pickDeterministicMovie(customPool, dailySeed);
 
-               if (!pickedMovie) {
+               if (pickedMovie) {
                   if (!ignore) {
                      setTargetError(

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:157:23
                const pickedMovie = pickDeterministicMovie(customPool, dailySeed);
 
                if (!pickedMovie) {
-                  if (!ignore) {
+                  if (ignore) {
                      setTargetError(
                         source === "list_scope"

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:157:23
                const pickedMovie = pickDeterministicMovie(customPool, dailySeed);
 
                if (!pickedMovie) {
-                  if (!ignore) {
+                  if (false) {
                      setTargetError(
                         source === "list_scope"

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:159:25
                if (!pickedMovie) {
                   if (!ignore) {
                      setTargetError(
-                        source === "list_scope"
+                        source !== "list_scope"
                            ? "Nao foi possivel gerar o filme do dia desta lista."
                            : "Nao foi possivel gerar o filme do dia com seus assistidos."

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:159:25
                if (!pickedMovie) {
                   if (!ignore) {
                      setTargetError(
-                        source === "list_scope"
+                        false
                            ? "Nao foi possivel gerar o filme do dia desta lista."
                            : "Nao foi possivel gerar o filme do dia com seus assistidos."

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:170:17
                target = toMovieProfileFromApp(pickedMovie);
             }
 
-            if (!target) {
+            if (true) {
                if (!ignore) setTargetError("Nao foi possivel preparar o filme do dia.");
                return;

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:170:17
                target = toMovieProfileFromApp(pickedMovie);
             }
 
-            if (!target) {
+            if (false) {
                if (!ignore) setTargetError("Nao foi possivel preparar o filme do dia.");
                return;

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:171:20
             }
 
             if (!target) {
-               if (!ignore) setTargetError("Nao foi possivel preparar o filme do dia.");
+               if (false) setTargetError("Nao foi possivel preparar o filme do dia.");
                return;
             }

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:171:20
             }
 
             if (!target) {
-               if (!ignore) setTargetError("Nao foi possivel preparar o filme do dia.");
+               if (ignore) setTargetError("Nao foi possivel preparar o filme do dia.");
                return;
             }

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:176:25
             }
 
             let createdSessionId: string | null = null;
-            if (userId) {
-               createdSessionId = await startGameSession({
-                  userId,
-                  gameType: mode === "cover" ? "daily_cover" : "daily_riddle",
-                  sourceMode: source,
-                  dateKey,
-                  targetTmdbId: target.tmdbId,
-                  maxLives: MAX_LIVES,
-                  livesLeft: MAX_LIVES,
-               });
-            }
+            if (userId) {}
 
             if (!ignore) {

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:176:17
             }
 
             let createdSessionId: string | null = null;
-            if (userId) {
+            if (false) {
                createdSessionId = await startGameSession({
                   userId,

[NoCoverage] EqualityOperator
components/GamesHub/hooks/useDailyMovieGame.ts:179:29
             if (userId) {
                createdSessionId = await startGameSession({
                   userId,
-                  gameType: mode === "cover" ? "daily_cover" : "daily_riddle",
+                  gameType: mode !== "cover" ? "daily_cover" : "daily_riddle",
                   sourceMode: source,
                   dateKey,

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:179:29
             if (userId) {
                createdSessionId = await startGameSession({
                   userId,
-                  gameType: mode === "cover" ? "daily_cover" : "daily_riddle",
+                  gameType: true ? "daily_cover" : "daily_riddle",
                   sourceMode: source,
                   dateKey,

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:193:18
                setSessionId(createdSessionId);
                setTargetError(null);
             }
-         } catch {
-            if (!ignore) {
-               setTargetError("Nao foi possivel preparar o desafio diario.");
-            }
-         } finally {
+         } catch {} finally {
             if (!ignore) {
                setTargetLoading(false);

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:194:17
                setTargetError(null);
             }
          } catch {
-            if (!ignore) {
+            if (ignore) {
                setTargetError("Nao foi possivel preparar o desafio diario.");
             }

[NoCoverage] ConditionalExpression
components/GamesHub/hooks/useDailyMovieGame.ts:194:17
                setTargetError(null);
             }
          } catch {
-            if (!ignore) {
+            if (false) {
                setTargetError("Nao foi possivel preparar o desafio diario.");
             }

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:197:20
             if (!ignore) {
                setTargetError("Nao foi possivel preparar o desafio diario.");
             }
-         } finally {
-            if (!ignore) {
-               setTargetLoading(false);
-            }
-         }
+         } finally {}
       }
 

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:198:26
                setTargetError("Nao foi possivel preparar o desafio diario.");
             }
          } finally {
-            if (!ignore) {
-               setTargetLoading(false);
-            }
+            if (!ignore) {}
          }
       }

[NoCoverage] BooleanLiteral
components/GamesHub/hooks/useDailyMovieGame.ts:199:33
             }
          } finally {
             if (!ignore) {
-               setTargetLoading(false);
+               setTargetLoading(true);
             }
          }

[NoCoverage] BlockStatement
components/GamesHub/hooks/useDailyMovieGame.ts:206:20
 
       void loadTargetMovie();
 
-      return () => {
-         ignore = true;
-      };
+      return () => {};
    }, [runId, progressStorageKey, dateKey, source, mode, selectedListId, customPool, userId]);
 

[NoCoverage] ArrayDeclaration
components/GamesHub/hooks/useDailyMovieGame.ts:209:7
       return () => {
          ignore = true;
       };
-   }, [runId, progressStorageKey, dateKey, source, mode, selectedListId, customPool, userId]);
+   }, []);
 
    useEffect(() => {
