[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:38:12
   "japan": "Japao",
   "france": "Franca",
   "germany": "Alemanha",
-  "italy": "Italia",
+  "italy": "",
   "spain": "Espanha",
   "portugal": "Portugal",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:39:12
   "france": "Franca",
   "germany": "Alemanha",
   "italy": "Italia",
-  "spain": "Espanha",
+  "spain": "",
   "portugal": "Portugal",
   "brazil": "Brasil",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:48:16
   "china": "China",
   "taiwan": "Taiwan",
   "india": "India",
-  "australia": "Australia",
+  "australia": "",
   "new zealand": "Nova Zelandia",
   "sweden": "Suecia",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:52:14
   "new zealand": "Nova Zelandia",
   "sweden": "Suecia",
   "norway": "Noruega",
-  "denmark": "Dinamarca",
+  "denmark": "",
   "netherlands": "Paises Baixos",
   "ireland": "Irlanda",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:53:18
   "sweden": "Suecia",
   "norway": "Noruega",
   "denmark": "Dinamarca",
-  "netherlands": "Paises Baixos",
+  "netherlands": "",
   "ireland": "Irlanda",
   "belgium": "Belgica",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:56:18
   "netherlands": "Paises Baixos",
   "ireland": "Irlanda",
   "belgium": "Belgica",
-  "switzerland": "Suica",
+  "switzerland": "",
   "austria": "Austria",
   "russia": "Russia",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:57:14
   "ireland": "Irlanda",
   "belgium": "Belgica",
   "switzerland": "Suica",
-  "austria": "Austria",
+  "austria": "",
   "russia": "Russia",
   "ukraine": "Ucrania",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:58:13
   "belgium": "Belgica",
   "switzerland": "Suica",
   "austria": "Austria",
-  "russia": "Russia",
+  "russia": "",
   "ukraine": "Ucrania",
   "poland": "Polonia",

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:60:13
   "austria": "Austria",
   "russia": "Russia",
   "ukraine": "Ucrania",
-  "poland": "Polonia",
+  "poland": "",
   "turkey": "Turquia",
   "iran": "Ira",

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:65:55
   "iran": "Ira",
 };
 
-function normalizeText(value?: string | null): string {
-  if (!value) return "";
-  return value
-    .normalize("NFD")
-    .replace(/[\u0300-\u036f]/g, "")
-    .toLowerCase()
-    .trim();
-}
+function normalizeText(value?: string | null): string {}
 
 function getListLabel(value: string[]): string {
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected [ 'United States' ] to deeply equal [ 'Estados Unidos' ]

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:66:7
 };
 
 function normalizeText(value?: string | null): string {
-  if (!value) return "";
+  if (true) return "";
   return value
     .normalize("NFD")
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected [ 'United States' ] to deeply equal [ 'Estados Unidos' ]

[Killed] BooleanLiteral
features/games/logic/dailyGameLogic.ts:66:7
 };
 
 function normalizeText(value?: string | null): string {
-  if (!value) return "";
+  if (value) return "";
   return value
     .normalize("NFD")
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected [ 'United States' ] to deeply equal [ 'Estados Unidos' ]

[Survived] BlockStatement
features/games/logic/dailyGameLogic.ts:74:48
     .trim();
 }
 
-function getListLabel(value: string[]): string {
-  return value.length > 0 ? value.join(", ") : "Nao informado";
-}
+function getListLabel(value: string[]): string {}
 
 export function toPtBrCountry(name: string): string {

[Survived] EqualityOperator
features/games/logic/dailyGameLogic.ts:75:10
 }
 
 function getListLabel(value: string[]): string {
-  return value.length > 0 ? value.join(", ") : "Nao informado";
+  return value.length >= 0 ? value.join(", ") : "Nao informado";
 }
 

[Survived] ConditionalExpression
features/games/logic/dailyGameLogic.ts:75:10
 }
 
 function getListLabel(value: string[]): string {
-  return value.length > 0 ? value.join(", ") : "Nao informado";
+  return true ? value.join(", ") : "Nao informado";
 }
 

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:78:53
   return value.length > 0 ? value.join(", ") : "Nao informado";
 }
 
-export function toPtBrCountry(name: string): string {
-  const key = normalizeText(name);
-  return COUNTRY_PTBR_MAP[key] || name;
-}
+export function toPtBrCountry(name: string): string {}
 
 export function normalizeCountriesToPtBr(countries: string[]): string[] {
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected [ undefined ] to deeply equal [ 'Estados Unidos' ]

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:80:10
 
 export function toPtBrCountry(name: string): string {
   const key = normalizeText(name);
-  return COUNTRY_PTBR_MAP[key] || name;
+  return true;
 }
 
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected [ true ] to deeply equal [ 'Estados Unidos' ]

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:80:10
 
 export function toPtBrCountry(name: string): string {
   const key = normalizeText(name);
-  return COUNTRY_PTBR_MAP[key] || name;
+  return false;
 }
 
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected [ false ] to deeply equal [ 'Estados Unidos' ]

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:83:73
   return COUNTRY_PTBR_MAP[key] || name;
 }
 
-export function normalizeCountriesToPtBr(countries: string[]): string[] {
-  return countries.map(toPtBrCountry);
-}
+export function normalizeCountriesToPtBr(countries: string[]): string[] {}
 
 export function getYearDirectionHint(guessYear?: number, targetYear?: number): string {
killedBy: dailyMovieGameLogic toMovieProfileFromApp converte e aplica defaults
statusReason: expected undefined to deeply equal [ 'Estados Unidos' ]

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:87:87
   return countries.map(toPtBrCountry);
 }
 
-export function getYearDirectionHint(guessYear?: number, targetYear?: number): string {
-  if (!guessYear || !targetYear || guessYear === targetYear) {
-    return "";
-  }
-
-  return guessYear < targetYear ? " ↑ mais atual" : " ↓ mais antigo";
-}
+export function getYearDirectionHint(guessYear?: number, targetYear?: number): string {}
 
 export function compareMovieProfiles(guess: GameMovieProfile, target: GameMovieProfile): GuessResult {
killedBy: dailyGameLogic ano mostra direcao correta
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:88:7
 }
 
 export function getYearDirectionHint(guessYear?: number, targetYear?: number): string {
-  if (!guessYear || !targetYear || guessYear === targetYear) {
+  if (true) {
     return "";
   }
killedBy: dailyGameLogic ano mostra direcao correta
statusReason: expected '' to contain 'mais atual'

[Killed] BooleanLiteral
features/games/logic/dailyGameLogic.ts:88:7
 }
 
 export function getYearDirectionHint(guessYear?: number, targetYear?: number): string {
-  if (!guessYear || !targetYear || guessYear === targetYear) {
+  if (guessYear || !targetYear || guessYear === targetYear) {
     return "";
   }
killedBy: dailyGameLogic ano mostra direcao correta
statusReason: expected '' to contain 'mais atual'

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:92:10
     return "";
   }
 
-  return guessYear < targetYear ? " ↑ mais atual" : " ↓ mais antigo";
+  return true ? " ↑ mais atual" : " ↓ mais antigo";
 }
 
killedBy: dailyGameLogic ano mostra direcao correta
statusReason: expected ' ↑ mais atual' to contain 'mais antigo'

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:92:10
     return "";
   }
 
-  return guessYear < targetYear ? " ↑ mais atual" : " ↓ mais antigo";
+  return false ? " ↑ mais atual" : " ↓ mais antigo";
 }
 
killedBy: dailyGameLogic ano mostra direcao correta
statusReason: expected ' ↓ mais antigo' to contain 'mais atual'

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:100:7
   const normTargetDirector = normalizeText(target.director);
 
   let directorStatus: GuessStatus = "wrong";
-  if (normGuessDirector && normTargetDirector) {
+  if (false) {
     if (normGuessDirector === normTargetDirector) {
       directorStatus = "correct";
killedBy: dailyGameLogic diretor fica close quando nome e substring
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:100:48
   const normTargetDirector = normalizeText(target.director);
 
   let directorStatus: GuessStatus = "wrong";
-  if (normGuessDirector && normTargetDirector) {
-    if (normGuessDirector === normTargetDirector) {
-      directorStatus = "correct";
-    } else if (normGuessDirector.includes(normTargetDirector) || normTargetDirector.includes(normGuessDirector)) {
-      directorStatus = "close";
-    }
-  }
+  if (normGuessDirector && normTargetDirector) {}
 
   let yearStatus: GuessStatus = "wrong";
killedBy: dailyGameLogic diretor fica close quando nome e substring
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] EqualityOperator
features/games/logic/dailyGameLogic.ts:101:9
 
   let directorStatus: GuessStatus = "wrong";
   if (normGuessDirector && normTargetDirector) {
-    if (normGuessDirector === normTargetDirector) {
+    if (normGuessDirector !== normTargetDirector) {
       directorStatus = "correct";
     } else if (normGuessDirector.includes(normTargetDirector) || normTargetDirector.includes(normGuessDirector)) {
killedBy: dailyGameLogic diretor fica close quando nome e substring
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:101:9
 
   let directorStatus: GuessStatus = "wrong";
   if (normGuessDirector && normTargetDirector) {
-    if (normGuessDirector === normTargetDirector) {
+    if (true) {
       directorStatus = "correct";
     } else if (normGuessDirector.includes(normTargetDirector) || normTargetDirector.includes(normGuessDirector)) {
killedBy: dailyGameLogic diretor fica close quando nome e substring
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:103:114
   if (normGuessDirector && normTargetDirector) {
     if (normGuessDirector === normTargetDirector) {
       directorStatus = "correct";
-    } else if (normGuessDirector.includes(normTargetDirector) || normTargetDirector.includes(normGuessDirector)) {
-      directorStatus = "close";
-    }
+    } else if (normGuessDirector.includes(normTargetDirector) || normTargetDirector.includes(normGuessDirector)) {}
   }
 
killedBy: dailyGameLogic diretor fica close quando nome e substring
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:103:16
   if (normGuessDirector && normTargetDirector) {
     if (normGuessDirector === normTargetDirector) {
       directorStatus = "correct";
-    } else if (normGuessDirector.includes(normTargetDirector) || normTargetDirector.includes(normGuessDirector)) {
+    } else if (false) {
       directorStatus = "close";
     }
killedBy: dailyGameLogic diretor fica close quando nome e substring
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:109:7
   }
 
   let yearStatus: GuessStatus = "wrong";
-  if (guess.releaseYear && target.releaseYear) {
+  if (false) {
     const diff = Math.abs(guess.releaseYear - target.releaseYear);
     yearStatus = diff === 0 ? "correct" : diff <= 5 ? "close" : "wrong";
killedBy: dailyGameLogic ano fica perto no intervalo de ±5
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:109:48
   }
 
   let yearStatus: GuessStatus = "wrong";
-  if (guess.releaseYear && target.releaseYear) {
-    const diff = Math.abs(guess.releaseYear - target.releaseYear);
-    yearStatus = diff === 0 ? "correct" : diff <= 5 ? "close" : "wrong";
-  }
+  if (guess.releaseYear && target.releaseYear) {}
 
   const guessGenres = guess.genres.map(normalizeText);
killedBy: dailyGameLogic ano fica perto no intervalo de ±5
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ArithmeticOperator
features/games/logic/dailyGameLogic.ts:110:27
 
   let yearStatus: GuessStatus = "wrong";
   if (guess.releaseYear && target.releaseYear) {
-    const diff = Math.abs(guess.releaseYear - target.releaseYear);
+    const diff = Math.abs(guess.releaseYear + target.releaseYear);
     yearStatus = diff === 0 ? "correct" : diff <= 5 ? "close" : "wrong";
   }
killedBy: dailyGameLogic ano fica perto no intervalo de ±5
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] EqualityOperator
features/games/logic/dailyGameLogic.ts:111:18
   let yearStatus: GuessStatus = "wrong";
   if (guess.releaseYear && target.releaseYear) {
     const diff = Math.abs(guess.releaseYear - target.releaseYear);
-    yearStatus = diff === 0 ? "correct" : diff <= 5 ? "close" : "wrong";
+    yearStatus = diff !== 0 ? "correct" : diff <= 5 ? "close" : "wrong";
   }
 
killedBy: dailyGameLogic ano fica perto no intervalo de ±5
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:111:18
   let yearStatus: GuessStatus = "wrong";
   if (guess.releaseYear && target.releaseYear) {
     const diff = Math.abs(guess.releaseYear - target.releaseYear);
-    yearStatus = diff === 0 ? "correct" : diff <= 5 ? "close" : "wrong";
+    yearStatus = true ? "correct" : diff <= 5 ? "close" : "wrong";
   }
 
killedBy: dailyGameLogic ano fica perto no intervalo de ±5
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] MethodExpression
features/games/logic/dailyGameLogic.ts:116:36
 
   const guessGenres = guess.genres.map(normalizeText);
   const targetGenres = target.genres.map(normalizeText);
-  const genreStatus: GuessStatus = guessGenres.some((genre) => targetGenres.includes(genre))
+  const genreStatus: GuessStatus = guessGenres.every(genre => targetGenres.includes(genre))
     ? "correct"
     : guessGenres.some((genre) => targetGenres.some((targetGenre) => targetGenre.includes(genre) || genre.includes(targetGenre)))
killedBy: dailyGameLogic fallback de pais e campos sem dados ficam como wrong/nao informado
statusReason: expected 'correct' to be 'wrong' // Object.is equality

[Survived] ArrowFunction
features/games/logic/dailyGameLogic.ts:116:53
 
   const guessGenres = guess.genres.map(normalizeText);
   const targetGenres = target.genres.map(normalizeText);
-  const genreStatus: GuessStatus = guessGenres.some((genre) => targetGenres.includes(genre))
+  const genreStatus: GuessStatus = guessGenres.some(() => undefined)
     ? "correct"
     : guessGenres.some((genre) => targetGenres.some((targetGenre) => targetGenre.includes(genre) || genre.includes(targetGenre)))

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:117:7
   const guessGenres = guess.genres.map(normalizeText);
   const targetGenres = target.genres.map(normalizeText);
   const genreStatus: GuessStatus = guessGenres.some((genre) => targetGenres.includes(genre))
-    ? "correct"
+    ? ""
     : guessGenres.some((genre) => targetGenres.some((targetGenre) => targetGenre.includes(genre) || genre.includes(targetGenre)))
       ? "close"

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:118:70
   const targetGenres = target.genres.map(normalizeText);
   const genreStatus: GuessStatus = guessGenres.some((genre) => targetGenres.includes(genre))
     ? "correct"
-    : guessGenres.some((genre) => targetGenres.some((targetGenre) => targetGenre.includes(genre) || genre.includes(targetGenre)))
+    : guessGenres.some((genre) => targetGenres.some((targetGenre) => false))
       ? "close"
       : "wrong";
killedBy: dailyGameLogic genero fica close quando ha correspondencia parcial
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ArrowFunction
features/games/logic/dailyGameLogic.ts:118:24
   const targetGenres = target.genres.map(normalizeText);
   const genreStatus: GuessStatus = guessGenres.some((genre) => targetGenres.includes(genre))
     ? "correct"
-    : guessGenres.some((genre) => targetGenres.some((targetGenre) => targetGenre.includes(genre) || genre.includes(targetGenre)))
+    : guessGenres.some(() => undefined)
       ? "close"
       : "wrong";
killedBy: dailyGameLogic genero fica close quando ha correspondencia parcial
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] StringLiteral
features/games/logic/dailyGameLogic.ts:119:9
   const genreStatus: GuessStatus = guessGenres.some((genre) => targetGenres.includes(genre))
     ? "correct"
     : guessGenres.some((genre) => targetGenres.some((targetGenre) => targetGenre.includes(genre) || genre.includes(targetGenre)))
-      ? "close"
+      ? ""
       : "wrong";
 
killedBy: dailyGameLogic genero fica close quando ha correspondencia parcial
statusReason: expected '' to be 'close' // Object.is equality

[Killed] ArrowFunction
features/games/logic/dailyGameLogic.ts:124:47
 
   const guessCountries = guess.countries.map(normalizeText);
   const targetCountries = target.countries.map(normalizeText);
-  const matchesCount = targetCountries.filter((country) => guessCountries.includes(country)).length;
+  const matchesCount = targetCountries.filter(() => undefined).length;
   const countryStatus: GuessStatus =
     targetCountries.length > 0 && matchesCount === targetCountries.length
killedBy: dailyGameLogic paises ficam corretos quando todos batem
statusReason: expected 'wrong' to be 'correct' // Object.is equality

[Killed] MethodExpression
features/games/logic/dailyGameLogic.ts:124:24
 
   const guessCountries = guess.countries.map(normalizeText);
   const targetCountries = target.countries.map(normalizeText);
-  const matchesCount = targetCountries.filter((country) => guessCountries.includes(country)).length;
+  const matchesCount = targetCountries.length;
   const countryStatus: GuessStatus =
     targetCountries.length > 0 && matchesCount === targetCountries.length
killedBy: dailyGameLogic paises ficam perto quando existe intersecao parcial
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:126:5
   const targetCountries = target.countries.map(normalizeText);
   const matchesCount = targetCountries.filter((country) => guessCountries.includes(country)).length;
   const countryStatus: GuessStatus =
-    targetCountries.length > 0 && matchesCount === targetCountries.length
+    true
       ? "correct"
       : matchesCount > 0
killedBy: dailyGameLogic paises ficam perto quando existe intersecao parcial
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:126:5
   const targetCountries = target.countries.map(normalizeText);
   const matchesCount = targetCountries.filter((country) => guessCountries.includes(country)).length;
   const countryStatus: GuessStatus =
-    targetCountries.length > 0 && matchesCount === targetCountries.length
+    false
       ? "correct"
       : matchesCount > 0
killedBy: dailyGameLogic paises ficam corretos quando todos batem
statusReason: expected 'close' to be 'correct' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:128:9
   const countryStatus: GuessStatus =
     targetCountries.length > 0 && matchesCount === targetCountries.length
       ? "correct"
-      : matchesCount > 0
+      : false
         ? "close"
         : "wrong";
killedBy: dailyGameLogic paises ficam perto quando existe intersecao parcial
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] EqualityOperator
features/games/logic/dailyGameLogic.ts:128:9
   const countryStatus: GuessStatus =
     targetCountries.length > 0 && matchesCount === targetCountries.length
       ? "correct"
-      : matchesCount > 0
+      : matchesCount <= 0
         ? "close"
         : "wrong";
killedBy: dailyGameLogic paises ficam perto quando existe intersecao parcial
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ArrowFunction
features/games/logic/dailyGameLogic.ts:134:41
 
   const guessCast = guess.cast.map(normalizeText);
   const targetCast = target.cast.map(normalizeText);
-  const castMatches = targetCast.filter((actor) => guessCast.includes(actor)).length;
+  const castMatches = targetCast.filter(() => undefined).length;
   const castStatus: GuessStatus =
     targetCast.length > 0 && castMatches === targetCast.length
killedBy: dailyGameLogic atores ficam corretos apenas quando os 5 batem
statusReason: expected 'wrong' to be 'correct' // Object.is equality

[Killed] MethodExpression
features/games/logic/dailyGameLogic.ts:134:23
 
   const guessCast = guess.cast.map(normalizeText);
   const targetCast = target.cast.map(normalizeText);
-  const castMatches = targetCast.filter((actor) => guessCast.includes(actor)).length;
+  const castMatches = targetCast.length;
   const castStatus: GuessStatus =
     targetCast.length > 0 && castMatches === targetCast.length
killedBy: dailyGameLogic atores ficam corretos apenas quando os 5 batem
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:136:30
   const targetCast = target.cast.map(normalizeText);
   const castMatches = targetCast.filter((actor) => guessCast.includes(actor)).length;
   const castStatus: GuessStatus =
-    targetCast.length > 0 && castMatches === targetCast.length
+    targetCast.length > 0 && true
       ? "correct"
       : castMatches > 0
killedBy: dailyGameLogic atores ficam corretos apenas quando os 5 batem
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] EqualityOperator
features/games/logic/dailyGameLogic.ts:136:5
   const targetCast = target.cast.map(normalizeText);
   const castMatches = targetCast.filter((actor) => guessCast.includes(actor)).length;
   const castStatus: GuessStatus =
-    targetCast.length > 0 && castMatches === targetCast.length
+    targetCast.length <= 0 && castMatches === targetCast.length
       ? "correct"
       : castMatches > 0
killedBy: dailyGameLogic atores ficam corretos apenas quando os 5 batem
statusReason: expected 'close' to be 'correct' // Object.is equality

[Killed] EqualityOperator
features/games/logic/dailyGameLogic.ts:138:9
   const castStatus: GuessStatus =
     targetCast.length > 0 && castMatches === targetCast.length
       ? "correct"
-      : castMatches > 0
+      : castMatches <= 0
         ? "close"
         : "wrong";
killedBy: dailyGameLogic atores ficam corretos apenas quando os 5 batem
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:138:9
   const castStatus: GuessStatus =
     targetCast.length > 0 && castMatches === targetCast.length
       ? "correct"
-      : castMatches > 0
+      : false
         ? "close"
         : "wrong";
killedBy: dailyGameLogic atores ficam corretos apenas quando os 5 batem
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] StringLiteral
features/games/logic/dailyGameLogic.ts:142:36
         ? "close"
         : "wrong";
 
-  let runtimeStatus: GuessStatus = "wrong";
+  let runtimeStatus: GuessStatus = "";
   if (guess.runtime && target.runtime) {
     const diff = Math.abs(guess.runtime - target.runtime);
killedBy: dailyGameLogic fallback de pais e campos sem dados ficam como wrong/nao informado
statusReason: expected '' to be 'wrong' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:143:7
         : "wrong";
 
   let runtimeStatus: GuessStatus = "wrong";
-  if (guess.runtime && target.runtime) {
+  if (false) {
     const diff = Math.abs(guess.runtime - target.runtime);
     runtimeStatus = diff <= 7 ? "correct" : diff <= 20 ? "close" : "wrong";
killedBy: dailyGameLogic runtime fica close para diferenca moderada
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] BlockStatement
features/games/logic/dailyGameLogic.ts:143:40
         : "wrong";
 
   let runtimeStatus: GuessStatus = "wrong";
-  if (guess.runtime && target.runtime) {
-    const diff = Math.abs(guess.runtime - target.runtime);
-    runtimeStatus = diff <= 7 ? "correct" : diff <= 20 ? "close" : "wrong";
-  }
+  if (guess.runtime && target.runtime) {}
 
   const yearDirectionHint = getYearDirectionHint(guess.releaseYear, target.releaseYear);
killedBy: dailyGameLogic runtime fica close para diferenca moderada
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ArithmeticOperator
features/games/logic/dailyGameLogic.ts:144:27
 
   let runtimeStatus: GuessStatus = "wrong";
   if (guess.runtime && target.runtime) {
-    const diff = Math.abs(guess.runtime - target.runtime);
+    const diff = Math.abs(guess.runtime + target.runtime);
     runtimeStatus = diff <= 7 ? "correct" : diff <= 20 ? "close" : "wrong";
   }
killedBy: dailyGameLogic runtime fica close para diferenca moderada
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:145:45
   let runtimeStatus: GuessStatus = "wrong";
   if (guess.runtime && target.runtime) {
     const diff = Math.abs(guess.runtime - target.runtime);
-    runtimeStatus = diff <= 7 ? "correct" : diff <= 20 ? "close" : "wrong";
+    runtimeStatus = diff <= 7 ? "correct" : false ? "close" : "wrong";
   }
 
killedBy: dailyGameLogic runtime fica close para diferenca moderada
statusReason: expected 'wrong' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:145:21
   let runtimeStatus: GuessStatus = "wrong";
   if (guess.runtime && target.runtime) {
     const diff = Math.abs(guess.runtime - target.runtime);
-    runtimeStatus = diff <= 7 ? "correct" : diff <= 20 ? "close" : "wrong";
+    runtimeStatus = true ? "correct" : diff <= 20 ? "close" : "wrong";
   }
 
killedBy: dailyGameLogic runtime fica close para diferenca moderada
statusReason: expected 'correct' to be 'close' // Object.is equality

[Killed] ConditionalExpression
features/games/logic/dailyGameLogic.ts:153:16
   const fields: GuessFieldResult[] = [
     {
       label: "Diretor",
-      guessed: guess.director || "Nao informado",
+      guessed: true,
       target: target.director || "Nao informado",
       status: directorStatus,
killedBy: dailyGameLogic fallback de pais e campos sem dados ficam como wrong/nao informado
statusReason: expected true to be 'Nao informado' // Object.is equality

[Killed] LogicalOperator
features/games/logic/dailyGameLogic.ts:153:16
   const fields: GuessFieldResult[] = [
     {
       label: "Diretor",
-      guessed: guess.director || "Nao informado",
+      guessed: guess.director && "Nao informado",
       target: target.director || "Nao informado",
       status: directorStatus,
killedBy: dailyGameLogic fallback de pais e campos sem dados ficam como wrong/nao informado
statusReason: expected undefined to be 'Nao informado' // Object.is equality

[Survived] ConditionalExpression
features/games/logic/dailyGameLogic.ts:154:15
     {
       label: "Diretor",
       guessed: guess.director || "Nao informado",
-      target: target.director || "Nao informado",
+      target: true,
       status: directorStatus,
     },

[Survived] LogicalOperator
features/games/logic/dailyGameLogic.ts:154:15
     {
       label: "Diretor",
       guessed: guess.director || "Nao informado",
-      target: target.director || "Nao informado",
+      target: target.director && "Nao informado",
       status: directorStatus,
     },

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:159:16
     },
     {
       label: "Ano",
-      guessed: `${guess.releaseYear ? String(guess.releaseYear) : "Nao informado"}${yearDirectionHint}`,
+      guessed: ``,
       target: target.releaseYear ? String(target.releaseYear) : "Nao informado",
       status: yearStatus,

[Survived] StringLiteral
features/games/logic/dailyGameLogic.ts:160:65
     {
       label: "Ano",
       guessed: `${guess.releaseYear ? String(guess.releaseYear) : "Nao informado"}${yearDirectionHint}`,
-      target: target.releaseYear ? String(target.releaseYear) : "Nao informado",
+      target: target.releaseYear ? String(target.releaseYear) : "",
       status: yearStatus,
     },

[Killed] ObjectLiteral
features/games/logic/dailyGameLogic.ts:181:5
       target: getListLabel(target.cast),
       status: castStatus,
     },
-    {
-      label: "Duracao",
-      guessed: guess.runtime ? `${guess.runtime} min` : "Nao informada",
-      target: target.runtime ? `${target.runtime} min` : "Nao informada",
-      status: runtimeStatus,
-    },
+    {},
   ];
 
killedBy: dailyGameLogic fallback de pais e campos sem dados ficam como wrong/nao informado
statusReason: expected undefined to be 'wrong' // Object.is equality
