[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:46:94
   winnerTmdbId: number;
 }
 
-export async function startGameSession(input: StartGameSessionInput): Promise<string | null> {
-  const { data, error } = await supabase
-    .from("game_sessions")
-    .insert({
-      user_id: input.userId,
-      game_type: input.gameType,
-      source_mode: input.sourceMode,
-      status: "in_progress",
-      date_key: input.dateKey,
-      target_tmdb_id: input.targetTmdbId,
-      max_lives: input.maxLives,
-      lives_left: input.livesLeft,
-      metadata: input.metadata || {},
-    })
-    .select("id")
-    .single();
-
-  if (error) {
-    console.error("Erro ao iniciar sessão de jogo:", error);
-    return null;
-  }
-
-  return data?.id || null;
-}
+export async function startGameSession(input: StartGameSessionInput): Promise<string | null> {}
 
 export async function updateGameSessionProgress(
killedBy: gamePersistenceService starts a game session and returns its id
statusReason: expected undefined to be 'session-1' // Object.is equality

[Killed] StringLiteral
features/games/services/gamePersistenceService.ts:48:11
 
 export async function startGameSession(input: StartGameSessionInput): Promise<string | null> {
   const { data, error } = await supabase
-    .from("game_sessions")
+    .from("")
     .insert({
       user_id: input.userId,
killedBy: gamePersistenceService starts a game session and returns its id
statusReason: expected "vi.fn()" to be called with arguments: [ 'game_sessions' ]

Received:

  1st vi.fn() call:

  [
-   "game_sessions",

[Killed] ObjectLiteral
features/games/services/gamePersistenceService.ts:49:13
 export async function startGameSession(input: StartGameSessionInput): Promise<string | null> {
   const { data, error } = await supabase
     .from("game_sessions")
-    .insert({
-      user_id: input.userId,
-      game_type: input.gameType,
-      source_mode: input.sourceMode,
-      status: "in_progress",
-      date_key: input.dateKey,
-      target_tmdb_id: input.targetTmdbId,
-      max_lives: input.maxLives,
-      lives_left: input.livesLeft,
-      metadata: input.metadata || {},
-    })
+    .insert({})
     .select("id")
     .single();
killedBy: gamePersistenceService starts a game session and returns its id
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
features/games/services/gamePersistenceService.ts:53:15
       user_id: input.userId,
       game_type: input.gameType,
       source_mode: input.sourceMode,
-      status: "in_progress",
+      status: "",
       date_key: input.dateKey,
       target_tmdb_id: input.targetTmdbId,
killedBy: gamePersistenceService starts a game session and returns its id
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] LogicalOperator
features/games/services/gamePersistenceService.ts:58:17
       target_tmdb_id: input.targetTmdbId,
       max_lives: input.maxLives,
       lives_left: input.livesLeft,
-      metadata: input.metadata || {},
+      metadata: input.metadata && {},
     })
     .select("id")

[Survived] ConditionalExpression
features/games/services/gamePersistenceService.ts:58:17
       target_tmdb_id: input.targetTmdbId,
       max_lives: input.maxLives,
       lives_left: input.livesLeft,
-      metadata: input.metadata || {},
+      metadata: true,
     })
     .select("id")

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:63:14
     .select("id")
     .single();
 
-  if (error) {
-    console.error("Erro ao iniciar sessão de jogo:", error);
-    return null;
-  }
+  if (error) {}
 
   return data?.id || null;
killedBy: gamePersistenceService returns null when starting session fails
statusReason: expected "error" to be called at least once

[Survived] StringLiteral
features/games/services/gamePersistenceService.ts:64:19
     .single();
 
   if (error) {
-    console.error("Erro ao iniciar sessão de jogo:", error);
+    console.error("", error);
     return null;
   }

[Killed] ConditionalExpression
features/games/services/gamePersistenceService.ts:68:10
     return null;
   }
 
-  return data?.id || null;
+  return true;
 }
 
killedBy: gamePersistenceService starts a game session and returns its id
statusReason: expected true to be 'session-1' // Object.is equality

[Killed] LogicalOperator
features/games/services/gamePersistenceService.ts:68:10
     return null;
   }
 
-  return data?.id || null;
+  return data?.id && null;
 }
 
killedBy: gamePersistenceService starts a game session and returns its id
statusReason: expected null to be 'session-1' // Object.is equality

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:75:18
   sessionId: string,
   livesLeft: number,
   attemptsCount: number
-): Promise<void> {
-  const { error } = await supabase
-    .from("game_sessions")
-    .update({ lives_left: livesLeft, attempts_count: attemptsCount })
-    .eq("id", sessionId);
-
-  if (error) {
-    console.error("Erro ao atualizar progresso da sessão:", error);
-  }
-}
+): Promise<void> {}
 
 export async function finishGameSession(input: FinishGameSessionInput): Promise<void> {
killedBy: gamePersistenceService updates game session progress
statusReason: expected "vi.fn()" to be called with arguments: [ 'game_sessions' ]

Number of calls: 0

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:81:14
     .update({ lives_left: livesLeft, attempts_count: attemptsCount })
     .eq("id", sessionId);
 
-  if (error) {
-    console.error("Erro ao atualizar progresso da sessão:", error);
-  }
+  if (error) {}
 }
 
killedBy: gamePersistenceService logs error when updating progress fails
statusReason: expected "error" to be called at least once

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:86:87
   }
 }
 
-export async function finishGameSession(input: FinishGameSessionInput): Promise<void> {
-  const { error } = await supabase
-    .from("game_sessions")
-    .update({
-      status: input.status,
-      lives_left: input.livesLeft,
-      attempts_count: input.attemptsCount,
-      metadata: input.metadata,
-      ended_at: new Date().toISOString(),
-    })
-    .eq("id", input.sessionId);
-
-  if (error) {
-    console.error("Erro ao finalizar sessão de jogo:", error);
-  }
-}
+export async function finishGameSession(input: FinishGameSessionInput): Promise<void> {}
 
 export async function persistDailyAttempt(input: PersistDailyAttemptInput): Promise<void> {
killedBy: gamePersistenceService finishes game session
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Survived] StringLiteral
features/games/services/gamePersistenceService.ts:88:11
 
 export async function finishGameSession(input: FinishGameSessionInput): Promise<void> {
   const { error } = await supabase
-    .from("game_sessions")
+    .from("")
     .update({
       status: input.status,

[Killed] ObjectLiteral
features/games/services/gamePersistenceService.ts:89:13
 export async function finishGameSession(input: FinishGameSessionInput): Promise<void> {
   const { error } = await supabase
     .from("game_sessions")
-    .update({
-      status: input.status,
-      lives_left: input.livesLeft,
-      attempts_count: input.attemptsCount,
-      metadata: input.metadata,
-      ended_at: new Date().toISOString(),
-    })
+    .update({})
     .eq("id", input.sessionId);
 
killedBy: gamePersistenceService finishes game session
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:103:91
   }
 }
 
-export async function persistDailyAttempt(input: PersistDailyAttemptInput): Promise<void> {
-  const { error } = await supabase.from("game_daily_attempts").insert({
-    session_id: input.sessionId,
-    user_id: input.userId,
-    attempt_index: input.attemptIndex,
-    guessed_tmdb_id: input.guessedTmdbId,
-    guess_title: input.guessTitle,
-    is_correct: input.isCorrect,
-    lives_after: input.livesAfter,
-    fields: input.fields,
-  });
-
-  if (error) {
-    console.error("Erro ao persistir tentativa diária:", error);
-  }
-}
+export async function persistDailyAttempt(input: PersistDailyAttemptInput): Promise<void> {}
 
 export async function persistBattleMatch(input: PersistBattleMatchInput): Promise<void> {
killedBy: gamePersistenceService persists daily attempt
statusReason: expected "vi.fn()" to be called with arguments: [ 'game_daily_attempts' ]

Number of calls: 0

[Killed] ObjectLiteral
features/games/services/gamePersistenceService.ts:104:71
 }
 
 export async function persistDailyAttempt(input: PersistDailyAttemptInput): Promise<void> {
-  const { error } = await supabase.from("game_daily_attempts").insert({
-    session_id: input.sessionId,
-    user_id: input.userId,
-    attempt_index: input.attemptIndex,
-    guessed_tmdb_id: input.guessedTmdbId,
-    guess_title: input.guessTitle,
-    is_correct: input.isCorrect,
-    lives_after: input.livesAfter,
-    fields: input.fields,
-  });
+  const { error } = await supabase.from("game_daily_attempts").insert({});
 
   if (error) {
killedBy: gamePersistenceService persists daily attempt
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:115:14
     fields: input.fields,
   });
 
-  if (error) {
-    console.error("Erro ao persistir tentativa diária:", error);
-  }
+  if (error) {}
 }
 
killedBy: gamePersistenceService logs error when persisting daily attempt fails
statusReason: expected "error" to be called at least once

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:120:89
   }
 }
 
-export async function persistBattleMatch(input: PersistBattleMatchInput): Promise<void> {
-  const { error } = await supabase.from("game_battle_matches").insert({
-    session_id: input.sessionId,
-    user_id: input.userId,
-    round_size: input.roundSize,
-    match_index: input.matchIndex,
-    movie_a_tmdb_id: input.movieATmdbId,
-    movie_b_tmdb_id: input.movieBTmdbId,
-    winner_tmdb_id: input.winnerTmdbId,
-  });
-
-  if (error) {
-    console.error("Erro ao persistir duelo da batalha:", error);
-  }
-}
+export async function persistBattleMatch(input: PersistBattleMatchInput): Promise<void> {}
 
killedBy: gamePersistenceService persists battle match
statusReason: expected "vi.fn()" to be called with arguments: [ 'game_battle_matches' ]

Number of calls: 0

[Killed] BlockStatement
features/games/services/gamePersistenceService.ts:131:14
     winner_tmdb_id: input.winnerTmdbId,
   });
 
-  if (error) {
-    console.error("Erro ao persistir duelo da batalha:", error);
-  }
+  if (error) {}
 }
 
killedBy: gamePersistenceService logs error when persisting battle match fails
statusReason: expected "error" to be called at least once

[Survived] StringLiteral
features/games/services/gamePersistenceService.ts:132:19
   });
 
   if (error) {
-    console.error("Erro ao persistir duelo da batalha:", error);
+    console.error("", error);
   }
 }
