[Survived] BooleanLiteral
features/import/hooks/useImportPipeline.ts:10:24
 const DEFAULT_IMPORT_SETTINGS: ImportSettings = {
   ratingScale: RatingScale.SCALE_1_TO_1,
   listTypeMap: {},
-  skipUnmatchedMovies: false,
+  skipUnmatchedMovies: true,
 };
 

[Killed] BooleanLiteral
features/import/hooks/useImportPipeline.ts:21:19
 
 export function useImportPipeline(initialSettings?: Partial<ImportSettings>) {
   const [state, setState] = useState<UseImportPipelineState>({
-    isProcessing: false,
+    isProcessing: true,
     result: null,
     error: null,
killedBy: useImportPipeline should expose default initial state
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
features/import/hooks/useImportPipeline.ts:27:5
   });
 
   const settings: ImportSettings = useMemo(
-    () => ({
-      ...DEFAULT_IMPORT_SETTINGS,
-      ...initialSettings,
-      listTypeMap: {
-        ...DEFAULT_IMPORT_SETTINGS.listTypeMap,
-        ...(initialSettings?.listTypeMap || {}),
-      },
-    }),
+    () => undefined,
     [initialSettings]
   );
killedBy: useImportPipeline should expose default initial state
statusReason: Cannot read properties of undefined (reading 'ratingScale')

[Killed] ObjectLiteral
features/import/hooks/useImportPipeline.ts:27:12
   });
 
   const settings: ImportSettings = useMemo(
-    () => ({
-      ...DEFAULT_IMPORT_SETTINGS,
-      ...initialSettings,
-      listTypeMap: {
-        ...DEFAULT_IMPORT_SETTINGS.listTypeMap,
-        ...(initialSettings?.listTypeMap || {}),
-      },
-    }),
+    () => ({}),
     [initialSettings]
   );
killedBy: useImportPipeline should expose default initial state
statusReason: expected undefined to be '1:1' // Object.is equality

[Killed] ConditionalExpression
features/import/hooks/useImportPipeline.ts:32:13
       ...initialSettings,
       listTypeMap: {
         ...DEFAULT_IMPORT_SETTINGS.listTypeMap,
-        ...(initialSettings?.listTypeMap || {}),
+        ...(false),
       },
     }),
killedBy: useImportPipeline should merge initial and override settings
statusReason: expected "vi.fn()" to be called with arguments: [ File{ …(1) }, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,9 @@
  [

[Killed] LogicalOperator
features/import/hooks/useImportPipeline.ts:32:13
       ...initialSettings,
       listTypeMap: {
         ...DEFAULT_IMPORT_SETTINGS.listTypeMap,
-        ...(initialSettings?.listTypeMap || {}),
+        ...(initialSettings?.listTypeMap && {}),
       },
     }),
killedBy: useImportPipeline should merge initial and override settings
statusReason: expected "vi.fn()" to be called with arguments: [ File{ …(1) }, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,9 @@
  [

[Survived] ArrayDeclaration
features/import/hooks/useImportPipeline.ts:35:5
         ...(initialSettings?.listTypeMap || {}),
       },
     }),
-    [initialSettings]
+    []
   );
 

[Survived] BooleanLiteral
features/import/hooks/useImportPipeline.ts:40:52
 
   const runImport = useCallback(
     async (file: File, overrideSettings?: Partial<ImportSettings>) => {
-      setState((prev) => ({ ...prev, isProcessing: true, error: null }));
+      setState((prev) => ({ ...prev, isProcessing: false, error: null }));
 
       const mergedSettings: ImportSettings = {

[Survived] ArrowFunction
features/import/hooks/useImportPipeline.ts:40:16
 
   const runImport = useCallback(
     async (file: File, overrideSettings?: Partial<ImportSettings>) => {
-      setState((prev) => ({ ...prev, isProcessing: true, error: null }));
+      setState(() => undefined);
 
       const mergedSettings: ImportSettings = {

[Killed] ObjectLiteral
features/import/hooks/useImportPipeline.ts:45:22
       const mergedSettings: ImportSettings = {
         ...settings,
         ...overrideSettings,
-        listTypeMap: {
-          ...settings.listTypeMap,
-          ...(overrideSettings?.listTypeMap || {}),
-        },
+        listTypeMap: {},
       };
 
killedBy: useImportPipeline should merge initial and override settings
statusReason: expected "vi.fn()" to be called with arguments: [ File{ …(1) }, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    File {},

[Killed] OptionalChaining
features/import/hooks/useImportPipeline.ts:47:15
         ...overrideSettings,
         listTypeMap: {
           ...settings.listTypeMap,
-          ...(overrideSettings?.listTypeMap || {}),
+          ...(overrideSettings.listTypeMap || {}),
         },
       };
killedBy: useImportPipeline should process zip and store successful result
statusReason: Cannot read properties of undefined (reading 'listTypeMap')

[Killed] LogicalOperator
features/import/hooks/useImportPipeline.ts:47:15
         ...overrideSettings,
         listTypeMap: {
           ...settings.listTypeMap,
-          ...(overrideSettings?.listTypeMap || {}),
+          ...(overrideSettings?.listTypeMap && {}),
         },
       };
killedBy: useImportPipeline should merge initial and override settings
statusReason: expected "vi.fn()" to be called with arguments: [ File{ …(1) }, ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    File {},

[Killed] BlockStatement
features/import/hooks/useImportPipeline.ts:51:11
         },
       };
 
-      try {
-        const result = await processImportZip(file, mergedSettings);
-        setState({
-          isProcessing: false,
-          result,
-          error: null,
-        });
-
-        return result;
-      } catch (error) {
+      try {} catch (error) {
         const message = error instanceof Error ? error.message : "Falha ao processar arquivo de importacao.";
 
killedBy: useImportPipeline should process zip and store successful result
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] BooleanLiteral
features/import/hooks/useImportPipeline.ts:54:25
       try {
         const result = await processImportZip(file, mergedSettings);
         setState({
-          isProcessing: false,
+          isProcessing: true,
           result,
           error: null,

[Killed] BlockStatement
features/import/hooks/useImportPipeline.ts:60:23
         });
 
         return result;
-      } catch (error) {
-        const message = error instanceof Error ? error.message : "Falha ao processar arquivo de importacao.";
-
-        setState((prev) => ({
-          ...prev,
-          isProcessing: false,
-          error: message,
-        }));
-
-        throw error;
-      }
+      } catch (error) {}
     },
     [settings]
killedBy: useImportPipeline should expose error when processing fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
features/import/hooks/useImportPipeline.ts:63:18
       } catch (error) {
         const message = error instanceof Error ? error.message : "Falha ao processar arquivo de importacao.";
 
-        setState((prev) => ({
-          ...prev,
-          isProcessing: false,
-          error: message,
-        }));
+        setState(() => undefined);
 
         throw error;
killedBy: useImportPipeline should expose error when processing fails
statusReason: expected undefined to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
features/import/hooks/useImportPipeline.ts:65:25
 
         setState((prev) => ({
           ...prev,
-          isProcessing: false,
+          isProcessing: true,
           error: message,
         }));
killedBy: useImportPipeline should expose error when processing fails
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
features/import/hooks/useImportPipeline.ts:75:35
     [settings]
   );
 
-  const reset = useCallback(() => {
-    setState({
-      isProcessing: false,
-      result: null,
-      error: null,
-    });
-  }, []);
+  const reset = useCallback(() => {}, []);
 
   return {
killedBy: useImportPipeline should reset local state
statusReason: expected { detected: { files: [], …(2) }, …(3) } to be null
