[Survived] BlockStatement
features/import/services/importPipelineService.ts:33:158
   processedData: ProcessedImportData | null;
 }
 
-function fileTypeToSection(fileType: "profile" | "ratings" | "reviews" | "diary" | "watched" | "watchlist" | "list" | "unknown"): ValidationIssue["section"] {
-  if (fileType === "list") {
-    return "lists";
-  }
-
-  if (fileType === "unknown") {
-    return "lists";
-  }
-
-  return fileType;
-}
+function fileTypeToSection(fileType: "profile" | "ratings" | "reviews" | "diary" | "watched" | "watchlist" | "list" | "unknown"): ValidationIssue["section"] {}
 
 function mapDetectionIssues(detected: DetectedFileSet): ValidationIssue[] {

[Survived] ConditionalExpression
features/import/services/importPipelineService.ts:34:7
 }
 
 function fileTypeToSection(fileType: "profile" | "ratings" | "reviews" | "diary" | "watched" | "watchlist" | "list" | "unknown"): ValidationIssue["section"] {
-  if (fileType === "list") {
+  if (false) {
     return "lists";
   }

[Survived] BlockStatement
features/import/services/importPipelineService.ts:34:28
 }
 
 function fileTypeToSection(fileType: "profile" | "ratings" | "reviews" | "diary" | "watched" | "watchlist" | "list" | "unknown"): ValidationIssue["section"] {
-  if (fileType === "list") {
-    return "lists";
-  }
+  if (fileType === "list") {}
 
   if (fileType === "unknown") {

[Survived] StringLiteral
features/import/services/importPipelineService.ts:35:12
 
 function fileTypeToSection(fileType: "profile" | "ratings" | "reviews" | "diary" | "watched" | "watchlist" | "list" | "unknown"): ValidationIssue["section"] {
   if (fileType === "list") {
-    return "lists";
+    return "";
   }
 

[NoCoverage] EqualityOperator
features/import/services/importPipelineService.ts:38:7
     return "lists";
   }
 
-  if (fileType === "unknown") {
+  if (fileType !== "unknown") {
     return "lists";
   }

[NoCoverage] ConditionalExpression
features/import/services/importPipelineService.ts:38:7
     return "lists";
   }
 
-  if (fileType === "unknown") {
+  if (true) {
     return "lists";
   }

[NoCoverage] StringLiteral
features/import/services/importPipelineService.ts:39:12
   }
 
   if (fileType === "unknown") {
-    return "lists";
+    return "";
   }
 

[Killed] MethodExpression
features/import/services/importPipelineService.ts:46:46
 }
 
 function mapDetectionIssues(detected: DetectedFileSet): ValidationIssue[] {
-  const detectionIssues: ValidationIssue[] = detected.files
-    .filter((file) => !file.isValid && file.type !== "unknown")
+  const detectionIssues: ValidationIssue[] = detected.files
     .map((file) => ({
       severity: IssueSeverity.WARNING,
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:47:40
 
 function mapDetectionIssues(detected: DetectedFileSet): ValidationIssue[] {
   const detectionIssues: ValidationIssue[] = detected.files
-    .filter((file) => !file.isValid && file.type !== "unknown")
+    .filter((file) => !file.isValid && true)
     .map((file) => ({
       severity: IssueSeverity.WARNING,
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
features/import/services/importPipelineService.ts:47:40
 
 function mapDetectionIssues(detected: DetectedFileSet): ValidationIssue[] {
   const detectionIssues: ValidationIssue[] = detected.files
-    .filter((file) => !file.isValid && file.type !== "unknown")
+    .filter((file) => !file.isValid && file.type === "unknown")
     .map((file) => ({
       severity: IssueSeverity.WARNING,
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
features/import/services/importPipelineService.ts:48:10
 function mapDetectionIssues(detected: DetectedFileSet): ValidationIssue[] {
   const detectionIssues: ValidationIssue[] = detected.files
     .filter((file) => !file.isValid && file.type !== "unknown")
-    .map((file) => ({
-      severity: IssueSeverity.WARNING,
-      section: fileTypeToSection(file.type),
-      fileName: file.name,
-      message: file.validationIssue || "Invalid file detected in ZIP",
-    }));
+    .map(() => undefined);
 
   const recognizedFiles =
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: Cannot read properties of undefined (reading 'severity')

[Survived] LogicalOperator
features/import/services/importPipelineService.ts:52:16
       severity: IssueSeverity.WARNING,
       section: fileTypeToSection(file.type),
       fileName: file.name,
-      message: file.validationIssue || "Invalid file detected in ZIP",
+      message: file.validationIssue && "Invalid file detected in ZIP",
     }));
 

[Survived] ConditionalExpression
features/import/services/importPipelineService.ts:52:16
       severity: IssueSeverity.WARNING,
       section: fileTypeToSection(file.type),
       fileName: file.name,
-      message: file.validationIssue || "Invalid file detected in ZIP",
+      message: false,
     }));
 

[Survived] ArithmeticOperator
features/import/services/importPipelineService.ts:56:5
     }));
 
   const recognizedFiles =
-    detected.summary.profileFiles +
-    detected.summary.ratingFiles +
-    detected.summary.reviewFiles +
+    detected.summary.profileFiles + detected.summary.ratingFiles - detected.summary.reviewFiles +
     detected.summary.diaryFiles +
     detected.summary.watchedFiles +

[Survived] ArithmeticOperator
features/import/services/importPipelineService.ts:56:5
     }));
 
   const recognizedFiles =
-    detected.summary.profileFiles +
-    detected.summary.ratingFiles +
-    detected.summary.reviewFiles +
-    detected.summary.diaryFiles +
+    detected.summary.profileFiles + detected.summary.ratingFiles + detected.summary.reviewFiles - detected.summary.diaryFiles +
     detected.summary.watchedFiles +
     detected.summary.watchlistFiles +

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:64:7
     detected.summary.watchlistFiles +
     detected.summary.listFiles;
 
-  if (recognizedFiles === 0) {
+  if (false) {
     detectionIssues.push({
       severity: IssueSeverity.WARNING,
killedBy: importPipelineService should warn when zip has no recognizable import files
statusReason: expected [] to include 'Nenhum arquivo de importação reconhec…'

[Killed] BlockStatement
features/import/services/importPipelineService.ts:64:30
     detected.summary.watchlistFiles +
     detected.summary.listFiles;
 
-  if (recognizedFiles === 0) {
-    detectionIssues.push({
-      severity: IssueSeverity.WARNING,
-      section: "lists",
-      message: "Nenhum arquivo de importação reconhecido no ZIP. Envie o ZIP exportado diretamente do aplicativo.",
-    });
-  }
+  if (recognizedFiles === 0) {}
 
   return detectionIssues;
killedBy: importPipelineService should warn when zip has no recognizable import files
statusReason: expected [] to include 'Nenhum arquivo de importação reconhec…'

[Killed] ObjectLiteral
features/import/services/importPipelineService.ts:65:26
     detected.summary.listFiles;
 
   if (recognizedFiles === 0) {
-    detectionIssues.push({
-      severity: IssueSeverity.WARNING,
-      section: "lists",
-      message: "Nenhum arquivo de importação reconhecido no ZIP. Envie o ZIP exportado diretamente do aplicativo.",
-    });
+    detectionIssues.push({});
   }
 
killedBy: importPipelineService should warn when zip has no recognizable import files
statusReason: expected [] to include 'Nenhum arquivo de importação reconhec…'

[Killed] ArrayDeclaration
features/import/services/importPipelineService.ts:82:14
   const detected = await extractAndDetectZip(file);
 
   const parsedData: Partial<ImportFileSet> = {
-    ratings: [],
+    ratings: ["Stryker was here"],
     reviews: [],
     diary: [],
killedBy: importPipelineService should keep profile undefined when profile parser returns null
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrayDeclaration
features/import/services/importPipelineService.ts:87:12
     diary: [],
     watched: [],
     watchlist: [],
-    lists: [],
+    lists: ["Stryker was here"],
   };
 
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [ 'Stryker was here', …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
features/import/services/importPipelineService.ts:91:67
   };
 
   for (const detectedFile of detected.files) {
-    if (!detectedFile.isValid || detectedFile.type === "unknown") {
-      continue;
-    }
+    if (!detectedFile.isValid || detectedFile.type === "unknown") {}
 
     if (detectedFile.type === "profile") {
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected "vi.fn()" to be called 3 times, but got 4 times

[Killed] EqualityOperator
features/import/services/importPipelineService.ts:91:34
   };
 
   for (const detectedFile of detected.files) {
-    if (!detectedFile.isValid || detectedFile.type === "unknown") {
+    if (!detectedFile.isValid || detectedFile.type !== "unknown") {
       continue;
     }
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
features/import/services/importPipelineService.ts:95:42
       continue;
     }
 
-    if (detectedFile.type === "profile") {
-      const parsed = (await parseImportCsvContent(detectedFile.content, "profile")) as ProfileData | null;
-      if (parsed) {
-        parsedData.profile = parsed;
-      }
-      continue;
-    }
+    if (detectedFile.type === "profile") {}
 
     if (detectedFile.type === "ratings") {
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: parsed is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:95:9
       continue;
     }
 
-    if (detectedFile.type === "profile") {
+    if (true) {
       const parsed = (await parseImportCsvContent(detectedFile.content, "profile")) as ProfileData | null;
       if (parsed) {
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:97:11
 
     if (detectedFile.type === "profile") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "profile")) as ProfileData | null;
-      if (parsed) {
+      if (false) {
         parsedData.profile = parsed;
       }
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected undefined to be 'john' // Object.is equality

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:97:11
 
     if (detectedFile.type === "profile") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "profile")) as ProfileData | null;
-      if (parsed) {
+      if (true) {
         parsedData.profile = parsed;
       }
killedBy: importPipelineService should keep profile undefined when profile parser returns null
statusReason: expected null to be undefined

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:103:9
       continue;
     }
 
-    if (detectedFile.type === "ratings") {
+    if (false) {
       const parsed = (await parseImportCsvContent(detectedFile.content, "ratings")) as RatingData[];
       parsedData.ratings = [...(parsedData.ratings || []), ...parsed];
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] EqualityOperator
features/import/services/importPipelineService.ts:103:9
       continue;
     }
 
-    if (detectedFile.type === "ratings") {
+    if (detectedFile.type !== "ratings") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "ratings")) as RatingData[];
       parsedData.ratings = [...(parsedData.ratings || []), ...parsed];
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:105:33
 
     if (detectedFile.type === "ratings") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "ratings")) as RatingData[];
-      parsedData.ratings = [...(parsedData.ratings || []), ...parsed];
+      parsedData.ratings = [...(false), ...parsed];
       continue;
     }
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:105:33
 
     if (detectedFile.type === "ratings") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "ratings")) as RatingData[];
-      parsedData.ratings = [...(parsedData.ratings || []), ...parsed];
+      parsedData.ratings = [...(true), ...parsed];
       continue;
     }
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
features/import/services/importPipelineService.ts:109:42
       continue;
     }
 
-    if (detectedFile.type === "reviews") {
-      const parsed = (await parseImportCsvContent(detectedFile.content, "reviews")) as ReviewData[];
-      parsedData.reviews = [...(parsedData.reviews || []), ...parsed];
-      continue;
-    }
+    if (detectedFile.type === "reviews") {}
 
     if (detectedFile.type === "diary") {
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] EqualityOperator
features/import/services/importPipelineService.ts:109:9
       continue;
     }
 
-    if (detectedFile.type === "reviews") {
+    if (detectedFile.type !== "reviews") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "reviews")) as ReviewData[];
       parsedData.reviews = [...(parsedData.reviews || []), ...parsed];
killedBy: importPipelineService should aggregate multiple list files
statusReason: parsed is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:111:33
 
     if (detectedFile.type === "reviews") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "reviews")) as ReviewData[];
-      parsedData.reviews = [...(parsedData.reviews || []), ...parsed];
+      parsedData.reviews = [...(true), ...parsed];
       continue;
     }
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:111:33
 
     if (detectedFile.type === "reviews") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "reviews")) as ReviewData[];
-      parsedData.reviews = [...(parsedData.reviews || []), ...parsed];
+      parsedData.reviews = [...(false), ...parsed];
       continue;
     }
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:115:9
       continue;
     }
 
-    if (detectedFile.type === "diary") {
+    if (false) {
       const parsed = (await parseImportCsvContent(detectedFile.content, "diary")) as DiaryData[];
       parsedData.diary = [...(parsedData.diary || []), ...parsed];
killedBy: importPipelineService should parse diary files and forward diary data to validation/transformation
statusReason: expected "vi.fn()" to be called with arguments: [ 'csv-diary', 'diary' ]

Number of calls: 0

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:115:9
       continue;
     }
 
-    if (detectedFile.type === "diary") {
+    if (true) {
       const parsed = (await parseImportCsvContent(detectedFile.content, "diary")) as DiaryData[];
       parsedData.diary = [...(parsedData.diary || []), ...parsed];
killedBy: importPipelineService should aggregate multiple list files
statusReason: parsed is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:117:31
 
     if (detectedFile.type === "diary") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "diary")) as DiaryData[];
-      parsedData.diary = [...(parsedData.diary || []), ...parsed];
+      parsedData.diary = [...(true), ...parsed];
       continue;
     }
killedBy: importPipelineService should parse diary files and forward diary data to validation/transformation
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:117:31
 
     if (detectedFile.type === "diary") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "diary")) as DiaryData[];
-      parsedData.diary = [...(parsedData.diary || []), ...parsed];
+      parsedData.diary = [...(false), ...parsed];
       continue;
     }
killedBy: importPipelineService should parse diary files and forward diary data to validation/transformation
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] EqualityOperator
features/import/services/importPipelineService.ts:121:9
       continue;
     }
 
-    if (detectedFile.type === "watched") {
+    if (detectedFile.type !== "watched") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watched")) as WatchedMovieData[];
       parsedData.watched = [...(parsedData.watched || []), ...parsed];
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:121:9
       continue;
     }
 
-    if (detectedFile.type === "watched") {
+    if (false) {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watched")) as WatchedMovieData[];
       parsedData.watched = [...(parsedData.watched || []), ...parsed];
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:123:33
 
     if (detectedFile.type === "watched") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watched")) as WatchedMovieData[];
-      parsedData.watched = [...(parsedData.watched || []), ...parsed];
+      parsedData.watched = [...(false), ...parsed];
       continue;
     }
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:123:33
 
     if (detectedFile.type === "watched") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watched")) as WatchedMovieData[];
-      parsedData.watched = [...(parsedData.watched || []), ...parsed];
+      parsedData.watched = [...(true), ...parsed];
       continue;
     }
killedBy: importPipelineService should connect detect, parse, validate and transform flow
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
features/import/services/importPipelineService.ts:127:44
       continue;
     }
 
-    if (detectedFile.type === "watchlist") {
-      const parsed = (await parseImportCsvContent(detectedFile.content, "watchlist")) as WatchlistMovieData[];
-      parsedData.watchlist = [...(parsedData.watchlist || []), ...parsed];
-      continue;
-    }
+    if (detectedFile.type === "watchlist") {}
 
     if (detectedFile.type === "list") {
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] EqualityOperator
features/import/services/importPipelineService.ts:127:9
       continue;
     }
 
-    if (detectedFile.type === "watchlist") {
+    if (detectedFile.type !== "watchlist") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watchlist")) as WatchlistMovieData[];
       parsedData.watchlist = [...(parsedData.watchlist || []), ...parsed];
killedBy: importPipelineService should aggregate multiple list files
statusReason: parsed is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:129:35
 
     if (detectedFile.type === "watchlist") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watchlist")) as WatchlistMovieData[];
-      parsedData.watchlist = [...(parsedData.watchlist || []), ...parsed];
+      parsedData.watchlist = [...(true), ...parsed];
       continue;
     }
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:129:35
 
     if (detectedFile.type === "watchlist") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "watchlist")) as WatchlistMovieData[];
-      parsedData.watchlist = [...(parsedData.watchlist || []), ...parsed];
+      parsedData.watchlist = [...(false), ...parsed];
       continue;
     }
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
features/import/services/importPipelineService.ts:133:39
       continue;
     }
 
-    if (detectedFile.type === "list") {
-      const parsed = (await parseImportCsvContent(detectedFile.content, "list")) as ListData | null;
-      if (parsed) {
-        parsedData.lists = [...(parsedData.lists || []), parsed];
-      }
-    }
+    if (detectedFile.type === "list") {}
   }
 
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:133:9
       continue;
     }
 
-    if (detectedFile.type === "list") {
+    if (false) {
       const parsed = (await parseImportCsvContent(detectedFile.content, "list")) as ListData | null;
       if (parsed) {
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:135:11
 
     if (detectedFile.type === "list") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "list")) as ListData | null;
-      if (parsed) {
+      if (false) {
         parsedData.lists = [...(parsedData.lists || []), parsed];
       }
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
features/import/services/importPipelineService.ts:135:19
 
     if (detectedFile.type === "list") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "list")) as ListData | null;
-      if (parsed) {
-        parsedData.lists = [...(parsedData.lists || []), parsed];
-      }
+      if (parsed) {}
     }
   }
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
features/import/services/importPipelineService.ts:136:33
     if (detectedFile.type === "list") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "list")) as ListData | null;
       if (parsed) {
-        parsedData.lists = [...(parsedData.lists || []), parsed];
+        parsedData.lists = [...(parsedData.lists && []), parsed];
       }
     }
killedBy: importPipelineService should aggregate multiple list files
statusReason: expected [ { date: '2024-01-01', …(2) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:136:33
     if (detectedFile.type === "list") {
       const parsed = (await parseImportCsvContent(detectedFile.content, "list")) as ListData | null;
       if (parsed) {
-        parsedData.lists = [...(parsedData.lists || []), parsed];
+        parsedData.lists = [...(false), parsed];
       }
     }
killedBy: importPipelineService should aggregate multiple list files
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrowFunction
features/import/services/importPipelineService.ts:145:32
   const detectionIssues = mapDetectionIssues(detected);
   const issues = [...baseValidation.issues, ...detectionIssues];
 
-  const errors = issues.filter((issue) => issue.severity === IssueSeverity.ERROR).map((issue) => issue.message);
+  const errors = issues.filter(() => undefined).map((issue) => issue.message);
   const warnings = issues.filter((issue) => issue.severity === IssueSeverity.WARNING).map((issue) => issue.message);
 
killedBy: importPipelineService should not transform when validation cannot proceed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
features/import/services/importPipelineService.ts:145:43
   const detectionIssues = mapDetectionIssues(detected);
   const issues = [...baseValidation.issues, ...detectionIssues];
 
-  const errors = issues.filter((issue) => issue.severity === IssueSeverity.ERROR).map((issue) => issue.message);
+  const errors = issues.filter((issue) => false).map((issue) => issue.message);
   const warnings = issues.filter((issue) => issue.severity === IssueSeverity.WARNING).map((issue) => issue.message);
 
killedBy: importPipelineService should not transform when validation cannot proceed
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ArrowFunction
features/import/services/importPipelineService.ts:146:34
   const issues = [...baseValidation.issues, ...detectionIssues];
 
   const errors = issues.filter((issue) => issue.severity === IssueSeverity.ERROR).map((issue) => issue.message);
-  const warnings = issues.filter((issue) => issue.severity === IssueSeverity.WARNING).map((issue) => issue.message);
+  const warnings = issues.filter(() => undefined).map((issue) => issue.message);
 
   const validation: ValidationResult = {
killedBy: importPipelineService should parse all supported file types and merge invalid detection warnings
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
features/import/services/importPipelineService.ts:146:91
   const issues = [...baseValidation.issues, ...detectionIssues];
 
   const errors = issues.filter((issue) => issue.severity === IssueSeverity.ERROR).map((issue) => issue.message);
-  const warnings = issues.filter((issue) => issue.severity === IssueSeverity.WARNING).map((issue) => issue.message);
+  const warnings = issues.filter((issue) => issue.severity === IssueSeverity.WARNING).map(() => undefined);
 
   const validation: ValidationResult = {
killedBy: importPipelineService should warn when zip has no recognizable import files
statusReason: expected [ undefined ] to include 'Nenhum arquivo de importação reconhec…'
