[Survived] MethodExpression
features/import/services/importTransformationService.ts:220:5
 
   const baseMovieMap = buildBaseMovieMap(data);
   const watchedKeys = new Set(
-    Array.from(baseMovieMap.values())
-      .filter((movie) => movie.status === "watched")
+    Array.from(baseMovieMap.values())
       .map((movie) => normalizeMovieKey(movie.name, movie.year))
   );

[Survived] EqualityOperator
features/import/services/importTransformationService.ts:221:26
   const baseMovieMap = buildBaseMovieMap(data);
   const watchedKeys = new Set(
     Array.from(baseMovieMap.values())
-      .filter((movie) => movie.status === "watched")
+      .filter((movie) => movie.status !== "watched")
       .map((movie) => normalizeMovieKey(movie.name, movie.year))
   );

[Survived] ConditionalExpression
features/import/services/importTransformationService.ts:221:26
   const baseMovieMap = buildBaseMovieMap(data);
   const watchedKeys = new Set(
     Array.from(baseMovieMap.values())
-      .filter((movie) => movie.status === "watched")
+      .filter((movie) => true)
       .map((movie) => normalizeMovieKey(movie.name, movie.year))
   );

[Survived] ArrowFunction
features/import/services/importTransformationService.ts:222:12
   const watchedKeys = new Set(
     Array.from(baseMovieMap.values())
       .filter((movie) => movie.status === "watched")
-      .map((movie) => normalizeMovieKey(movie.name, movie.year))
+      .map(() => undefined)
   );
 

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:225:32
       .map((movie) => normalizeMovieKey(movie.name, movie.year))
   );
 
-  const allListMovieSources = (data.lists || []).flatMap((list) =>
+  const allListMovieSources = (true).flatMap((list) =>
     buildListMovieSources(list, watchedKeys)
   );
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).flatMap is not a function

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:225:32
       .map((movie) => normalizeMovieKey(movie.name, movie.year))
   );
 
-  const allListMovieSources = (data.lists || []).flatMap((list) =>
+  const allListMovieSources = (false).flatMap((list) =>
     buildListMovieSources(list, watchedKeys)
   );
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).flatMap is not a function

[Survived] BlockStatement
features/import/services/importTransformationService.ts:231:46
 
   const uniqueMatchInput = new Map<string, { title: string; year: number }>();
 
-  for (const movie of baseMovieMap.values()) {
-    uniqueMatchInput.set(normalizeMovieKey(movie.name, movie.year), {
-      title: movie.name,
-      year: movie.year,
-    });
-  }
+  for (const movie of baseMovieMap.values()) {}
 
   for (const movie of allListMovieSources) {

[Survived] ObjectLiteral
features/import/services/importTransformationService.ts:232:69
   const uniqueMatchInput = new Map<string, { title: string; year: number }>();
 
   for (const movie of baseMovieMap.values()) {
-    uniqueMatchInput.set(normalizeMovieKey(movie.name, movie.year), {
-      title: movie.name,
-      year: movie.year,
-    });
+    uniqueMatchInput.set(normalizeMovieKey(movie.name, movie.year), {});
   }
 

[Survived] BlockStatement
features/import/services/importTransformationService.ts:238:44
     });
   }
 
-  for (const movie of allListMovieSources) {
-    uniqueMatchInput.set(normalizeMovieKey(movie.name, movie.year), {
-      title: movie.name,
-      year: movie.year,
-    });
-  }
+  for (const movie of allListMovieSources) {}
 
   const matchResult = await batchMatchMovies({

[Survived] ObjectLiteral
features/import/services/importTransformationService.ts:239:69
   }
 
   for (const movie of allListMovieSources) {
-    uniqueMatchInput.set(normalizeMovieKey(movie.name, movie.year), {
-      title: movie.name,
-      year: movie.year,
-    });
+    uniqueMatchInput.set(normalizeMovieKey(movie.name, movie.year), {});
   }
 

[Killed] MethodExpression
features/import/services/importTransformationService.ts:250:45
     batchSize: 50,
   });
 
-  const processedMovies: ProcessedMovie[] = Array.from(baseMovieMap.values())
-    .map((movie) => {
-      const key = normalizeMovieKey(movie.name, movie.year);
-      return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
-    })
-    .filter((movie): movie is ProcessedMovie => movie !== null);
+  const processedMovies: ProcessedMovie[] = Array.from(baseMovieMap.values()).map(movie => {
+  const key = normalizeMovieKey(movie.name, movie.year);
+  return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
+});
 
   const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || [])
killedBy: importTransformationService should skip unmatched movies when skipUnmatchedMovies is true
statusReason: Cannot read properties of null (reading 'matchWarning')

[Killed] BlockStatement
features/import/services/importTransformationService.ts:251:21
   });
 
   const processedMovies: ProcessedMovie[] = Array.from(baseMovieMap.values())
-    .map((movie) => {
-      const key = normalizeMovieKey(movie.name, movie.year);
-      return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
-    })
+    .map((movie) => {})
     .filter((movie): movie is ProcessedMovie => movie !== null);
 
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: Cannot read properties of undefined (reading 'matchWarning')

[Killed] ArrowFunction
features/import/services/importTransformationService.ts:255:13
       const key = normalizeMovieKey(movie.name, movie.year);
       return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
     })
-    .filter((movie): movie is ProcessedMovie => movie !== null);
+    .filter(() => undefined);
 
   const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || [])
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: expected 'error' to be 'success' // Object.is equality

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:255:49
       const key = normalizeMovieKey(movie.name, movie.year);
       return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
     })
-    .filter((movie): movie is ProcessedMovie => movie !== null);
+    .filter((movie): movie is ProcessedMovie => true);
 
   const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || [])
killedBy: importTransformationService should skip unmatched movies when skipUnmatchedMovies is true
statusReason: Cannot read properties of null (reading 'matchWarning')

[Killed] MethodExpression
features/import/services/importTransformationService.ts:257:56
     })
     .filter((movie): movie is ProcessedMovie => movie !== null);
 
-  const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || [])
-    .map((entry) => {
-      const key = normalizeMovieKey(entry.name, entry.year);
-      return toProcessedDiaryEntry(entry, matchResult.results.get(key), settings, minMatchConfidence);
-    })
-    .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
+  const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || []).map(entry => {
+  const key = normalizeMovieKey(entry.name, entry.year);
+  return toProcessedDiaryEntry(entry, matchResult.results.get(key), settings, minMatchConfidence);
+});
 
   const processedLists: ProcessedList[] = (data.lists || [])
killedBy: importTransformationService should return error when every movie and diary entry is filtered out
statusReason: Cannot read properties of null (reading 'matchWarning')

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:257:57
     })
     .filter((movie): movie is ProcessedMovie => movie !== null);
 
-  const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || [])
+  const processedDiaryEntries: ProcessedDiaryEntry[] = (true)
     .map((entry) => {
       const key = normalizeMovieKey(entry.name, entry.year);
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] BlockStatement
features/import/services/importTransformationService.ts:258:21
     .filter((movie): movie is ProcessedMovie => movie !== null);
 
   const processedDiaryEntries: ProcessedDiaryEntry[] = (data.diary || [])
-    .map((entry) => {
-      const key = normalizeMovieKey(entry.name, entry.year);
-      return toProcessedDiaryEntry(entry, matchResult.results.get(key), settings, minMatchConfidence);
-    })
+    .map((entry) => {})
     .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
 
killedBy: importTransformationService should keep unmatched diary entries with warning when skipUnmatchedMovies is false
statusReason: Cannot read properties of undefined (reading 'matchWarning')

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:262:54
       const key = normalizeMovieKey(entry.name, entry.year);
       return toProcessedDiaryEntry(entry, matchResult.results.get(key), settings, minMatchConfidence);
     })
-    .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
+    .filter((entry): entry is ProcessedDiaryEntry => false);
 
   const processedLists: ProcessedList[] = (data.lists || [])
killedBy: importTransformationService should keep unmatched diary entries with warning when skipUnmatchedMovies is false
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
features/import/services/importTransformationService.ts:262:13
       const key = normalizeMovieKey(entry.name, entry.year);
       return toProcessedDiaryEntry(entry, matchResult.results.get(key), settings, minMatchConfidence);
     })
-    .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
+    .filter(() => undefined);
 
   const processedLists: ProcessedList[] = (data.lists || [])
killedBy: importTransformationService should keep unmatched diary entries with warning when skipUnmatchedMovies is false
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:264:44
     })
     .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
 
-  const processedLists: ProcessedList[] = (data.lists || [])
+  const processedLists: ProcessedList[] = (false)
     .flatMap((list) => {
       const transformedMovies = buildListMovieSources(list, watchedKeys)
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).flatMap is not a function

[Killed] LogicalOperator
features/import/services/importTransformationService.ts:264:44
     })
     .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
 
-  const processedLists: ProcessedList[] = (data.lists || [])
+  const processedLists: ProcessedList[] = (data.lists && [])
     .flatMap((list) => {
       const transformedMovies = buildListMovieSources(list, watchedKeys)
killedBy: importTransformationService should transform lists with type mapping and movie matching
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
features/import/services/importTransformationService.ts:265:24
     .filter((entry): entry is ProcessedDiaryEntry => entry !== null);
 
   const processedLists: ProcessedList[] = (data.lists || [])
-    .flatMap((list) => {
-      const transformedMovies = buildListMovieSources(list, watchedKeys)
-        .map((movie) => {
-          const key = normalizeMovieKey(movie.name, movie.year);
-          return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
-        })
-        .filter((movie): movie is ProcessedMovie => movie !== null);
-
-      if (transformedMovies.length === 0 && settings.skipUnmatchedMovies) {
-        return [];
-      }
-
-      const processedList: ProcessedList = {
-        id: crypto.randomUUID(),
-        name: list.name,
-        description: list.description,
-        type: settings.listTypeMap[list.name] || DEFAULT_LIST_TYPE,
-        movies: transformedMovies,
-        letterboxdUri: list.letterboxdUri,
-      };
-
-      return [processedList];
-    });
+    .flatMap((list) => {});
 
   const unmatchedMovies = processedMovies.filter((m) => m.matchWarning).length;
killedBy: importTransformationService should transform lists with type mapping and movie matching
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] MethodExpression
features/import/services/importTransformationService.ts:266:33
 
   const processedLists: ProcessedList[] = (data.lists || [])
     .flatMap((list) => {
-      const transformedMovies = buildListMovieSources(list, watchedKeys)
-        .map((movie) => {
-          const key = normalizeMovieKey(movie.name, movie.year);
-          return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
-        })
-        .filter((movie): movie is ProcessedMovie => movie !== null);
+      const transformedMovies = buildListMovieSources(list, watchedKeys).map(movie => {
+  const key = normalizeMovieKey(movie.name, movie.year);
+  return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
+});
 
       if (transformedMovies.length === 0 && settings.skipUnmatchedMovies) {
killedBy: importTransformationService should drop list when all its movies are unmatched and skipUnmatchedMovies is true
statusReason: expected [ { …(6) } ] to have a length of +0 but got 1

[Killed] BlockStatement
features/import/services/importTransformationService.ts:267:25
   const processedLists: ProcessedList[] = (data.lists || [])
     .flatMap((list) => {
       const transformedMovies = buildListMovieSources(list, watchedKeys)
-        .map((movie) => {
-          const key = normalizeMovieKey(movie.name, movie.year);
-          return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
-        })
+        .map((movie) => {})
         .filter((movie): movie is ProcessedMovie => movie !== null);
 
killedBy: importTransformationService should transform lists with type mapping and movie matching
statusReason: Cannot read properties of undefined (reading 'tmdbId')

[Killed] EqualityOperator
features/import/services/importTransformationService.ts:271:53
           const key = normalizeMovieKey(movie.name, movie.year);
           return toProcessedMovie(movie, matchResult.results.get(key), settings, minMatchConfidence);
         })
-        .filter((movie): movie is ProcessedMovie => movie !== null);
+        .filter((movie): movie is ProcessedMovie => movie === null);
 
       if (transformedMovies.length === 0 && settings.skipUnmatchedMovies) {
killedBy: importTransformationService should transform lists with type mapping and movie matching
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
features/import/services/importTransformationService.ts:273:75
         })
         .filter((movie): movie is ProcessedMovie => movie !== null);
 
-      if (transformedMovies.length === 0 && settings.skipUnmatchedMovies) {
-        return [];
-      }
+      if (transformedMovies.length === 0 && settings.skipUnmatchedMovies) {}
 
       const processedList: ProcessedList = {
killedBy: importTransformationService should drop list when all its movies are unmatched and skipUnmatchedMovies is true
statusReason: expected [ { …(6) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:273:11
         })
         .filter((movie): movie is ProcessedMovie => movie !== null);
 
-      if (transformedMovies.length === 0 && settings.skipUnmatchedMovies) {
+      if (false) {
         return [];
       }
killedBy: importTransformationService should drop list when all its movies are unmatched and skipUnmatchedMovies is true
statusReason: expected [ { …(6) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:281:15
         id: crypto.randomUUID(),
         name: list.name,
         description: list.description,
-        type: settings.listTypeMap[list.name] || DEFAULT_LIST_TYPE,
+        type: true,
         movies: transformedMovies,
         letterboxdUri: list.letterboxdUri,
killedBy: importTransformationService should transform lists with type mapping and movie matching
statusReason: expected true to be 'full_shared' // Object.is equality

[Killed] ConditionalExpression
features/import/services/importTransformationService.ts:281:15
         id: crypto.randomUUID(),
         name: list.name,
         description: list.description,
-        type: settings.listTypeMap[list.name] || DEFAULT_LIST_TYPE,
+        type: false,
         movies: transformedMovies,
         letterboxdUri: list.letterboxdUri,
killedBy: importTransformationService should transform lists with type mapping and movie matching
statusReason: expected false to be 'full_shared' // Object.is equality

[Survived] ArrowFunction
features/import/services/importTransformationService.ts:289:50
       return [processedList];
     });
 
-  const unmatchedMovies = processedMovies.filter((m) => m.matchWarning).length;
+  const unmatchedMovies = processedMovies.filter(() => undefined).length;
   const matchedMovies = processedMovies.length - unmatchedMovies;
   const unmatchedDiaryEntries = processedDiaryEntries.filter((entry) => entry.matchWarning).length;

[Survived] MethodExpression
features/import/services/importTransformationService.ts:289:27
       return [processedList];
     });
 
-  const unmatchedMovies = processedMovies.filter((m) => m.matchWarning).length;
+  const unmatchedMovies = processedMovies.length;
   const matchedMovies = processedMovies.length - unmatchedMovies;
   const unmatchedDiaryEntries = processedDiaryEntries.filter((entry) => entry.matchWarning).length;

[Survived] ArithmeticOperator
features/import/services/importTransformationService.ts:290:25
     });
 
   const unmatchedMovies = processedMovies.filter((m) => m.matchWarning).length;
-  const matchedMovies = processedMovies.length - unmatchedMovies;
+  const matchedMovies = processedMovies.length + unmatchedMovies;
   const unmatchedDiaryEntries = processedDiaryEntries.filter((entry) => entry.matchWarning).length;
 

[Survived] ArrowFunction
features/import/services/importTransformationService.ts:291:62
 
   const unmatchedMovies = processedMovies.filter((m) => m.matchWarning).length;
   const matchedMovies = processedMovies.length - unmatchedMovies;
-  const unmatchedDiaryEntries = processedDiaryEntries.filter((entry) => entry.matchWarning).length;
+  const unmatchedDiaryEntries = processedDiaryEntries.filter(() => undefined).length;
 
   return {

[Survived] MethodExpression
features/import/services/importTransformationService.ts:291:33
 
   const unmatchedMovies = processedMovies.filter((m) => m.matchWarning).length;
   const matchedMovies = processedMovies.length - unmatchedMovies;
-  const unmatchedDiaryEntries = processedDiaryEntries.filter((entry) => entry.matchWarning).length;
+  const unmatchedDiaryEntries = processedDiaryEntries.length;
 
   return {

[Killed] ObjectLiteral
features/import/services/importTransformationService.ts:293:10
   const matchedMovies = processedMovies.length - unmatchedMovies;
   const unmatchedDiaryEntries = processedDiaryEntries.filter((entry) => entry.matchWarning).length;
 
-  return {
-    fileName,
-    status: mapStatus(processedMovies, processedDiaryEntries),
-    movies: processedMovies,
-    diaryEntries: processedDiaryEntries,
-    lists: processedLists,
-    stats: {
-      totalMovies: processedMovies.length,
-      totalDiaryEntries: processedDiaryEntries.length,
-      matchedMovies,
-      unmatchedMovies,
-      unmatchedDiaryEntries,
-      totalLists: processedLists.length,
-    },
-  };
+  return {};
 }
 
killedBy: importTransformationService should merge watched, ratings and reviews into unique processed movies
statusReason: expected undefined to be 'success' // Object.is equality

[Survived] ObjectLiteral
features/import/services/importTransformationService.ts:299:12
     movies: processedMovies,
     diaryEntries: processedDiaryEntries,
     lists: processedLists,
-    stats: {
-      totalMovies: processedMovies.length,
-      totalDiaryEntries: processedDiaryEntries.length,
-      matchedMovies,
-      unmatchedMovies,
-      unmatchedDiaryEntries,
-      totalLists: processedLists.length,
-    },
+    stats: {},
   };
 }
