[Killed] ArrayDeclaration
features/import/services/importValidationService.ts:30:37
 export async function validateImportFiles(
   fileSet: Partial<ImportFileSet>
 ): Promise<ValidationResult> {
-  const issues: ValidationIssue[] = [];
+  const issues: ValidationIssue[] = ["Stryker was here"];
 
   // Validate each file type
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: expected [ 'Stryker was here' ] to have a length of +0 but got 1

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:33:7
   const issues: ValidationIssue[] = [];
 
   // Validate each file type
-  if (fileSet.profile) {
+  if (false) {
     const profileIssues = validateProfileData(fileSet.profile);
     issues.push(...profileIssues);
killedBy: importValidationService validateImportFiles should error on profile without username
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
features/import/services/importValidationService.ts:33:24
   const issues: ValidationIssue[] = [];
 
   // Validate each file type
-  if (fileSet.profile) {
-    const profileIssues = validateProfileData(fileSet.profile);
-    issues.push(...profileIssues);
-  }
+  if (fileSet.profile) {}
 
   if (fileSet.ratings && fileSet.ratings.length > 0) {
killedBy: importValidationService validateImportFiles should error on profile without username
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
features/import/services/importValidationService.ts:38:54
     issues.push(...profileIssues);
   }
 
-  if (fileSet.ratings && fileSet.ratings.length > 0) {
-    const ratingIssues = validateRatingsData(fileSet.ratings);
-    issues.push(...ratingIssues);
-
-    // Perform TMDB matching on ratings
-    const tmdbIssues = await validateTmdbMatching(
-      fileSet.ratings.map((r) => ({ title: r.name, year: r.year }))
-    );
-    issues.push(...tmdbIssues);
-  }
+  if (fileSet.ratings && fileSet.ratings.length > 0) {}
 
   if (fileSet.watched && fileSet.watched.length > 0) {
killedBy: importValidationService validateImportFiles should warn on invalid rating values
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:38:7
     issues.push(...profileIssues);
   }
 
-  if (fileSet.ratings && fileSet.ratings.length > 0) {
+  if (false) {
     const ratingIssues = validateRatingsData(fileSet.ratings);
     issues.push(...ratingIssues);
killedBy: importValidationService validateImportFiles should warn on invalid rating values
statusReason: expected 0 to be greater than 0

[Survived] ArrowFunction
features/import/services/importValidationService.ts:44:27
 
     // Perform TMDB matching on ratings
     const tmdbIssues = await validateTmdbMatching(
-      fileSet.ratings.map((r) => ({ title: r.name, year: r.year }))
+      fileSet.ratings.map(() => undefined)
     );
     issues.push(...tmdbIssues);

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:49:7
     issues.push(...tmdbIssues);
   }
 
-  if (fileSet.watched && fileSet.watched.length > 0) {
+  if (true) {
     const watchedIssues = validateWatchedData(fileSet.watched);
     issues.push(...watchedIssues);
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] LogicalOperator
features/import/services/importValidationService.ts:49:7
     issues.push(...tmdbIssues);
   }
 
-  if (fileSet.watched && fileSet.watched.length > 0) {
+  if (fileSet.watched || fileSet.watched.length > 0) {
     const watchedIssues = validateWatchedData(fileSet.watched);
     issues.push(...watchedIssues);
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
features/import/services/importValidationService.ts:54:50
     issues.push(...watchedIssues);
   }
 
-  if (fileSet.diary && fileSet.diary.length > 0) {
-    const diaryIssues = validateDiaryData(fileSet.diary);
-    issues.push(...diaryIssues);
-  }
+  if (fileSet.diary && fileSet.diary.length > 0) {}
 
   if (fileSet.watchlist && fileSet.watchlist.length > 0) {
killedBy: importValidationService validateImportFiles should validate diary entries and keep canProceed when only warnings exist
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
features/import/services/importValidationService.ts:54:7
     issues.push(...watchedIssues);
   }
 
-  if (fileSet.diary && fileSet.diary.length > 0) {
+  if (fileSet.diary || fileSet.diary.length > 0) {
     const diaryIssues = validateDiaryData(fileSet.diary);
     issues.push(...diaryIssues);
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
features/import/services/importValidationService.ts:59:7
     issues.push(...diaryIssues);
   }
 
-  if (fileSet.watchlist && fileSet.watchlist.length > 0) {
+  if (fileSet.watchlist || fileSet.watchlist.length > 0) {
     const watchlistIssues = validateWatchlistData(fileSet.watchlist);
     issues.push(...watchlistIssues);
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:59:7
     issues.push(...diaryIssues);
   }
 
-  if (fileSet.watchlist && fileSet.watchlist.length > 0) {
+  if (false) {
     const watchlistIssues = validateWatchlistData(fileSet.watchlist);
     issues.push(...watchlistIssues);
killedBy: importValidationService validateImportFiles should warn on invalid watchlist movie fields
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:64:7
     issues.push(...watchlistIssues);
   }
 
-  if (fileSet.lists && fileSet.lists.length > 0) {
+  if (false) {
     const listIssues = validateListsData(fileSet.lists);
     issues.push(...listIssues);
killedBy: importValidationService validateImportFiles should warn on invalid list metadata and movies
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
features/import/services/importValidationService.ts:64:7
     issues.push(...watchlistIssues);
   }
 
-  if (fileSet.lists && fileSet.lists.length > 0) {
+  if (fileSet.lists || fileSet.lists.length > 0) {
     const listIssues = validateListsData(fileSet.lists);
     issues.push(...listIssues);
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
features/import/services/importValidationService.ts:70:18
   }
 
   // Compile results
-  const errors = issues.filter((i) => i.severity === IssueSeverity.ERROR);
+  const errors = issues;
   const warnings = issues.filter((i) => i.severity === IssueSeverity.WARNING);
 
killedBy: importValidationService validateImportFiles should validate diary entries and keep canProceed when only warnings exist
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
features/import/services/importValidationService.ts:70:32
   }
 
   // Compile results
-  const errors = issues.filter((i) => i.severity === IssueSeverity.ERROR);
+  const errors = issues.filter(() => undefined);
   const warnings = issues.filter((i) => i.severity === IssueSeverity.WARNING);
 
killedBy: importValidationService validateImportFiles should error on profile without username
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
features/import/services/importValidationService.ts:71:41
 
   // Compile results
   const errors = issues.filter((i) => i.severity === IssueSeverity.ERROR);
-  const warnings = issues.filter((i) => i.severity === IssueSeverity.WARNING);
+  const warnings = issues.filter((i) => i.severity !== IssueSeverity.WARNING);
 
   const isValid = errors.length === 0;
killedBy: importValidationService validateImportFiles should warn on invalid rating values
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:71:41
 
   // Compile results
   const errors = issues.filter((i) => i.severity === IssueSeverity.ERROR);
-  const warnings = issues.filter((i) => i.severity === IssueSeverity.WARNING);
+  const warnings = issues.filter((i) => false);
 
   const isValid = errors.length === 0;
killedBy: importValidationService validateImportFiles should warn on invalid rating values
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:73:19
   const errors = issues.filter((i) => i.severity === IssueSeverity.ERROR);
   const warnings = issues.filter((i) => i.severity === IssueSeverity.WARNING);
 
-  const isValid = errors.length === 0;
+  const isValid = true;
   const canProceed = isValid; // Allow WARNINGs, but block on ERRORs
 
killedBy: importValidationService validateImportFiles should error on profile without username
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:73:19
   const errors = issues.filter((i) => i.severity === IssueSeverity.ERROR);
   const warnings = issues.filter((i) => i.severity === IssueSeverity.WARNING);
 
-  const isValid = errors.length === 0;
+  const isValid = false;
   const canProceed = isValid; // Allow WARNINGs, but block on ERRORs
 
killedBy: importValidationService validateImportFiles should validate empty file set
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
features/import/services/importValidationService.ts:79:28
   return {
     isValid,
     issues,
-    warnings: warnings.map((w) => w.message),
+    warnings: warnings.map(() => undefined),
     errors: errors.map((e) => e.message),
     canProceed,
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match returns failed movies
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ArrowFunction
features/import/services/importValidationService.ts:80:24
     isValid,
     issues,
     warnings: warnings.map((w) => w.message),
-    errors: errors.map((e) => e.message),
+    errors: errors.map(() => undefined),
     canProceed,
   };
killedBy: importValidationService validateImportFiles should error on profile without username
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] EqualityOperator
features/import/services/importValidationService.ts:94:7
 ) {
   const { rows, errors } = parseCsv(csvContent);
 
-  if (errors.length > 0) {
+  if (errors.length >= 0) {
     throw new Error(`CSV parsing errors: ${errors.join("; ")}`);
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors:

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:99:5
   }
 
   switch (fileType) {
-    case "profile":
-      return parseProfileCsv(rows);
+    case "profile":
 
     case "ratings":
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: expected undefined to be 'testuser' // Object.is equality

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:102:5
     case "profile":
       return parseProfileCsv(rows);
 
-    case "ratings":
-      return parseRatingsCsv(rows);
+    case "ratings":
 
     case "reviews":

[Killed] StringLiteral
features/import/services/importValidationService.ts:102:10
     case "profile":
       return parseProfileCsv(rows);
 
-    case "ratings":
+    case "":
       return parseRatingsCsv(rows);
 
killedBy: importValidationService parseImportCsvContent should parse ratings CSV
statusReason: Unknown file type: ratings

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:105:5
     case "ratings":
       return parseRatingsCsv(rows);
 
-    case "reviews":
-      return parseReviewsCsv(rows);
+    case "reviews":
 
     case "diary":
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:108:5
     case "reviews":
       return parseReviewsCsv(rows);
 
-    case "diary":
-      return parseDiaryCsv(rows);
+    case "diary":
 
     case "watched":
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [ { …(4) }, { …(4) } ] to have a length of 1 but got 2

[Killed] StringLiteral
features/import/services/importValidationService.ts:108:10
     case "reviews":
       return parseReviewsCsv(rows);
 
-    case "diary":
+    case "":
       return parseDiaryCsv(rows);
 
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: Unknown file type: diary

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:111:5
     case "diary":
       return parseDiaryCsv(rows);
 
-    case "watched":
-      return parseWatchedCsv(rows);
+    case "watched":
 
     case "watchlist":

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:114:5
     case "watched":
       return parseWatchedCsv(rows);
 
-    case "watchlist":
-      return parseWatchlistCsv(rows);
+    case "watchlist":
 
     case "list":
killedBy: importValidationService parseImportCsvContent should parse watchlist CSV
statusReason: expected { …(4) } to have property 'length'

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:117:5
     case "watchlist":
       return parseWatchlistCsv(rows);
 
-    case "list":
-      return parseListCsv(rows);
+    case "list":
 
     default:
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: Unknown file type: list

[Killed] StringLiteral
features/import/services/importValidationService.ts:117:10
     case "watchlist":
       return parseWatchlistCsv(rows);
 
-    case "list":
+    case "":
       return parseListCsv(rows);
 
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: Unknown file type: list

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:120:5
     case "list":
       return parseListCsv(rows);
 
-    default:
-      throw new Error(`Unknown file type: ${fileType}`);
+    default:
   }
 }
killedBy: importValidationService parseImportCsvContent should throw error for unknown file type
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
features/import/services/importValidationService.ts:128:7
 /* ─── PARSER FUNCTIONS ─── */
 
 function parseProfileCsv(rows: Record<string, string>[]): ProfileData | null {
-  if (rows.length === 0) return null;
+  if (rows.length !== 0) return null;
 
   const row = rows[0];
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:128:7
 /* ─── PARSER FUNCTIONS ─── */
 
 function parseProfileCsv(rows: Record<string, string>[]): ProfileData | null {
-  if (rows.length === 0) return null;
+  if (true) return null;
 
   const row = rows[0];
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] StringLiteral
features/import/services/importValidationService.ts:132:67
 
   const row = rows[0];
 
-  const { value: username, error: usernameError } = getField(row, "Username", {
+  const { value: username, error: usernameError } = getField(row, "", {
     required: true,
   });
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Survived] ObjectLiteral
features/import/services/importValidationService.ts:132:79
 
   const row = rows[0];
 
-  const { value: username, error: usernameError } = getField(row, "Username", {
-    required: true,
-  });
+  const { value: username, error: usernameError } = getField(row, "Username", {});
 
   if (usernameError || !username) {

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:133:15
   const row = rows[0];
 
   const { value: username, error: usernameError } = getField(row, "Username", {
-    required: true,
+    required: false,
   });
 

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:136:7
     required: true,
   });
 
-  if (usernameError || !username) {
+  if (true) {
     throw new Error("Profile: Missing username");
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] BooleanLiteral
features/import/services/importValidationService.ts:136:24
     required: true,
   });
 
-  if (usernameError || !username) {
+  if (usernameError || username) {
     throw new Error("Profile: Missing username");
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Survived] ObjectLiteral
features/import/services/importValidationService.ts:140:66
     throw new Error("Profile: Missing username");
   }
 
-  const { value: dateJoined } = getDateField(row, "Date Joined", {
-    fallback: new Date().toISOString(),
-  });
+  const { value: dateJoined } = getDateField(row, "Date Joined", {});
 
   return {

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:146:16
 
   return {
     username,
-    givenName: getField(row, "Given Name").value || undefined,
+    givenName: true,
     familyName: getField(row, "Family Name").value || undefined,
     email: getField(row, "Email Address").value || undefined,
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: expected true to be 'John' // Object.is equality

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:146:16
 
   return {
     username,
-    givenName: getField(row, "Given Name").value || undefined,
+    givenName: false,
     familyName: getField(row, "Family Name").value || undefined,
     email: getField(row, "Email Address").value || undefined,
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: expected false to be 'John' // Object.is equality

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:147:17
   return {
     username,
     givenName: getField(row, "Given Name").value || undefined,
-    familyName: getField(row, "Family Name").value || undefined,
+    familyName: true,
     email: getField(row, "Email Address").value || undefined,
     location: getField(row, "Location").value || undefined,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:147:17
   return {
     username,
     givenName: getField(row, "Given Name").value || undefined,
-    familyName: getField(row, "Family Name").value || undefined,
+    familyName: getField(row, "Family Name").value && undefined,
     email: getField(row, "Email Address").value || undefined,
     location: getField(row, "Location").value || undefined,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:148:12
     username,
     givenName: getField(row, "Given Name").value || undefined,
     familyName: getField(row, "Family Name").value || undefined,
-    email: getField(row, "Email Address").value || undefined,
+    email: getField(row, "Email Address").value && undefined,
     location: getField(row, "Location").value || undefined,
     website: getField(row, "Website").value || undefined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:148:12
     username,
     givenName: getField(row, "Given Name").value || undefined,
     familyName: getField(row, "Family Name").value || undefined,
-    email: getField(row, "Email Address").value || undefined,
+    email: false,
     location: getField(row, "Location").value || undefined,
     website: getField(row, "Website").value || undefined,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:149:15
     givenName: getField(row, "Given Name").value || undefined,
     familyName: getField(row, "Family Name").value || undefined,
     email: getField(row, "Email Address").value || undefined,
-    location: getField(row, "Location").value || undefined,
+    location: getField(row, "Location").value && undefined,
     website: getField(row, "Website").value || undefined,
     bio: getField(row, "Bio").value || undefined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:149:15
     givenName: getField(row, "Given Name").value || undefined,
     familyName: getField(row, "Family Name").value || undefined,
     email: getField(row, "Email Address").value || undefined,
-    location: getField(row, "Location").value || undefined,
+    location: false,
     website: getField(row, "Website").value || undefined,
     bio: getField(row, "Bio").value || undefined,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:150:14
     familyName: getField(row, "Family Name").value || undefined,
     email: getField(row, "Email Address").value || undefined,
     location: getField(row, "Location").value || undefined,
-    website: getField(row, "Website").value || undefined,
+    website: getField(row, "Website").value && undefined,
     bio: getField(row, "Bio").value || undefined,
     pronoun: getField(row, "Pronoun").value || undefined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:150:14
     familyName: getField(row, "Family Name").value || undefined,
     email: getField(row, "Email Address").value || undefined,
     location: getField(row, "Location").value || undefined,
-    website: getField(row, "Website").value || undefined,
+    website: false,
     bio: getField(row, "Bio").value || undefined,
     pronoun: getField(row, "Pronoun").value || undefined,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:151:10
     email: getField(row, "Email Address").value || undefined,
     location: getField(row, "Location").value || undefined,
     website: getField(row, "Website").value || undefined,
-    bio: getField(row, "Bio").value || undefined,
+    bio: getField(row, "Bio").value && undefined,
     pronoun: getField(row, "Pronoun").value || undefined,
     favoriteFilms: getField(row, "Favorite Films").value || undefined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:151:10
     email: getField(row, "Email Address").value || undefined,
     location: getField(row, "Location").value || undefined,
     website: getField(row, "Website").value || undefined,
-    bio: getField(row, "Bio").value || undefined,
+    bio: false,
     pronoun: getField(row, "Pronoun").value || undefined,
     favoriteFilms: getField(row, "Favorite Films").value || undefined,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:152:14
     location: getField(row, "Location").value || undefined,
     website: getField(row, "Website").value || undefined,
     bio: getField(row, "Bio").value || undefined,
-    pronoun: getField(row, "Pronoun").value || undefined,
+    pronoun: getField(row, "Pronoun").value && undefined,
     favoriteFilms: getField(row, "Favorite Films").value || undefined,
     dateJoined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:152:14
     location: getField(row, "Location").value || undefined,
     website: getField(row, "Website").value || undefined,
     bio: getField(row, "Bio").value || undefined,
-    pronoun: getField(row, "Pronoun").value || undefined,
+    pronoun: true,
     favoriteFilms: getField(row, "Favorite Films").value || undefined,
     dateJoined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:153:20
     website: getField(row, "Website").value || undefined,
     bio: getField(row, "Bio").value || undefined,
     pronoun: getField(row, "Pronoun").value || undefined,
-    favoriteFilms: getField(row, "Favorite Films").value || undefined,
+    favoriteFilms: false,
     dateJoined,
   };

[Survived] LogicalOperator
features/import/services/importValidationService.ts:153:20
     website: getField(row, "Website").value || undefined,
     bio: getField(row, "Bio").value || undefined,
     pronoun: getField(row, "Pronoun").value || undefined,
-    favoriteFilms: getField(row, "Favorite Films").value || undefined,
+    favoriteFilms: getField(row, "Favorite Films").value && undefined,
     dateJoined,
   };

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:161:83
 function parseRatingsCsv(rows: Record<string, string>[]): RatingData[] {
   return rows
     .flatMap((row) => {
-      const { value: name, error: nameError } = getField(row, "Name", { required: true });
+      const { value: name, error: nameError } = getField(row, "Name", { required: false });
       const { value: year, error: yearError } = getNumericField(row, "Year", {
         required: true,

[Survived] ObjectLiteral
features/import/services/importValidationService.ts:161:71
 function parseRatingsCsv(rows: Record<string, string>[]): RatingData[] {
   return rows
     .flatMap((row) => {
-      const { value: name, error: nameError } = getField(row, "Name", { required: true });
+      const { value: name, error: nameError } = getField(row, "Name", {});
       const { value: year, error: yearError } = getNumericField(row, "Year", {
         required: true,

[Survived] ObjectLiteral
features/import/services/importValidationService.ts:162:78
   return rows
     .flatMap((row) => {
       const { value: name, error: nameError } = getField(row, "Name", { required: true });
-      const { value: year, error: yearError } = getNumericField(row, "Year", {
-        required: true,
-        min: 1800,
-        max: 2100,
-      });
+      const { value: year, error: yearError } = getNumericField(row, "Year", {});
       const { value: rating, error: ratingError } = getNumericField(row, "Rating", {
         required: true,

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:163:19
     .flatMap((row) => {
       const { value: name, error: nameError } = getField(row, "Name", { required: true });
       const { value: year, error: yearError } = getNumericField(row, "Year", {
-        required: true,
+        required: false,
         min: 1800,
         max: 2100,

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:168:19
         max: 2100,
       });
       const { value: rating, error: ratingError } = getNumericField(row, "Rating", {
-        required: true,
+        required: false,
         min: 0,
         max: 5,

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:173:11
         max: 5,
       });
 
-      if (nameError || !name || yearError || !year || ratingError || rating === null) {
+      if (false) {
         return []; // Skip invalid rows
       }
killedBy: importValidationService parseImportCsvContent should skip invalid rating rows
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:173:11
         max: 5,
       });
 
-      if (nameError || !name || yearError || !year || ratingError || rating === null) {
+      if (false || rating === null) {
         return []; // Skip invalid rows
       }
killedBy: importValidationService parseImportCsvContent should skip invalid rating rows
statusReason: expected [ { …(5) }, { …(5) } ] to have a length of 1 but got 2

[Killed] ArrayDeclaration
features/import/services/importValidationService.ts:174:16
       });
 
       if (nameError || !name || yearError || !year || ratingError || rating === null) {
-        return []; // Skip invalid rows
+        return ["Stryker was here"]; // Skip invalid rows
       }
 
killedBy: importValidationService parseImportCsvContent should skip invalid rating rows
statusReason: expected [ { …(5) }, 'Stryker was here' ] to have a length of 1 but got 2

[Survived] StringLiteral
features/import/services/importValidationService.ts:178:54
       }
 
       const { value: date } = getDateField(row, "Date");
-      const { value: letterboxdUri } = getField(row, "Letterboxd URI");
+      const { value: letterboxdUri } = getField(row, "");
 
       return [{

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:181:15
       const { value: letterboxdUri } = getField(row, "Letterboxd URI");
 
       return [{
-        date: date || new Date().toISOString(),
+        date: false,
         name,
         year,
killedBy: importValidationService Letterboxd format compatibility should handle various date formats in Letterboxd CSV
statusReason: expected false to be truthy
