[Survived] LogicalOperator
features/import/services/importValidationService.ts:181:15
       const { value: letterboxdUri } = getField(row, "Letterboxd URI");
 
       return [{
-        date: date || new Date().toISOString(),
+        date: date && new Date().toISOString(),
         name,
         year,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:185:24
         name,
         year,
         rating,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: letterboxdUri && undefined,
       }];
     });

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:185:24
         name,
         year,
         rating,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: true,
       }];
     });

[Killed] StringLiteral
features/import/services/importValidationService.ts:193:63
 function parseReviewsCsv(rows: Record<string, string>[]): ReviewData[] {
   return rows
     .flatMap((row) => {
-      const { value: name, error: nameError } = getField(row, "Name", { required: true });
+      const { value: name, error: nameError } = getField(row, "", { required: true });
       const { value: year, error: yearError } = getNumericField(row, "Year", {
         required: true,
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
features/import/services/importValidationService.ts:200:24
         max: 2100,
       });
 
-      if (nameError || !name || yearError || !year) {
+      if (nameError || name || yearError || !year) {
         return [];
       }
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
features/import/services/importValidationService.ts:200:46
         max: 2100,
       });
 
-      if (nameError || !name || yearError || !year) {
+      if (nameError || !name || yearError || year) {
         return [];
       }
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to have a length of 1 but got +0

[Survived] StringLiteral
features/import/services/importValidationService.ts:210:48
         max: 5,
       });
       const { value: review } = getField(row, "Review");
-      const { value: rewatch } = getField(row, "Rewatch");
+      const { value: rewatch } = getField(row, "");
       const { value: tags } = getField(row, "Tags");
       const { value: letterboxdUri } = getField(row, "Letterboxd URI");

[Killed] ArrayDeclaration
features/import/services/importValidationService.ts:215:14
       const { value: letterboxdUri } = getField(row, "Letterboxd URI");
       const { value: watchedDate } = getDateField(row, "Watched Date");
 
-      return [{
-        date: date || new Date().toISOString(),
-        name,
-        year,
-        rating: rating ?? undefined,
-        review: review || undefined,
-        rewatch: rewatch?.toLowerCase() === "yes",
-        tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
-        watchedDate: watchedDate || undefined,
-        letterboxdUri: letterboxdUri || undefined,
-      }];
+      return [];
     });
 }
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to have a length of 1 but got +0

[Survived] LogicalOperator
features/import/services/importValidationService.ts:219:17
         date: date || new Date().toISOString(),
         name,
         year,
-        rating: rating ?? undefined,
+        rating: rating && undefined,
         review: review || undefined,
         rewatch: rewatch?.toLowerCase() === "yes",

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:220:17
         name,
         year,
         rating: rating ?? undefined,
-        review: review || undefined,
+        review: true,
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to include 'Great'

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:220:17
         name,
         year,
         rating: rating ?? undefined,
-        review: review || undefined,
+        review: false,
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: expected [] to include 'Great'

[Killed] OptionalChaining
features/import/services/importValidationService.ts:221:18
         year,
         rating: rating ?? undefined,
         review: review || undefined,
-        rewatch: rewatch?.toLowerCase() === "yes",
+        rewatch: rewatch.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
         watchedDate: watchedDate || undefined,
killedBy: importValidationService parseImportCsvContent should parse reviews CSV
statusReason: Cannot read properties of null (reading 'toLowerCase')

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:221:18
         year,
         rating: rating ?? undefined,
         review: review || undefined,
-        rewatch: rewatch?.toLowerCase() === "yes",
+        rewatch: true,
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
         watchedDate: watchedDate || undefined,

[NoCoverage] ArrowFunction
features/import/services/importValidationService.ts:222:42
         rating: rating ?? undefined,
         review: review || undefined,
         rewatch: rewatch?.toLowerCase() === "yes",
-        tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
+        tags: tags ? tags.split(",").map(() => undefined) : undefined,
         watchedDate: watchedDate || undefined,
         letterboxdUri: letterboxdUri || undefined,

[NoCoverage] MethodExpression
features/import/services/importValidationService.ts:222:49
         rating: rating ?? undefined,
         review: review || undefined,
         rewatch: rewatch?.toLowerCase() === "yes",
-        tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
+        tags: tags ? tags.split(",").map((t) => t) : undefined,
         watchedDate: watchedDate || undefined,
         letterboxdUri: letterboxdUri || undefined,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:223:22
         review: review || undefined,
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
-        watchedDate: watchedDate || undefined,
+        watchedDate: true,
         letterboxdUri: letterboxdUri || undefined,
       }];

[Survived] LogicalOperator
features/import/services/importValidationService.ts:223:22
         review: review || undefined,
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
-        watchedDate: watchedDate || undefined,
+        watchedDate: watchedDate && undefined,
         letterboxdUri: letterboxdUri || undefined,
       }];

[Survived] LogicalOperator
features/import/services/importValidationService.ts:224:24
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
         watchedDate: watchedDate || undefined,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: letterboxdUri && undefined,
       }];
     });

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:224:24
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
         watchedDate: watchedDate || undefined,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: false,
       }];
     });

[Killed] BooleanLiteral
features/import/services/importValidationService.ts:239:19
         max: 2100,
       });
       const { value: watchedDate, error: watchedDateError } = getDateField(row, "Watched Date", {
-        required: true,
+        required: false,
       });
 
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [ { …(8) }, { …(8) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:242:11
         required: true,
       });
 
-      if (nameError || !name || yearError || !year || watchedDateError || !watchedDate) {
+      if (true) {
         return [];
       }
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
features/import/services/importValidationService.ts:242:89
         required: true,
       });
 
-      if (nameError || !name || yearError || !year || watchedDateError || !watchedDate) {
-        return [];
-      }
+      if (nameError || !name || yearError || !year || watchedDateError || !watchedDate) {}
 
       const { value: date } = getDateField(row, "Date");
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [ { …(8) }, { …(8) } ] to have a length of 1 but got 2

[Survived] StringLiteral
features/import/services/importValidationService.ts:252:48
         min: 0,
         max: 5,
       });
-      const { value: rewatch } = getField(row, "Rewatch");
+      const { value: rewatch } = getField(row, "");
       const { value: tags } = getField(row, "Tags");
 

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:256:15
       const { value: tags } = getField(row, "Tags");
 
       return [{
-        date: date || watchedDate,
+        date: true,
         name,
         year,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:256:15
       const { value: tags } = getField(row, "Tags");
 
       return [{
-        date: date || watchedDate,
+        date: date && watchedDate,
         name,
         year,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:259:24
         date: date || watchedDate,
         name,
         year,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: false,
         rating: rating ?? undefined,
         rewatch: rewatch?.toLowerCase() === "yes",

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:259:24
         date: date || watchedDate,
         name,
         year,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: true,
         rating: rating ?? undefined,
         rewatch: rewatch?.toLowerCase() === "yes",

[Survived] LogicalOperator
features/import/services/importValidationService.ts:260:17
         name,
         year,
         letterboxdUri: letterboxdUri || undefined,
-        rating: rating ?? undefined,
+        rating: rating && undefined,
         rewatch: rewatch?.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,

[Killed] OptionalChaining
features/import/services/importValidationService.ts:261:18
         year,
         letterboxdUri: letterboxdUri || undefined,
         rating: rating ?? undefined,
-        rewatch: rewatch?.toLowerCase() === "yes",
+        rewatch: rewatch.toLowerCase() === "yes",
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
         watchedDate,
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: Cannot read properties of null (reading 'toLowerCase')

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:261:18
         year,
         letterboxdUri: letterboxdUri || undefined,
         rating: rating ?? undefined,
-        rewatch: rewatch?.toLowerCase() === "yes",
+        rewatch: true,
         tags: tags ? tags.split(",").map((t) => t.trim()) : undefined,
         watchedDate,

[Killed] BlockStatement
features/import/services/importValidationService.ts:268:78
     });
 }
 
-function parseWatchedCsv(rows: Record<string, string>[]): WatchedMovieData[] {
-  return rows
-    .flatMap((row) => {
-      const { value: name } = getField(row, "Name", { required: true });
-      const { value: year } = getNumericField(row, "Year", {
-        required: true,
-        min: 1800,
-        max: 2100,
-      });
-
-      if (!name || !year) return [];
-
-      const { value: date } = getDateField(row, "Date");
-      const { value: letterboxdUri } = getField(row, "Letterboxd URI");
-
-      return [{
-        date: date || new Date().toISOString(),
-        name,
-        year,
-        letterboxdUri: letterboxdUri || undefined,
-      }];
-    });
-}
+function parseWatchedCsv(rows: Record<string, string>[]): WatchedMovieData[] {}
 
 function parseWatchlistCsv(rows: Record<string, string>[]): WatchlistMovieData[] {
killedBy: importValidationService parseImportCsvContent should parse watched CSV
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
features/import/services/importValidationService.ts:270:23
 
 function parseWatchedCsv(rows: Record<string, string>[]): WatchedMovieData[] {
   return rows
-    .flatMap((row) => {
-      const { value: name } = getField(row, "Name", { required: true });
-      const { value: year } = getNumericField(row, "Year", {
-        required: true,
-        min: 1800,
-        max: 2100,
-      });
-
-      if (!name || !year) return [];
-
-      const { value: date } = getDateField(row, "Date");
-      const { value: letterboxdUri } = getField(row, "Letterboxd URI");
-
-      return [{
-        date: date || new Date().toISOString(),
-        name,
-        year,
-        letterboxdUri: letterboxdUri || undefined,
-      }];
-    });
+    .flatMap((row) => {});
 }
 
killedBy: importValidationService parseImportCsvContent should parse watched CSV
statusReason: Cannot read properties of undefined (reading 'name')

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:271:65
 function parseWatchedCsv(rows: Record<string, string>[]): WatchedMovieData[] {
   return rows
     .flatMap((row) => {
-      const { value: name } = getField(row, "Name", { required: true });
+      const { value: name } = getField(row, "Name", { required: false });
       const { value: year } = getNumericField(row, "Year", {
         required: true,

[Killed] StringLiteral
features/import/services/importValidationService.ts:271:45
 function parseWatchedCsv(rows: Record<string, string>[]): WatchedMovieData[] {
   return rows
     .flatMap((row) => {
-      const { value: name } = getField(row, "Name", { required: true });
+      const { value: name } = getField(row, "", { required: true });
       const { value: year } = getNumericField(row, "Year", {
         required: true,
killedBy: importValidationService parseImportCsvContent should parse watched CSV
statusReason: expected [] to have a length of 1 but got +0

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:273:19
     .flatMap((row) => {
       const { value: name } = getField(row, "Name", { required: true });
       const { value: year } = getNumericField(row, "Year", {
-        required: true,
+        required: false,
         min: 1800,
         max: 2100,

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:278:11
         max: 2100,
       });
 
-      if (!name || !year) return [];
+      if (true) return [];
 
       const { value: date } = getDateField(row, "Date");
killedBy: importValidationService parseImportCsvContent should parse watched CSV
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
features/import/services/importValidationService.ts:278:20
         max: 2100,
       });
 
-      if (!name || !year) return [];
+      if (!name || year) return [];
 
       const { value: date } = getDateField(row, "Date");
killedBy: importValidationService parseImportCsvContent should parse watched CSV
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:284:15
       const { value: letterboxdUri } = getField(row, "Letterboxd URI");
 
       return [{
-        date: date || new Date().toISOString(),
+        date: true,
         name,
         year,

[Killed] BlockStatement
features/import/services/importValidationService.ts:292:82
     });
 }
 
-function parseWatchlistCsv(rows: Record<string, string>[]): WatchlistMovieData[] {
-  return rows
-    .flatMap((row) => {
-      const { value: name } = getField(row, "Name", { required: true });
-      const { value: year } = getNumericField(row, "Year", {
-        required: true,
-        min: 1800,
-        max: 2100,
-      });
-
-      if (!name || !year) return [];
-
-      const { value: date } = getDateField(row, "Date");
-      const { value: letterboxdUri } = getField(row, "Letterboxd URI");
-
-      return [{
-        date: date || new Date().toISOString(),
-        name,
-        year,
-        letterboxdUri: letterboxdUri || undefined,
-      }];
-    });
-}
+function parseWatchlistCsv(rows: Record<string, string>[]): WatchlistMovieData[] {}
 
 function parseListCsv(rows: Record<string, string>[]): ListData | null {
killedBy: importValidationService parseImportCsvContent should parse watchlist CSV
statusReason: Target cannot be null or undefined.

[Survived] LogicalOperator
features/import/services/importValidationService.ts:311:24
         date: date || new Date().toISOString(),
         name,
         year,
-        letterboxdUri: letterboxdUri || undefined,
+        letterboxdUri: letterboxdUri && undefined,
       }];
     });

[Killed] EqualityOperator
features/import/services/importValidationService.ts:317:7
 }
 
 function parseListCsv(rows: Record<string, string>[]): ListData | null {
-  if (rows.length === 0) return null;
+  if (rows.length !== 0) return null;
 
   const firstRow = rows[0];
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: Cannot read properties of null (reading 'movies')

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:317:7
 }
 
 function parseListCsv(rows: Record<string, string>[]): ListData | null {
-  if (rows.length === 0) return null;
+  if (true) return null;
 
   const firstRow = rows[0];
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: Cannot read properties of null (reading 'movies')

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:323:5
 
   // Check if this is metadata row or data row
   const isMetadataRow =
-    getField(firstRow, "Date").value || getField(firstRow, "Name").value;
+    false;
 
   let listName = "";
killedBy: importValidationService parseImportCsvContent should parse list metadata format and ignore embedded movie header row
statusReason: expected 'Imported List' to be 'Minha Lista' // Object.is equality

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:323:5
 
   // Check if this is metadata row or data row
   const isMetadataRow =
-    getField(firstRow, "Date").value || getField(firstRow, "Name").value;
+    true;
 
   let listName = "";

[Survived] StringLiteral
features/import/services/importValidationService.ts:325:18
   const isMetadataRow =
     getField(firstRow, "Date").value || getField(firstRow, "Name").value;
 
-  let listName = "";
+  let listName = "Stryker was here!";
   let listDescription = "";
   let dataStartIndex = 0;

[Killed] LogicalOperator
features/import/services/importValidationService.ts:329:7
   let listDescription = "";
   let dataStartIndex = 0;
 
-  if (isMetadataRow && getField(firstRow, "Position").value === null) {
+  if (isMetadataRow || getField(firstRow, "Position").value === null) {
     // First row is metadata
     listName = getField(firstRow, "Name").value || "Imported List";
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: expected [ { position: 2, …(5) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:329:7
   let listDescription = "";
   let dataStartIndex = 0;
 
-  if (isMetadataRow && getField(firstRow, "Position").value === null) {
+  if (true) {
     // First row is metadata
     listName = getField(firstRow, "Name").value || "Imported List";
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: expected [ { position: 2, …(5) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:331:16
 
   if (isMetadataRow && getField(firstRow, "Position").value === null) {
     // First row is metadata
-    listName = getField(firstRow, "Name").value || "Imported List";
+    listName = true;
     listDescription = getField(firstRow, "Description").value || "";
     dataStartIndex = 1;
killedBy: importValidationService parseImportCsvContent should parse list metadata format and ignore embedded movie header row
statusReason: expected true to be 'Minha Lista' // Object.is equality

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:331:16
 
   if (isMetadataRow && getField(firstRow, "Position").value === null) {
     // First row is metadata
-    listName = getField(firstRow, "Name").value || "Imported List";
+    listName = false;
     listDescription = getField(firstRow, "Description").value || "";
     dataStartIndex = 1;
killedBy: importValidationService parseImportCsvContent should parse list metadata format and ignore embedded movie header row
statusReason: expected false to be 'Minha Lista' // Object.is equality

[Survived] LogicalOperator
features/import/services/importValidationService.ts:332:23
   if (isMetadataRow && getField(firstRow, "Position").value === null) {
     // First row is metadata
     listName = getField(firstRow, "Name").value || "Imported List";
-    listDescription = getField(firstRow, "Description").value || "";
+    listDescription = getField(firstRow, "Description").value && "";
     dataStartIndex = 1;
   } else {

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:332:23
   if (isMetadataRow && getField(firstRow, "Position").value === null) {
     // First row is metadata
     listName = getField(firstRow, "Name").value || "Imported List";
-    listDescription = getField(firstRow, "Description").value || "";
+    listDescription = false;
     dataStartIndex = 1;
   } else {

[Killed] BlockStatement
features/import/services/importValidationService.ts:334:10
     listName = getField(firstRow, "Name").value || "Imported List";
     listDescription = getField(firstRow, "Description").value || "";
     dataStartIndex = 1;
-  } else {
-    // No metadata, use default
-    listName = "Imported List";
-    dataStartIndex = 0;
-  }
+  } else {}
 
   // Parse movie rows
killedBy: importValidationService Letterboxd format compatibility should handle Letterboxd list export format with metadata
statusReason: expected '' to be truthy

[Killed] StringLiteral
features/import/services/importValidationService.ts:336:16
     dataStartIndex = 1;
   } else {
     // No metadata, use default
-    listName = "Imported List";
+    listName = "";
     dataStartIndex = 0;
   }
killedBy: importValidationService Letterboxd format compatibility should handle Letterboxd list export format with metadata
statusReason: expected '' to be truthy

[Killed] MethodExpression
features/import/services/importValidationService.ts:341:35
   }
 
   // Parse movie rows
-  const movies: ListMovieData[] = rows
-    .slice(dataStartIndex)
+  const movies: ListMovieData[] = rows
     .flatMap((row) => {
       const { value: position } = getNumericField(row, "Position");
killedBy: importValidationService parseImportCsvContent should fallback to Date/Tags columns for list position/year
statusReason: expected [ { position: 1, …(5) }, …(1) ] to have a length of 1 but got 2

[Survived] StringLiteral
features/import/services/importValidationService.ts:344:56
   const movies: ListMovieData[] = rows
     .slice(dataStartIndex)
     .flatMap((row) => {
-      const { value: position } = getNumericField(row, "Position");
+      const { value: position } = getNumericField(row, "");
       const { value: name } = getField(row, "Name", { required: true });
       const { value: year } = getNumericField(row, "Year", {

[Survived] BooleanLiteral
features/import/services/importValidationService.ts:345:65
     .slice(dataStartIndex)
     .flatMap((row) => {
       const { value: position } = getNumericField(row, "Position");
-      const { value: name } = getField(row, "Name", { required: true });
+      const { value: name } = getField(row, "Name", { required: false });
       const { value: year } = getNumericField(row, "Year", {
         required: true,

[Survived] ObjectLiteral
features/import/services/importValidationService.ts:346:60
     .flatMap((row) => {
       const { value: position } = getNumericField(row, "Position");
       const { value: name } = getField(row, "Name", { required: true });
-      const { value: year } = getNumericField(row, "Year", {
-        required: true,
-        min: 1800,
-        max: 2100,
-      });
+      const { value: year } = getNumericField(row, "Year", {});
 
       // Letterboxd list exports sometimes get parsed with metadata headers (Date, Name, Tags, URL, Description).

[Killed] LogicalOperator
features/import/services/importValidationService.ts:360:32
         max: 2100,
       });
 
-      const resolvedPosition = position ?? dateAsPosition ?? 0;
+      const resolvedPosition = position && dateAsPosition ?? 0;
       const resolvedYear = year ?? tagsAsYear;
 
killedBy: importValidationService parseImportCsvContent should fallback to Date/Tags columns for list position/year
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
features/import/services/importValidationService.ts:360:32
         max: 2100,
       });
 
-      const resolvedPosition = position ?? dateAsPosition ?? 0;
+      const resolvedPosition = (position ?? dateAsPosition) && 0;
       const resolvedYear = year ?? tagsAsYear;
 
killedBy: importValidationService parseImportCsvContent should fallback to Date/Tags columns for list position/year
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
features/import/services/importValidationService.ts:361:28
       });
 
       const resolvedPosition = position ?? dateAsPosition ?? 0;
-      const resolvedYear = year ?? tagsAsYear;
+      const resolvedYear = year && tagsAsYear;
 
       // Skip embedded movie header row (e.g. Date=Position, Name=Name, Tags=Year)
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
features/import/services/importValidationService.ts:364:26
       const resolvedYear = year ?? tagsAsYear;
 
       // Skip embedded movie header row (e.g. Date=Position, Name=Name, Tags=Year)
-      const dateToken = (getField(row, "Date").value || "").toLowerCase();
+      const dateToken = (getField(row, "Date").value && "").toLowerCase();
       const nameToken = (name || "").toLowerCase();
       if (dateToken === "position" && nameToken === "name") {
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: Cannot read properties of null (reading 'toLowerCase')

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:364:26
       const resolvedYear = year ?? tagsAsYear;
 
       // Skip embedded movie header row (e.g. Date=Position, Name=Name, Tags=Year)
-      const dateToken = (getField(row, "Date").value || "").toLowerCase();
+      const dateToken = (false).toLowerCase();
       const nameToken = (name || "").toLowerCase();
       if (dateToken === "position" && nameToken === "name") {
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:365:26
 
       // Skip embedded movie header row (e.g. Date=Position, Name=Name, Tags=Year)
       const dateToken = (getField(row, "Date").value || "").toLowerCase();
-      const nameToken = (name || "").toLowerCase();
+      const nameToken = (true).toLowerCase();
       if (dateToken === "position" && nameToken === "name") {
         return [];
killedBy: importValidationService parseImportCsvContent should parse list CSV with movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function
