[Survived] EqualityOperator
features/import/services/importValidationService.ts:550:26
     }
 
     list.movies.forEach((movie, movieIdx) => {
-      if (!movie.name || movie.name.trim().length === 0) {
+      if (!movie.name || movie.name.trim().length !== 0) {
         issues.push({
           severity: IssueSeverity.WARNING,

[Survived] LogicalOperator
features/import/services/importValidationService.ts:550:11
     }
 
     list.movies.forEach((movie, movieIdx) => {
-      if (!movie.name || movie.name.trim().length === 0) {
+      if (!movie.name && movie.name.trim().length === 0) {
         issues.push({
           severity: IssueSeverity.WARNING,

[Survived] StringLiteral
features/import/services/importValidationService.ts:553:20
       if (!movie.name || movie.name.trim().length === 0) {
         issues.push({
           severity: IssueSeverity.WARNING,
-          section: "lists",
+          section: "",
           message: `List "${list.name}" movie ${movieIdx + 1}: Missing name`,
         });

[Survived] ArithmeticOperator
features/import/services/importValidationService.ts:554:49
         issues.push({
           severity: IssueSeverity.WARNING,
           section: "lists",
-          message: `List "${list.name}" movie ${movieIdx + 1}: Missing name`,
+          message: `List "${list.name}" movie ${movieIdx - 1}: Missing name`,
         });
       }

[Survived] StringLiteral
features/import/services/importValidationService.ts:554:20
         issues.push({
           severity: IssueSeverity.WARNING,
           section: "lists",
-          message: `List "${list.name}" movie ${movieIdx + 1}: Missing name`,
+          message: ``,
         });
       }

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:558:11
         });
       }
 
-      if (movie.year < 1800 || movie.year > 2100) {
+      if (false) {
         issues.push({
           severity: IssueSeverity.WARNING,

[Survived] ConditionalExpression
features/import/services/importValidationService.ts:558:11
         });
       }
 
-      if (movie.year < 1800 || movie.year > 2100) {
+      if (false || movie.year > 2100) {
         issues.push({
           severity: IssueSeverity.WARNING,

[Survived] ArithmeticOperator
features/import/services/importValidationService.ts:562:49
         issues.push({
           severity: IssueSeverity.WARNING,
           section: "lists",
-          message: `List "${list.name}" movie ${movieIdx + 1}: Invalid year`,
+          message: `List "${list.name}" movie ${movieIdx - 1}: Invalid year`,
         });
       }

[Survived] StringLiteral
features/import/services/importValidationService.ts:562:20
         issues.push({
           severity: IssueSeverity.WARNING,
           section: "lists",
-          message: `List "${list.name}" movie ${movieIdx + 1}: Invalid year`,
+          message: ``,
         });
       }

[Killed] EqualityOperator
features/import/services/importValidationService.ts:574:7
 async function validateTmdbMatching(
   movies: Array<{ title: string; year: number }>
 ): Promise<ValidationIssue[]> {
-  if (movies.length === 0) return [];
+  if (movies.length !== 0) return [];
 
   const issues: ValidationIssue[] = [];
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match returns failed movies
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:574:7
 async function validateTmdbMatching(
   movies: Array<{ title: string; year: number }>
 ): Promise<ValidationIssue[]> {
-  if (movies.length === 0) return [];
+  if (true) return [];
 
   const issues: ValidationIssue[] = [];
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match returns failed movies
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
features/import/services/importValidationService.ts:578:7
 
   const issues: ValidationIssue[] = [];
 
-  try {
-    const matchResult = await batchMatchMovies({
-      movies,
-      batchSize: 50,
-    });
-
-    // Log unmatched movies as warnings
-    if (matchResult.failed > 0) {
-      issues.push({
-        severity: IssueSeverity.WARNING,
-        section: "ratings",
-        message: `${matchResult.failed} movies could not be matched in TMDB. They will be skipped during import.`,
-        details: {
-          unmatchedCount: matchResult.failed,
-          cacheHits: matchResult.cacheHits,
-        },
-      });
-    }
-  } catch (error) {
+  try {} catch (error) {
     issues.push({
       severity: IssueSeverity.WARNING,
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match returns failed movies
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
features/import/services/importValidationService.ts:585:9
     });
 
     // Log unmatched movies as warnings
-    if (matchResult.failed > 0) {
+    if (matchResult.failed <= 0) {
       issues.push({
         severity: IssueSeverity.WARNING,
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match returns failed movies
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
features/import/services/importValidationService.ts:585:9
     });
 
     // Log unmatched movies as warnings
-    if (matchResult.failed > 0) {
+    if (false) {
       issues.push({
         severity: IssueSeverity.WARNING,
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match returns failed movies
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
features/import/services/importValidationService.ts:588:18
     if (matchResult.failed > 0) {
       issues.push({
         severity: IssueSeverity.WARNING,
-        section: "ratings",
+        section: "",
         message: `${matchResult.failed} movies could not be matched in TMDB. They will be skipped during import.`,
         details: {

[Survived] ObjectLiteral
features/import/services/importValidationService.ts:590:18
         severity: IssueSeverity.WARNING,
         section: "ratings",
         message: `${matchResult.failed} movies could not be matched in TMDB. They will be skipped during import.`,
-        details: {
-          unmatchedCount: matchResult.failed,
-          cacheHits: matchResult.cacheHits,
-        },
+        details: {},
       });
     }

[Killed] BlockStatement
features/import/services/importValidationService.ts:596:19
         },
       });
     }
-  } catch (error) {
-    issues.push({
-      severity: IssueSeverity.WARNING,
-      section: "ratings",
-      message: `TMDB matching failed: ${String(error)}. Movies will be matched individually during import.`,
-    });
-  }
+  } catch (error) {}
 
   return issues;
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match throws
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
features/import/services/importValidationService.ts:597:17
       });
     }
   } catch (error) {
-    issues.push({
-      severity: IssueSeverity.WARNING,
-      section: "ratings",
-      message: `TMDB matching failed: ${String(error)}. Movies will be matched individually during import.`,
-    });
+    issues.push({});
   }
 
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match throws
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
features/import/services/importValidationService.ts:600:16
     issues.push({
       severity: IssueSeverity.WARNING,
       section: "ratings",
-      message: `TMDB matching failed: ${String(error)}. Movies will be matched individually during import.`,
+      message: ``,
     });
   }
killedBy: importValidationService validateImportFiles should add TMDB warning when batch match throws
statusReason: expected false to be true // Object.is equality
