[Survived] BooleanLiteral
features/import/utils/csvParser.ts:26:27
   content: string,
   options: CsvParseOptions = {}
 ): CsvParseResult<Record<string, string>> {
-  const { skipEmptyRows = true } = options;
+  const { skipEmptyRows = false } = options;
 
   const lines = splitCsvRows(content).map((line) => line.replace(/\r$/, ""));

[Killed] ArrowFunction
features/import/utils/csvParser.ts:28:43
 ): CsvParseResult<Record<string, string>> {
   const { skipEmptyRows = true } = options;
 
-  const lines = splitCsvRows(content).map((line) => line.replace(/\r$/, ""));
+  const lines = splitCsvRows(content).map(() => undefined);
   const errors: string[] = [];
 
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] Regex
features/import/utils/csvParser.ts:28:66
 ): CsvParseResult<Record<string, string>> {
   const { skipEmptyRows = true } = options;
 
-  const lines = splitCsvRows(content).map((line) => line.replace(/\r$/, ""));
+  const lines = splitCsvRows(content).map((line) => line.replace(/\r/, ""));
   const errors: string[] = [];
 

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:31:7
   const lines = splitCsvRows(content).map((line) => line.replace(/\r$/, ""));
   const errors: string[] = [];
 
-  if (lines.length === 0) {
+  if (true) {
     return { headers: [], rows: [], errors: ["CSV file is empty"] };
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: CSV file is empty

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:39:19
   let headerLineIndex = 0;
   let headers: string[] = [];
 
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; false; i++) {
     const line = lines[i].trim();
     if (!line || line.startsWith("Letterboxd")) continue;
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: No valid header row found in CSV

[Killed] EqualityOperator
features/import/utils/csvParser.ts:39:19
   let headerLineIndex = 0;
   let headers: string[] = [];
 
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; i >= lines.length; i++) {
     const line = lines[i].trim();
     if (!line || line.startsWith("Letterboxd")) continue;
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: No valid header row found in CSV

[Survived] MethodExpression
features/import/utils/csvParser.ts:40:18
   let headers: string[] = [];
 
   for (let i = 0; i < lines.length; i++) {
-    const line = lines[i].trim();
+    const line = lines[i];
     if (!line || line.startsWith("Letterboxd")) continue;
 

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:41:9
 
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i].trim();
-    if (!line || line.startsWith("Letterboxd")) continue;
+    if (line || line.startsWith("Letterboxd")) continue;
 
     headers = parseCSVLine(line);
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: No valid header row found in CSV

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:41:9
 
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i].trim();
-    if (!line || line.startsWith("Letterboxd")) continue;
+    if (false) continue;
 
     headers = parseCSVLine(line);
killedBy: csvParser parseCsv should skip Letterboxd metadata rows
statusReason: expected [ 'Letterboxd list export v7' ] to deeply equal [ 'Name', 'Year', 'Rating' ]

[Killed] BlockStatement
features/import/utils/csvParser.ts:44:29
     if (!line || line.startsWith("Letterboxd")) continue;
 
     headers = parseCSVLine(line);
-    if (headers.length > 0) {
-      headerLineIndex = i;
-      break;
-    }
+    if (headers.length > 0) {}
   }
 
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [ 'The Matrix', '1999', '5' ] to deeply equal [ 'Name', 'Year', 'Rating' ]

[Killed] EqualityOperator
features/import/utils/csvParser.ts:44:9
     if (!line || line.startsWith("Letterboxd")) continue;
 
     headers = parseCSVLine(line);
-    if (headers.length > 0) {
+    if (headers.length <= 0) {
       headerLineIndex = i;
       break;
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [ 'The Matrix', '1999', '5' ] to deeply equal [ 'Name', 'Year', 'Rating' ]

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:50:7
     }
   }
 
-  if (headers.length === 0) {
+  if (true) {
     return { headers: [], rows: [], errors: ["No valid header row found in CSV"] };
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: No valid header row found in CSV

[Killed] EqualityOperator
features/import/utils/csvParser.ts:50:7
     }
   }
 
-  if (headers.length === 0) {
+  if (headers.length !== 0) {
     return { headers: [], rows: [], errors: ["No valid header row found in CSV"] };
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: No valid header row found in CSV

[NoCoverage] ArrayDeclaration
features/import/utils/csvParser.ts:51:45
   }
 
   if (headers.length === 0) {
-    return { headers: [], rows: [], errors: ["No valid header row found in CSV"] };
+    return { headers: [], rows: [], errors: [] };
   }
 

[Killed] ArrayDeclaration
features/import/utils/csvParser.ts:55:42
   }
 
   // Parse data rows
-  const rows: Record<string, string>[] = [];
+  const rows: Record<string, string>[] = ["Stryker was here"];
 
   for (let i = headerLineIndex + 1; i < lines.length; i++) {
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] UpdateOperator
features/import/utils/csvParser.ts:57:55
   // Parse data rows
   const rows: Record<string, string>[] = [];
 
-  for (let i = headerLineIndex + 1; i < lines.length; i++) {
+  for (let i = headerLineIndex + 1; i < lines.length; i--) {
     const line = lines[i];
 
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ArithmeticOperator
features/import/utils/csvParser.ts:57:16
   // Parse data rows
   const rows: Record<string, string>[] = [];
 
-  for (let i = headerLineIndex + 1; i < lines.length; i++) {
+  for (let i = headerLineIndex - 1; i < lines.length; i++) {
     const line = lines[i];
 
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:61:9
     const line = lines[i];
 
     // Skip empty rows if option is set
-    if (skipEmptyRows && !line.trim()) continue;
+    if (true) continue;
 
     const values = parseCSVLine(line);
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] LogicalOperator
features/import/utils/csvParser.ts:61:9
     const line = lines[i];
 
     // Skip empty rows if option is set
-    if (skipEmptyRows && !line.trim()) continue;
+    if (skipEmptyRows || !line.trim()) continue;
 
     const values = parseCSVLine(line);
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:66:9
     const values = parseCSVLine(line);
 
     // Handle row with fewer columns than headers
-    if (values.length === 0 && !line.trim()) continue;
+    if (true) continue;
 
     if (values.length > 0) {
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [] to have a length of 1 but got +0

[NoCoverage] MethodExpression
features/import/utils/csvParser.ts:66:33
     const values = parseCSVLine(line);
 
     // Handle row with fewer columns than headers
-    if (values.length === 0 && !line.trim()) continue;
+    if (values.length === 0 && !line) continue;
 
     if (values.length > 0) {

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:68:9
     // Handle row with fewer columns than headers
     if (values.length === 0 && !line.trim()) continue;
 
-    if (values.length > 0) {
+    if (false) {
       const row: Record<string, string> = {};
 
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: CSV parsing errors: Line 2: Could not parse row

[Killed] EqualityOperator
features/import/utils/csvParser.ts:68:9
     // Handle row with fewer columns than headers
     if (values.length === 0 && !line.trim()) continue;
 
-    if (values.length > 0) {
+    if (values.length <= 0) {
       const row: Record<string, string> = {};
 
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
features/import/utils/csvParser.ts:71:42
     if (values.length > 0) {
       const row: Record<string, string> = {};
 
-      headers.forEach((header, index) => {
-        let value = values[index] || "";
-        value = value.trim();
-        row[header] = value;
-      });
+      headers.forEach((header, index) => {});
 
       rows.push(row);
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] LogicalOperator
features/import/utils/csvParser.ts:72:21
       const row: Record<string, string> = {};
 
       headers.forEach((header, index) => {
-        let value = values[index] || "";
+        let value = values[index] && "";
         value = value.trim();
         row[header] = value;
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:72:21
       const row: Record<string, string> = {};
 
       headers.forEach((header, index) => {
-        let value = values[index] || "";
+        let value = false;
         value = value.trim();
         row[header] = value;
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: value.trim is not a function

[Survived] MethodExpression
features/import/utils/csvParser.ts:73:17
 
       headers.forEach((header, index) => {
         let value = values[index] || "";
-        value = value.trim();
+        value = value;
         row[header] = value;
       });

[NoCoverage] ConditionalExpression
features/import/utils/csvParser.ts:78:16
       });
 
       rows.push(row);
-    } else if (line.trim()) {
+    } else if (false) {
       errors.push(`Line ${i + 1}: Could not parse row`);
     }

[NoCoverage] ConditionalExpression
features/import/utils/csvParser.ts:78:16
       });
 
       rows.push(row);
-    } else if (line.trim()) {
+    } else if (true) {
       errors.push(`Line ${i + 1}: Could not parse row`);
     }

[NoCoverage] ArithmeticOperator
features/import/utils/csvParser.ts:79:27
 
       rows.push(row);
     } else if (line.trim()) {
-      errors.push(`Line ${i + 1}: Could not parse row`);
+      errors.push(`Line ${i - 1}: Could not parse row`);
     }
   }

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:89:18
 function splitCsvRows(content: string): string[] {
   const rows: string[] = [];
   let current = "";
-  let inQuotes = false;
+  let inQuotes = true;
 
   for (let i = 0; i < content.length; i++) {
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] EqualityOperator
features/import/utils/csvParser.ts:91:19
   let current = "";
   let inQuotes = false;
 
-  for (let i = 0; i < content.length; i++) {
+  for (let i = 0; i <= content.length; i++) {
     const char = content[i];
     const nextChar = content[i + 1];
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: expected 'Johnundefined' to be 'John' // Object.is equality

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:91:19
   let current = "";
   let inQuotes = false;
 
-  for (let i = 0; i < content.length; i++) {
+  for (let i = 0; false; i++) {
     const char = content[i];
     const nextChar = content[i + 1];
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [] to deeply equal [ 'Name', 'Year', 'Rating' ]

[Survived] ArithmeticOperator
features/import/utils/csvParser.ts:93:30
 
   for (let i = 0; i < content.length; i++) {
     const char = content[i];
-    const nextChar = content[i + 1];
+    const nextChar = content[i - 1];
 
     if (char === '"') {

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:95:9
     const char = content[i];
     const nextChar = content[i + 1];
 
-    if (char === '"') {
+    if (true) {
       current += char;
 
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] AssignmentOperator
features/import/utils/csvParser.ts:96:7
     const nextChar = content[i + 1];
 
     if (char === '"') {
-      current += char;
+      current -= char;
 
       if (inQuotes && nextChar === '"') {
killedBy: importValidationService parseImportCsvContent should parse ratings CSV
statusReason: expected 'NaN' to be 'The Matrix' // Object.is equality

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:98:11
     if (char === '"') {
       current += char;
 
-      if (inQuotes && nextChar === '"') {
+      if (true) {
         current += nextChar;
         i++;
killedBy: csvParser parseCsv should handle quoted fields with commas
statusReason: expected { Name: 'The Matrix, Part 1', …(1) } to deeply equal { Name: 'The Matrix, Part 1', …(1) }

[Killed] EqualityOperator
features/import/utils/csvParser.ts:98:23
     if (char === '"') {
       current += char;
 
-      if (inQuotes && nextChar === '"') {
+      if (inQuotes && nextChar !== '"') {
         current += nextChar;
         i++;
killedBy: importValidationService parseImportCsvContent should parse ratings CSV
statusReason: expected [ { …(5) } ] to have a length of 2 but got 1

[Killed] AssignmentOperator
features/import/utils/csvParser.ts:99:9
       current += char;
 
       if (inQuotes && nextChar === '"') {
-        current += nextChar;
+        current -= nextChar;
         i++;
       } else {
killedBy: csvParser parseCsv should handle escaped quotes in fields
statusReason: expected '' to contain 'great'

[Timeout] UpdateOperator
features/import/utils/csvParser.ts:100:9
 
       if (inQuotes && nextChar === '"') {
         current += nextChar;
-        i++;
+        i--;
       } else {
         inQuotes = !inQuotes;

[Killed] BlockStatement
features/import/utils/csvParser.ts:101:14
       if (inQuotes && nextChar === '"') {
         current += nextChar;
         i++;
-      } else {
-        inQuotes = !inQuotes;
-      }
+      } else {}
 
       continue;
killedBy: csvParser parseCsv should preserve multiline review fields
statusReason: expected [ { Name: 'Inception', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:102:20
         current += nextChar;
         i++;
       } else {
-        inQuotes = !inQuotes;
+        inQuotes = inQuotes;
       }
 
killedBy: csvParser parseCsv should preserve multiline review fields
statusReason: expected [ { Name: 'Inception', …(2) }, …(1) ] to have a length of 1 but got 2

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:108:45
       continue;
     }
 
-    if ((char === "\n" || char === "\r") && !inQuotes) {
+    if ((char === "\n" || char === "\r") && inQuotes) {
       if (char === "\r" && nextChar === "\n") {
         i++;
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [ 'Name', 'Year', …(3) ] to deeply equal [ 'Name', 'Year', 'Rating' ]

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:108:9
       continue;
     }
 
-    if ((char === "\n" || char === "\r") && !inQuotes) {
+    if (false) {
       if (char === "\r" && nextChar === "\n") {
         i++;
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:109:11
     }
 
     if ((char === "\n" || char === "\r") && !inQuotes) {
-      if (char === "\r" && nextChar === "\n") {
+      if (true) {
         i++;
       }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: expected 'estuser' to be 'testuser' // Object.is equality

[NoCoverage] BlockStatement
features/import/utils/csvParser.ts:109:47
     }
 
     if ((char === "\n" || char === "\r") && !inQuotes) {
-      if (char === "\r" && nextChar === "\n") {
-        i++;
-      }
+      if (char === "\r" && nextChar === "\n") {}
 
       rows.push(current);

[NoCoverage] UpdateOperator
features/import/utils/csvParser.ts:110:9
 
     if ((char === "\n" || char === "\r") && !inQuotes) {
       if (char === "\r" && nextChar === "\n") {
-        i++;
+        i--;
       }
 

[Killed] StringLiteral
features/import/utils/csvParser.ts:114:17
       }
 
       rows.push(current);
-      current = "";
+      current = "Stryker was here!";
       continue;
     }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: expected 'Stryker was here!testuser' to be 'testuser' // Object.is equality

[Killed] AssignmentOperator
features/import/utils/csvParser.ts:118:5
       continue;
     }
 
-    current += char;
+    current -= char;
   }
 
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: line.replace is not a function

[Killed] LogicalOperator
features/import/utils/csvParser.ts:121:7
     current += char;
   }
 
-  if (current.length > 0 || content.endsWith("\n") || content.endsWith("\r")) {
+  if (current.length > 0 && content.endsWith("\n") || content.endsWith("\r")) {
     rows.push(current);
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] LogicalOperator
features/import/utils/csvParser.ts:121:7
     current += char;
   }
 
-  if (current.length > 0 || content.endsWith("\n") || content.endsWith("\r")) {
+  if ((current.length > 0 || content.endsWith("\n")) && content.endsWith("\r")) {
     rows.push(current);
   }
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Cannot read properties of null (reading 'username')

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:138:19
   let current = "";
   let inQuotes = false;
 
-  for (let i = 0; i < line.length; i++) {
+  for (let i = 0; false; i++) {
     const char = line[i];
     const nextChar = line[i + 1];
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] EqualityOperator
features/import/utils/csvParser.ts:138:19
   let current = "";
   let inQuotes = false;
 
-  for (let i = 0; i < line.length; i++) {
+  for (let i = 0; i >= line.length; i++) {
     const char = line[i];
     const nextChar = line[i + 1];
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Survived] ArithmeticOperator
features/import/utils/csvParser.ts:140:27
 
   for (let i = 0; i < line.length; i++) {
     const char = line[i];
-    const nextChar = line[i + 1];
+    const nextChar = line[i - 1];
 
     if (char === '"') {

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:143:23
     const nextChar = line[i + 1];
 
     if (char === '"') {
-      if (inQuotes && nextChar === '"') {
+      if (inQuotes && true) {
         // Escaped quote
         current += '"';
killedBy: importValidationService parseImportCsvContent should parse ratings CSV
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
features/import/utils/csvParser.ts:143:11
     const nextChar = line[i + 1];
 
     if (char === '"') {
-      if (inQuotes && nextChar === '"') {
+      if (inQuotes || nextChar === '"') {
         // Escaped quote
         current += '"';
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected { Name: 'The Matrix"1999,5', …(2) } to deeply equal { Name: 'The Matrix', …(2) }

[Survived] StringLiteral
features/import/utils/csvParser.ts:145:20
     if (char === '"') {
       if (inQuotes && nextChar === '"') {
         // Escaped quote
-        current += '"';
+        current += "";
         i++; // Skip next quote
       } else {

[Timeout] UpdateOperator
features/import/utils/csvParser.ts:146:9
       if (inQuotes && nextChar === '"') {
         // Escaped quote
         current += '"';
-        i++; // Skip next quote
+        i--; // Skip next quote
       } else {
         // Toggle quote state

[Killed] BlockStatement
features/import/utils/csvParser.ts:147:14
         // Escaped quote
         current += '"';
         i++; // Skip next quote
-      } else {
-        // Toggle quote state
-        inQuotes = !inQuotes;
-      }
+      } else {}
     } else if (char === "," && !inQuotes) {
       // Field separator (outside quotes)
killedBy: importValidationService Letterboxd format compatibility should handle quoted fields in Letterboxd CSV
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:149:20
         i++; // Skip next quote
       } else {
         // Toggle quote state
-        inQuotes = !inQuotes;
+        inQuotes = inQuotes;
       }
     } else if (char === "," && !inQuotes) {
killedBy: importValidationService Letterboxd format compatibility should handle quoted fields in Letterboxd CSV
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:151:32
         // Toggle quote state
         inQuotes = !inQuotes;
       }
-    } else if (char === "," && !inQuotes) {
+    } else if (char === "," && inQuotes) {
       // Field separator (outside quotes)
       result.push(current);
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: expected [ 'Name,Year,Rating' ] to deeply equal [ 'Name', 'Year', 'Rating' ]

[Killed] LogicalOperator
features/import/utils/csvParser.ts:151:16
         // Toggle quote state
         inQuotes = !inQuotes;
       }
-    } else if (char === "," && !inQuotes) {
+    } else if (char === "," || !inQuotes) {
       // Field separator (outside quotes)
       result.push(current);
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] BlockStatement
features/import/utils/csvParser.ts:155:12
       // Field separator (outside quotes)
       result.push(current);
       current = "";
-    } else {
-      current += char;
-    }
+    } else {}
   }
 
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] AssignmentOperator
features/import/utils/csvParser.ts:156:7
       result.push(current);
       current = "";
     } else {
-      current += char;
+      current -= char;
     }
   }
killedBy: csvParser parseCsv should parse simple CSV with headers
statusReason: field.trim is not a function

[Killed] ArrowFunction
features/import/utils/csvParser.ts:163:21
   // Add last field
   result.push(current);
 
-  return result.map((field) => field.trim());
+  return result.map(() => undefined);
 }
 
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Survived] MethodExpression
features/import/utils/csvParser.ts:163:32
   // Add last field
   result.push(current);
 
-  return result.map((field) => field.trim());
+  return result.map((field) => field);
 }
 

[Killed] BlockStatement
features/import/utils/csvParser.ts:177:3
   valid: boolean;
   missing: string[];
   extra: string[];
-} {
-  const actualLC = actual.map((h) => h.toLowerCase());
-  const expectedLC = expected.map((h) => h.toLowerCase());
-
-  const missing = expectedLC.filter((h) => !actualLC.includes(h)).map((h) => {
-    // Find original case from expected
-    const idx = expectedLC.indexOf(h);
-    return expected[idx];
-  });
-
-  const extra = actual.filter((h) => !expectedLC.includes(h.toLowerCase()));
-
-  return {
-    valid: missing.length === 0,
-    missing,
-    extra,
-  };
-}
+} {}
 
 /**
killedBy: csvParser validateHeaders should validate matching headers
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] ArrowFunction
features/import/utils/csvParser.ts:178:31
   missing: string[];
   extra: string[];
 } {
-  const actualLC = actual.map((h) => h.toLowerCase());
+  const actualLC = actual.map(() => undefined);
   const expectedLC = expected.map((h) => h.toLowerCase());
 
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
features/import/utils/csvParser.ts:178:38
   missing: string[];
   extra: string[];
 } {
-  const actualLC = actual.map((h) => h.toLowerCase());
+  const actualLC = actual.map((h) => h.toUpperCase());
   const expectedLC = expected.map((h) => h.toLowerCase());
 
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
features/import/utils/csvParser.ts:179:35
   extra: string[];
 } {
   const actualLC = actual.map((h) => h.toLowerCase());
-  const expectedLC = expected.map((h) => h.toLowerCase());
+  const expectedLC = expected.map(() => undefined);
 
   const missing = expectedLC.filter((h) => !actualLC.includes(h)).map((h) => {
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
features/import/utils/csvParser.ts:179:42
   extra: string[];
 } {
   const actualLC = actual.map((h) => h.toLowerCase());
-  const expectedLC = expected.map((h) => h.toLowerCase());
+  const expectedLC = expected.map((h) => h.toUpperCase());
 
   const missing = expectedLC.filter((h) => !actualLC.includes(h)).map((h) => {
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
features/import/utils/csvParser.ts:181:37
   const actualLC = actual.map((h) => h.toLowerCase());
   const expectedLC = expected.map((h) => h.toLowerCase());
 
-  const missing = expectedLC.filter((h) => !actualLC.includes(h)).map((h) => {
+  const missing = expectedLC.filter(() => undefined).map((h) => {
     // Find original case from expected
     const idx = expectedLC.indexOf(h);
killedBy: csvParser validateHeaders should detect missing headers
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
features/import/utils/csvParser.ts:181:78
   const actualLC = actual.map((h) => h.toLowerCase());
   const expectedLC = expected.map((h) => h.toLowerCase());
 
-  const missing = expectedLC.filter((h) => !actualLC.includes(h)).map((h) => {
-    // Find original case from expected
-    const idx = expectedLC.indexOf(h);
-    return expected[idx];
-  });
+  const missing = expectedLC.filter((h) => !actualLC.includes(h)).map((h) => {});
 
   const extra = actual.filter((h) => !expectedLC.includes(h.toLowerCase()));
killedBy: csvParser validateHeaders should detect missing headers
statusReason: expected [ undefined ] to include 'Rating'

[Killed] MethodExpression
features/import/utils/csvParser.ts:187:59
     return expected[idx];
   });
 
-  const extra = actual.filter((h) => !expectedLC.includes(h.toLowerCase()));
+  const extra = actual.filter((h) => !expectedLC.includes(h.toUpperCase()));
 
   return {
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected [ 'Name', 'Year', 'Rating' ] to have a length of +0 but got 3

[Killed] MethodExpression
features/import/utils/csvParser.ts:187:17
     return expected[idx];
   });
 
-  const extra = actual.filter((h) => !expectedLC.includes(h.toLowerCase()));
+  const extra = actual;
 
   return {
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected [ 'Name', 'Year', 'Rating' ] to have a length of +0 but got 3

[Killed] EqualityOperator
features/import/utils/csvParser.ts:190:12
   const extra = actual.filter((h) => !expectedLC.includes(h.toLowerCase()));
 
   return {
-    valid: missing.length === 0,
+    valid: missing.length !== 0,
     missing,
     extra,
killedBy: csvParser validateHeaders should validate matching headers
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:190:12
   const extra = actual.filter((h) => !expectedLC.includes(h.toLowerCase()));
 
   return {
-    valid: missing.length === 0,
+    valid: true,
     missing,
     extra,
killedBy: csvParser validateHeaders should detect missing headers
statusReason: expected true to be false // Object.is equality
