[Survived] BooleanLiteral
features/import/utils/csvParser.ts:209:22
     errorMessage?: string;
   } = {}
 ): { value: string | null; error?: string } {
-  const { required = false, trim = true, validate, errorMessage } = options;
+  const { required = true, trim = true, validate, errorMessage } = options;
 
   // Try exact match first

[Survived] BooleanLiteral
features/import/utils/csvParser.ts:209:36
     errorMessage?: string;
   } = {}
 ): { value: string | null; error?: string } {
-  const { required = false, trim = true, validate, errorMessage } = options;
+  const { required = false, trim = false, validate, errorMessage } = options;
 
   // Try exact match first

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:215:7
   let value = row[fieldName];
 
   // Try case-insensitive match
-  if (!value) {
+  if (false) {
     const key = Object.keys(row).find((k) => k.toLowerCase() === fieldName.toLowerCase());
     value = key ? row[key] : "";
killedBy: csvParser getField should extract field case-insensitively
statusReason: expected null to be 'The Matrix' // Object.is equality

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:215:7
   let value = row[fieldName];
 
   // Try case-insensitive match
-  if (!value) {
+  if (value) {
     const key = Object.keys(row).find((k) => k.toLowerCase() === fieldName.toLowerCase());
     value = key ? row[key] : "";
killedBy: csvParser getField should extract field case-insensitively
statusReason: expected null to be 'The Matrix' // Object.is equality

[Killed] ArrowFunction
features/import/utils/csvParser.ts:216:39
 
   // Try case-insensitive match
   if (!value) {
-    const key = Object.keys(row).find((k) => k.toLowerCase() === fieldName.toLowerCase());
+    const key = Object.keys(row).find(() => undefined);
     value = key ? row[key] : "";
   }
killedBy: csvParser getField should extract field case-insensitively
statusReason: expected null to be 'The Matrix' // Object.is equality

[Killed] MethodExpression
features/import/utils/csvParser.ts:216:66
 
   // Try case-insensitive match
   if (!value) {
-    const key = Object.keys(row).find((k) => k.toLowerCase() === fieldName.toLowerCase());
+    const key = Object.keys(row).find((k) => k.toLowerCase() === fieldName.toUpperCase());
     value = key ? row[key] : "";
   }
killedBy: csvParser getField should extract field case-insensitively
statusReason: expected null to be 'The Matrix' // Object.is equality

[Killed] StringLiteral
features/import/utils/csvParser.ts:217:30
   // Try case-insensitive match
   if (!value) {
     const key = Object.keys(row).find((k) => k.toLowerCase() === fieldName.toLowerCase());
-    value = key ? row[key] : "";
+    value = key ? row[key] : "Stryker was here!";
   }
 
killedBy: importValidationService parseImportCsvContent should parse list metadata format and ignore embedded movie header row
statusReason: expected 'Imported List' to be 'Minha Lista' // Object.is equality

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:220:7
     value = key ? row[key] : "";
   }
 
-  if (trim && value) {
+  if (false) {
     value = value.trim();
   }
killedBy: csvParser getField should trim whitespace
statusReason: expected '  The Matrix  ' to be 'The Matrix' // Object.is equality

[Killed] BlockStatement
features/import/utils/csvParser.ts:220:22
     value = key ? row[key] : "";
   }
 
-  if (trim && value) {
-    value = value.trim();
-  }
+  if (trim && value) {}
 
   if (!value) {
killedBy: csvParser getField should trim whitespace
statusReason: expected '  The Matrix  ' to be 'The Matrix' // Object.is equality

[Killed] MethodExpression
features/import/utils/csvParser.ts:221:13
   }
 
   if (trim && value) {
-    value = value.trim();
+    value = value;
   }
 
killedBy: csvParser getField should trim whitespace
statusReason: expected '  The Matrix  ' to be 'The Matrix' // Object.is equality

[Killed] BlockStatement
features/import/utils/csvParser.ts:224:15
     value = value.trim();
   }
 
-  if (!value) {
-    if (required) {
-      return {
-        value: null,
-        error: errorMessage || `Required field missing: ${fieldName}`,
-      };
-    }
-    return { value: null };
-  }
+  if (!value) {}
 
   if (validate && !validate(value)) {
killedBy: csvParser getField should return null for missing field
statusReason: expected '' to be null

[Killed] BlockStatement
features/import/utils/csvParser.ts:225:19
   }
 
   if (!value) {
-    if (required) {
-      return {
-        value: null,
-        error: errorMessage || `Required field missing: ${fieldName}`,
-      };
-    }
+    if (required) {}
     return { value: null };
   }
killedBy: csvParser getField should error on required missing field
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:225:9
   }
 
   if (!value) {
-    if (required) {
+    if (false) {
       return {
         value: null,
killedBy: csvParser getField should error on required missing field
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:228:16
     if (required) {
       return {
         value: null,
-        error: errorMessage || `Required field missing: ${fieldName}`,
+        error: false,
       };
     }
killedBy: csvParser getField should error on required missing field
statusReason: expected [] to include 'Required'

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:228:16
     if (required) {
       return {
         value: null,
-        error: errorMessage || `Required field missing: ${fieldName}`,
+        error: true,
       };
     }
killedBy: csvParser getField should error on required missing field
statusReason: expected [] to include 'Required'

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:234:7
     return { value: null };
   }
 
-  if (validate && !validate(value)) {
+  if (true) {
     return {
       value: null,
killedBy: importValidationService parseImportCsvContent should parse profile CSV
statusReason: Profile: Missing username

[Killed] BlockStatement
features/import/utils/csvParser.ts:234:37
     return { value: null };
   }
 
-  if (validate && !validate(value)) {
-    return {
-      value: null,
-      error: errorMessage || `Invalid value for ${fieldName}: ${value}`,
-    };
-  }
+  if (validate && !validate(value)) {}
 
   return { value };
killedBy: csvParser getField should validate with custom function
statusReason: expected undefined to be defined

[Killed] LogicalOperator
features/import/utils/csvParser.ts:237:14
   if (validate && !validate(value)) {
     return {
       value: null,
-      error: errorMessage || `Invalid value for ${fieldName}: ${value}`,
+      error: errorMessage && `Invalid value for ${fieldName}: ${value}`,
     };
   }
killedBy: csvParser getField should validate with custom function
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
features/import/utils/csvParser.ts:237:14
   if (validate && !validate(value)) {
     return {
       value: null,
-      error: errorMessage || `Invalid value for ${fieldName}: ${value}`,
+      error: false,
     };
   }

[Survived] BooleanLiteral
features/import/utils/csvParser.ts:257:22
     errorMessage?: string;
   } = {}
 ): { value: number | null; error?: string } {
-  const { required = false, min, max, errorMessage } = options;
+  const { required = true, min, max, errorMessage } = options;
 
   const { value, error } = getField(row, fieldName, { required, trim: true });

[Survived] BooleanLiteral
features/import/utils/csvParser.ts:259:71
 ): { value: number | null; error?: string } {
   const { required = false, min, max, errorMessage } = options;
 
-  const { value, error } = getField(row, fieldName, { required, trim: true });
+  const { value, error } = getField(row, fieldName, { required, trim: false });
 
   if (error) return { value: null, error };

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:261:7
 
   const { value, error } = getField(row, fieldName, { required, trim: true });
 
-  if (error) return { value: null, error };
+  if (true) return { value: null, error };
   if (!value && !required) return { value: null };
 
killedBy: csvParser getNumericField should extract numeric field
statusReason: expected null to be 5 // Object.is equality

[Survived] ConditionalExpression
features/import/utils/csvParser.ts:261:7
 
   const { value, error } = getField(row, fieldName, { required, trim: true });
 
-  if (error) return { value: null, error };
+  if (false) return { value: null, error };
   if (!value && !required) return { value: null };
 

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:262:7
   const { value, error } = getField(row, fieldName, { required, trim: true });
 
   if (error) return { value: null, error };
-  if (!value && !required) return { value: null };
+  if (value && !required) return { value: null };
 
   const num = parseFloat(value!);
killedBy: importValidationService parseImportCsvContent should parse list metadata format and ignore embedded movie header row
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
features/import/utils/csvParser.ts:262:7
   const { value, error } = getField(row, fieldName, { required, trim: true });
 
   if (error) return { value: null, error };
-  if (!value && !required) return { value: null };
+  if (!value || !required) return { value: null };
 
   const num = parseFloat(value!);
killedBy: importValidationService parseImportCsvContent should parse list metadata format and ignore embedded movie header row
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
features/import/utils/csvParser.ts:266:19
 
   const num = parseFloat(value!);
 
-  if (isNaN(num)) {
-    return {
-      value: null,
-      error: errorMessage || `Invalid number for ${fieldName}: ${value}`,
-    };
-  }
+  if (isNaN(num)) {}
 
   if (min !== undefined && num < min) {
killedBy: csvParser getNumericField should error on non-numeric value
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
features/import/utils/csvParser.ts:267:12
   const num = parseFloat(value!);
 
   if (isNaN(num)) {
-    return {
-      value: null,
-      error: errorMessage || `Invalid number for ${fieldName}: ${value}`,
-    };
+    return {};
   }
 
killedBy: csvParser getNumericField should error on non-numeric value
statusReason: expected undefined to be defined

[Killed] LogicalOperator
features/import/utils/csvParser.ts:269:14
   if (isNaN(num)) {
     return {
       value: null,
-      error: errorMessage || `Invalid number for ${fieldName}: ${value}`,
+      error: errorMessage && `Invalid number for ${fieldName}: ${value}`,
     };
   }
killedBy: csvParser getNumericField should error on non-numeric value
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
features/import/utils/csvParser.ts:269:14
   if (isNaN(num)) {
     return {
       value: null,
-      error: errorMessage || `Invalid number for ${fieldName}: ${value}`,
+      error: false,
     };
   }

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:273:7
     };
   }
 
-  if (min !== undefined && num < min) {
+  if (false) {
     return {
       value: null,
killedBy: csvParser getNumericField should error on value below minimum
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:273:28
     };
   }
 
-  if (min !== undefined && num < min) {
+  if (min !== undefined && true) {
     return {
       value: null,
killedBy: importValidationService parseImportCsvContent should parse ratings CSV
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
features/import/utils/csvParser.ts:276:14
   if (min !== undefined && num < min) {
     return {
       value: null,
-      error: errorMessage || `${fieldName} must be >= ${min}`,
+      error: errorMessage && `${fieldName} must be >= ${min}`,
     };
   }
killedBy: csvParser getNumericField should error on value below minimum
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
features/import/utils/csvParser.ts:276:14
   if (min !== undefined && num < min) {
     return {
       value: null,
-      error: errorMessage || `${fieldName} must be >= ${min}`,
+      error: true,
     };
   }

[Killed] EqualityOperator
features/import/utils/csvParser.ts:280:7
     };
   }
 
-  if (max !== undefined && num > max) {
+  if (max === undefined && num > max) {
     return {
       value: null,
killedBy: csvParser getNumericField should error on value above maximum
statusReason: expected undefined to be defined

[Killed] BlockStatement
features/import/utils/csvParser.ts:280:39
     };
   }
 
-  if (max !== undefined && num > max) {
-    return {
-      value: null,
-      error: errorMessage || `${fieldName} must be <= ${max}`,
-    };
-  }
+  if (max !== undefined && num > max) {}
 
   return { value: num };
killedBy: csvParser getNumericField should error on value above maximum
statusReason: expected undefined to be defined

[Killed] LogicalOperator
features/import/utils/csvParser.ts:283:14
   if (max !== undefined && num > max) {
     return {
       value: null,
-      error: errorMessage || `${fieldName} must be <= ${max}`,
+      error: errorMessage && `${fieldName} must be <= ${max}`,
     };
   }
killedBy: csvParser getNumericField should error on value above maximum
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
features/import/utils/csvParser.ts:283:14
   if (max !== undefined && num > max) {
     return {
       value: null,
-      error: errorMessage || `${fieldName} must be <= ${max}`,
+      error: true,
     };
   }

[Killed] ObjectLiteral
features/import/utils/csvParser.ts:287:10
     };
   }
 
-  return { value: num };
+  return {};
 }
 
killedBy: importValidationService parseImportCsvContent should parse ratings CSV
statusReason: expected [] to have a length of 2 but got +0

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:302:22
     errorMessage?: string;
   } = {}
 ): { value: string; error?: string } {
-  const { required = false, fallback = new Date().toISOString(), errorMessage } = options;
+  const { required = true, fallback = new Date().toISOString(), errorMessage } = options;
 
   const { value, error } = getField(row, fieldName, { required, trim: true });
killedBy: csvParser getDateField should use fallback for missing date
statusReason: expected '' to be '2024-01-01T00:00:00.000Z' // Object.is equality

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:307:9
   const { value, error } = getField(row, fieldName, { required, trim: true });
 
   if (error) {
-    if (!required) {
+    if (required) {
       return { value: fallback };
     }
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [ { …(8) }, { …(8) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:307:9
   const { value, error } = getField(row, fieldName, { required, trim: true });
 
   if (error) {
-    if (!required) {
+    if (true) {
       return { value: fallback };
     }
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [ { …(8) }, { …(8) } ] to have a length of 1 but got 2

[Survived] StringLiteral
features/import/utils/csvParser.ts:310:21
     if (!required) {
       return { value: fallback };
     }
-    return { value: "", error };
+    return { value: "Stryker was here!", error };
   }
 

[Killed] BlockStatement
features/import/utils/csvParser.ts:313:15
     return { value: "", error };
   }
 
-  if (!value) {
-    return { value: fallback };
-  }
+  if (!value) {}
 
   // Try parsing various date formats
killedBy: csvParser getDateField should use fallback for missing date
statusReason: expected '1970-01-01T00:00:00.000Z' to be '2024-01-01T00:00:00.000Z' // Object.is equality

[Killed] ObjectLiteral
features/import/utils/csvParser.ts:314:12
   }
 
   if (!value) {
-    return { value: fallback };
+    return {};
   }
 
killedBy: csvParser getDateField should use fallback for missing date
statusReason: expected undefined to be '2024-01-01T00:00:00.000Z' // Object.is equality

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:320:7
   // Try parsing various date formats
   const date = parseFlexibleDate(value);
 
-  if (!date) {
+  if (date) {
     return {
       value: "",
killedBy: importValidationService parseImportCsvContent should skip invalid diary rows without watched date
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
features/import/utils/csvParser.ts:320:14
   // Try parsing various date formats
   const date = parseFlexibleDate(value);
 
-  if (!date) {
-    return {
-      value: "",
-      error: errorMessage || `Invalid date format for ${fieldName}: ${value}`,
-    };
-  }
+  if (!date) {}
 
   return { value: date.toISOString() };
killedBy: csvParser getDateField should error on invalid date format
statusReason: Cannot read properties of null (reading 'toISOString')

[Killed] ObjectLiteral
features/import/utils/csvParser.ts:321:12
   const date = parseFlexibleDate(value);
 
   if (!date) {
-    return {
-      value: "",
-      error: errorMessage || `Invalid date format for ${fieldName}: ${value}`,
-    };
+    return {};
   }
 
killedBy: csvParser getDateField should error on invalid date format
statusReason: expected undefined to be defined

[Killed] LogicalOperator
features/import/utils/csvParser.ts:323:14
   if (!date) {
     return {
       value: "",
-      error: errorMessage || `Invalid date format for ${fieldName}: ${value}`,
+      error: errorMessage && `Invalid date format for ${fieldName}: ${value}`,
     };
   }
killedBy: csvParser getDateField should error on invalid date format
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
features/import/utils/csvParser.ts:323:14
   if (!date) {
     return {
       value: "",
-      error: errorMessage || `Invalid date format for ${fieldName}: ${value}`,
+      error: true,
     };
   }

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:336:7
 function parseFlexibleDate(dateString: string): Date | null {
   // Try ISO format first
   const isoDate = new Date(dateString);
-  if (!isNaN(isoDate.getTime())) {
+  if (true) {
     return isoDate;
   }
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: Invalid time value

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:336:7
 function parseFlexibleDate(dateString: string): Date | null {
   // Try ISO format first
   const isoDate = new Date(dateString);
-  if (!isNaN(isoDate.getTime())) {
+  if (isNaN(isoDate.getTime())) {
     return isoDate;
   }
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: Invalid time value

[Killed] Regex
features/import/utils/csvParser.ts:341:34
   }
 
   // Try DD/MM/YYYY or MM/DD/YYYY
-  const parts = dateString.split(/[-/]/);
+  const parts = dateString.split(/[^-/]/);
   if (parts.length === 3) {
     const year = parseInt(parts[2], 10);
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: expected '' to be truthy

[Killed] EqualityOperator
features/import/utils/csvParser.ts:342:7
 
   // Try DD/MM/YYYY or MM/DD/YYYY
   const parts = dateString.split(/[-/]/);
-  if (parts.length === 3) {
+  if (parts.length !== 3) {
     const year = parseInt(parts[2], 10);
     let month = parseInt(parts[0], 10);
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: expected '' to be truthy

[Killed] BlockStatement
features/import/utils/csvParser.ts:342:27
 
   // Try DD/MM/YYYY or MM/DD/YYYY
   const parts = dateString.split(/[-/]/);
-  if (parts.length === 3) {
-    const year = parseInt(parts[2], 10);
-    let month = parseInt(parts[0], 10);
-    let day = parseInt(parts[1], 10);
-
-    // If first part > 12, assume DD/MM/YYYY
-    if (parts[0].length === 2 && parseInt(parts[0], 10) > 12) {
-      [day, month] = [month, day];
-    }
-
-    const date = new Date(year, month - 1, day);
-    if (!isNaN(date.getTime())) {
-      return date;
-    }
-  }
+  if (parts.length === 3) {}
 
   return null;
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: expected '' to be truthy

[Survived] EqualityOperator
features/import/utils/csvParser.ts:348:34
     let day = parseInt(parts[1], 10);
 
     // If first part > 12, assume DD/MM/YYYY
-    if (parts[0].length === 2 && parseInt(parts[0], 10) > 12) {
+    if (parts[0].length === 2 && parseInt(parts[0], 10) <= 12) {
       [day, month] = [month, day];
     }

[Survived] EqualityOperator
features/import/utils/csvParser.ts:348:9
     let day = parseInt(parts[1], 10);
 
     // If first part > 12, assume DD/MM/YYYY
-    if (parts[0].length === 2 && parseInt(parts[0], 10) > 12) {
+    if (parts[0].length !== 2 && parseInt(parts[0], 10) > 12) {
       [day, month] = [month, day];
     }

[Survived] ArithmeticOperator
features/import/utils/csvParser.ts:352:33
       [day, month] = [month, day];
     }
 
-    const date = new Date(year, month - 1, day);
+    const date = new Date(year, month + 1, day);
     if (!isNaN(date.getTime())) {
       return date;

[Killed] BooleanLiteral
features/import/utils/csvParser.ts:353:9
     }
 
     const date = new Date(year, month - 1, day);
-    if (!isNaN(date.getTime())) {
+    if (isNaN(date.getTime())) {
       return date;
     }
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: expected '' to be truthy

[Killed] ConditionalExpression
features/import/utils/csvParser.ts:353:9
     }
 
     const date = new Date(year, month - 1, day);
-    if (!isNaN(date.getTime())) {
+    if (false) {
       return date;
     }
killedBy: csvParser getDateField should parse DD/MM/YYYY format (day > 12)
statusReason: expected '' to be truthy

[Killed] BlockStatement
features/import/utils/csvParser.ts:368:46
   row: Record<string, string>,
   fieldName: string,
   options: { required?: boolean; errorMessage?: string } = {}
-): { value: boolean | null; error?: string } {
-  const { value, error } = getField(row, fieldName, { required: options.required });
-
-  if (error) {
-    return { value: null, error };
-  }
-
-  if (!value) {
-    return { value: null };
-  }
-
-  const truthy = ["yes", "true", "1", "sim", "s", "y"];
-  return { value: truthy.includes(value.toLowerCase()) };
-}
+): { value: boolean | null; error?: string } {}
 
killedBy: csvParser getBooleanField should parse 'yes' as true
statusReason: Cannot read properties of undefined (reading 'value')

[Survived] ObjectLiteral
features/import/utils/csvParser.ts:369:53
   fieldName: string,
   options: { required?: boolean; errorMessage?: string } = {}
 ): { value: boolean | null; error?: string } {
-  const { value, error } = getField(row, fieldName, { required: options.required });
+  const { value, error } = getField(row, fieldName, {});
 
   if (error) {

[Survived] StringLiteral
features/import/utils/csvParser.ts:379:51
     return { value: null };
   }
 
-  const truthy = ["yes", "true", "1", "sim", "s", "y"];
+  const truthy = ["yes", "true", "1", "sim", "s", ""];
   return { value: truthy.includes(value.toLowerCase()) };
 }

[Killed] MethodExpression
features/import/utils/csvParser.ts:380:35
   }
 
   const truthy = ["yes", "true", "1", "sim", "s", "y"];
-  return { value: truthy.includes(value.toLowerCase()) };
+  return { value: truthy.includes(value.toUpperCase()) };
 }
 
killedBy: csvParser getBooleanField should parse 'yes' as true
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
features/import/utils/csvParser.ts:380:10
   }
 
   const truthy = ["yes", "true", "1", "sim", "s", "y"];
-  return { value: truthy.includes(value.toLowerCase()) };
+  return {};
 }
 
killedBy: csvParser getBooleanField should parse 'yes' as true
statusReason: expected undefined to be true // Object.is equality
