[Killed] ConditionalExpression
features/import/utils/movieMatcher.ts:242:7
  * Format match result for display
  */
 export function formatMatchResult(result: TmdbMatchResult): string {
-  if (result.matched) {
+  if (false) {
     return `✓ ${result.title} (${result.year}) - ${result.confidence}% match`;
   }
killedBy: movieMatcher formatMatchResult should format matched result
statusReason: expected '✗ No match found for "The Matrix"' to contain '✓'

[Killed] StringLiteral
features/import/utils/movieMatcher.ts:245:10
   if (result.matched) {
     return `✓ ${result.title} (${result.year}) - ${result.confidence}% match`;
   }
-  return `✗ No match found for "${result.query}"`;
+  return ``;
 }
 
killedBy: movieMatcher formatMatchResult should format unmatched result
statusReason: expected '' to contain '✗'
