[NoCoverage] ArrayDeclaration
features/lists/hooks/useLists.ts:25:53
 
 
 export function useLists(userId?: string, currentUserId?: string) {
-   const [lists, setLists] = useState<CustomList[]>([]);
+   const [lists, setLists] = useState<CustomList[]>(["Stryker was here"]);
    const [loading, setLoading] = useState(true);
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:26:43
 
 export function useLists(userId?: string, currentUserId?: string) {
    const [lists, setLists] = useState<CustomList[]>([]);
-   const [loading, setLoading] = useState(true);
+   const [loading, setLoading] = useState(false);
 
    const fetchLists = useCallback(async () => {

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:28:47
    const [lists, setLists] = useState<CustomList[]>([]);
    const [loading, setLoading] = useState(true);
 
-   const fetchLists = useCallback(async () => {
-      if (!userId) return;
-      setLoading(true);
-      try {
-         const myLists = await fetchOwnedLists(userId, currentUserId);
-         const sharedLists = await fetchCollaborativeLists(userId, currentUserId);
-
-         const merged = mergeLists(myLists as unknown as RawSupabaseList[], sharedLists as unknown as RawSupabaseList[]);
-         const unique = deduplicateLists(merged);
-         const withCounts = mapListCounts(unique);
-         const finalSortedLists = sortListsByDate(withCounts);
-
-         setLists(finalSortedLists);
-         
-      } catch (error) {
-         console.error("Erro ao buscar listas:", error);
-      } finally {
-         setLoading(false);
-      }
-   }, [userId, currentUserId]);
+   const fetchLists = useCallback(async () => {}, [userId, currentUserId]);
    
    useEffect(() => {

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:29:11
    const [loading, setLoading] = useState(true);
 
    const fetchLists = useCallback(async () => {
-      if (!userId) return;
+      if (true) return;
       setLoading(true);
       try {

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:29:11
    const [loading, setLoading] = useState(true);
 
    const fetchLists = useCallback(async () => {
-      if (!userId) return;
+      if (false) return;
       setLoading(true);
       try {

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:30:18
 
    const fetchLists = useCallback(async () => {
       if (!userId) return;
-      setLoading(true);
+      setLoading(false);
       try {
          const myLists = await fetchOwnedLists(userId, currentUserId);

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:31:11
    const fetchLists = useCallback(async () => {
       if (!userId) return;
       setLoading(true);
-      try {
-         const myLists = await fetchOwnedLists(userId, currentUserId);
-         const sharedLists = await fetchCollaborativeLists(userId, currentUserId);
-
-         const merged = mergeLists(myLists as unknown as RawSupabaseList[], sharedLists as unknown as RawSupabaseList[]);
-         const unique = deduplicateLists(merged);
-         const withCounts = mapListCounts(unique);
-         const finalSortedLists = sortListsByDate(withCounts);
-
-         setLists(finalSortedLists);
-         
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao buscar listas:", error);
       } finally {

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:42:23
 
          setLists(finalSortedLists);
          
-      } catch (error) {
-         console.error("Erro ao buscar listas:", error);
-      } finally {
+      } catch (error) {} finally {
          setLoading(false);
       }

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:44:17
          
       } catch (error) {
          console.error("Erro ao buscar listas:", error);
-      } finally {
-         setLoading(false);
-      }
+      } finally {}
    }, [userId, currentUserId]);
    

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:49:20
       }
    }, [userId, currentUserId]);
    
-   useEffect(() => {
-      if (userId) {
-         fetchLists();
-      }
-   }, [userId, fetchLists]);
+   useEffect(() => {}, [userId, fetchLists]);
 
    useEffect(() => {

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:50:19
    }, [userId, currentUserId]);
    
    useEffect(() => {
-      if (userId) {
-         fetchLists();
-      }
+      if (userId) {}
    }, [userId, fetchLists]);
 

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:50:11
    }, [userId, currentUserId]);
    
    useEffect(() => {
-      if (userId) {
+      if (true) {
          fetchLists();
       }

[NoCoverage] ArrayDeclaration
features/lists/hooks/useLists.ts:53:7
       if (userId) {
          fetchLists();
       }
-   }, [userId, fetchLists]);
+   }, []);
 
    useEffect(() => {

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:55:20
       }
    }, [userId, fetchLists]);
 
-   useEffect(() => {
-      if (!userId) return;
-
-      return subscribeListsChanges(userId, fetchLists);
-   }, [userId, fetchLists]);
+   useEffect(() => {}, [userId, fetchLists]);
 
    const createList = async (

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:56:11
    }, [userId, fetchLists]);
 
    useEffect(() => {
-      if (!userId) return;
+      if (false) return;
 
       return subscribeListsChanges(userId, fetchLists);

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:56:11
    }, [userId, fetchLists]);
 
    useEffect(() => {
-      if (!userId) return;
+      if (true) return;
 
       return subscribeListsChanges(userId, fetchLists);

[NoCoverage] StringLiteral
features/lists/hooks/useLists.ts:64:60
    const createList = async (
       name: string, 
       description: string, 
-      type: "private" | "partial_shared" | "full_shared" = "private",
+      type: "private" | "partial_shared" | "full_shared" = "",
       collaboratorIds: string[] = [],
       has_rating: boolean = false, 

[NoCoverage] ArrayDeclaration
features/lists/hooks/useLists.ts:65:35
       name: string, 
       description: string, 
       type: "private" | "partial_shared" | "full_shared" = "private",
-      collaboratorIds: string[] = [],
+      collaboratorIds: string[] = ["Stryker was here"],
       has_rating: boolean = false, 
       rating_type: "manual" | "average" | null = null,

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:66:29
       description: string, 
       type: "private" | "partial_shared" | "full_shared" = "private",
       collaboratorIds: string[] = [],
-      has_rating: boolean = false, 
+      has_rating: boolean = true, 
       rating_type: "manual" | "average" | null = null,
       manual_rating: number | null = null,

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:69:28
       has_rating: boolean = false, 
       rating_type: "manual" | "average" | null = null,
       manual_rating: number | null = null,
-      auto_sync: boolean = false,
+      auto_sync: boolean = true,
    ) => {
       if (!userId) return { success: false, data: null, error: "Usuário não autenticado." };

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:71:11
       manual_rating: number | null = null,
       auto_sync: boolean = false,
    ) => {
-      if (!userId) return { success: false, data: null, error: "Usuário não autenticado." };
+      if (false) return { success: false, data: null, error: "Usuário não autenticado." };
       setLoading(true);
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:71:11
       manual_rating: number | null = null,
       auto_sync: boolean = false,
    ) => {
-      if (!userId) return { success: false, data: null, error: "Usuário não autenticado." };
+      if (userId) return { success: false, data: null, error: "Usuário não autenticado." };
       setLoading(true);
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:72:18
       auto_sync: boolean = false,
    ) => {
       if (!userId) return { success: false, data: null, error: "Usuário não autenticado." };
-      setLoading(true);
+      setLoading(false);
 
       try {

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:74:11
       if (!userId) return { success: false, data: null, error: "Usuário não autenticado." };
       setLoading(true);
 
-      try {
-         const newList = await createListRecord({
-            ownerId: userId,
-            name,
-            description,
-            type,
-            has_rating,
-            rating_type,
-            manual_rating,
-            auto_sync,
-         });
-
-         if (type !== "private" && collaboratorIds.length > 0) {
-            await addCollaboratorsToList(newList.id, collaboratorIds);
-            await notifyListCollaborators(userId, newList.id, type, collaboratorIds);
-         }
-
-         setLists((prev) => [newList as CustomList, ...prev]);
-         return { success: true, data: newList as CustomList, error: null };
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao criar lista:", error);
          return { success: false, data: null, error: "Erro ao criar a lista." };

[NoCoverage] EqualityOperator
features/lists/hooks/useLists.ts:86:14
             auto_sync,
          });
 
-         if (type !== "private" && collaboratorIds.length > 0) {
+         if (type === "private" && collaboratorIds.length > 0) {
             await addCollaboratorsToList(newList.id, collaboratorIds);
             await notifyListCollaborators(userId, newList.id, type, collaboratorIds);

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:86:14
             auto_sync,
          });
 
-         if (type !== "private" && collaboratorIds.length > 0) {
+         if (false) {
             await addCollaboratorsToList(newList.id, collaboratorIds);
             await notifyListCollaborators(userId, newList.id, type, collaboratorIds);

[NoCoverage] ArrowFunction
features/lists/hooks/useLists.ts:91:19
             await notifyListCollaborators(userId, newList.id, type, collaboratorIds);
          }
 
-         setLists((prev) => [newList as CustomList, ...prev]);
+         setLists(() => undefined);
          return { success: true, data: newList as CustomList, error: null };
       } catch (error) {

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:92:28
          }
 
          setLists((prev) => [newList as CustomList, ...prev]);
-         return { success: true, data: newList as CustomList, error: null };
+         return { success: false, data: newList as CustomList, error: null };
       } catch (error) {
          console.error("Erro ao criar lista:", error);

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:93:23
 
          setLists((prev) => [newList as CustomList, ...prev]);
          return { success: true, data: newList as CustomList, error: null };
-      } catch (error) {
-         console.error("Erro ao criar lista:", error);
-         return { success: false, data: null, error: "Erro ao criar a lista." };
-      } finally {
+      } catch (error) {} finally {
          setLoading(false);
       }

[NoCoverage] StringLiteral
features/lists/hooks/useLists.ts:94:24
          setLists((prev) => [newList as CustomList, ...prev]);
          return { success: true, data: newList as CustomList, error: null };
       } catch (error) {
-         console.error("Erro ao criar lista:", error);
+         console.error("", error);
          return { success: false, data: null, error: "Erro ao criar a lista." };
       } finally {

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:95:28
          return { success: true, data: newList as CustomList, error: null };
       } catch (error) {
          console.error("Erro ao criar lista:", error);
-         return { success: false, data: null, error: "Erro ao criar a lista." };
+         return { success: true, data: null, error: "Erro ao criar a lista." };
       } finally {
          setLoading(false);

[NoCoverage] StringLiteral
features/lists/hooks/useLists.ts:95:54
          return { success: true, data: newList as CustomList, error: null };
       } catch (error) {
          console.error("Erro ao criar lista:", error);
-         return { success: false, data: null, error: "Erro ao criar a lista." };
+         return { success: false, data: null, error: "" };
       } finally {
          setLoading(false);

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:96:17
       } catch (error) {
          console.error("Erro ao criar lista:", error);
          return { success: false, data: null, error: "Erro ao criar a lista." };
-      } finally {
-         setLoading(false);
-      }
+      } finally {}
    };
 

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:101:69
       }
    };
 
-   const addMovieToList = async (listId: string, tmdbId: number) => {
-      if (!userId) return { success: false, error: "Usuário não autenticado." };
-      try {
-         const exists = await listMovieExists(listId, tmdbId);
-
-         if (exists) {
-            return { success: true, error: null };
-         }
-
-         await addMovieToListRecord(listId, tmdbId, userId);
-
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
-         ));
-
-         return { success: true, error: null };
-      } catch (error) {
-         console.error("Erro ao adicionar filme à lista:", error);
-         return { success: false, error: "Erro ao adicionar filme à lista." };
-      }
-   };
+   const addMovieToList = async (listId: string, tmdbId: number) => {};
 
    const updateList = async (

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:102:11
    };
 
    const addMovieToList = async (listId: string, tmdbId: number) => {
-      if (!userId) return { success: false, error: "Usuário não autenticado." };
+      if (false) return { success: false, error: "Usuário não autenticado." };
       try {
          const exists = await listMovieExists(listId, tmdbId);

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:102:11
    };
 
    const addMovieToList = async (listId: string, tmdbId: number) => {
-      if (!userId) return { success: false, error: "Usuário não autenticado." };
+      if (true) return { success: false, error: "Usuário não autenticado." };
       try {
          const exists = await listMovieExists(listId, tmdbId);

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:103:11
 
    const addMovieToList = async (listId: string, tmdbId: number) => {
       if (!userId) return { success: false, error: "Usuário não autenticado." };
-      try {
-         const exists = await listMovieExists(listId, tmdbId);
-
-         if (exists) {
-            return { success: true, error: null };
-         }
-
-         await addMovieToListRecord(listId, tmdbId, userId);
-
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
-         ));
-
-         return { success: true, error: null };
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao adicionar filme à lista:", error);
          return { success: false, error: "Erro ao adicionar filme à lista." };

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:106:14
       try {
          const exists = await listMovieExists(listId, tmdbId);
 
-         if (exists) {
+         if (false) {
             return { success: true, error: null };
          }

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:106:14
       try {
          const exists = await listMovieExists(listId, tmdbId);
 
-         if (exists) {
+         if (true) {
             return { success: true, error: null };
          }

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:107:31
          const exists = await listMovieExists(listId, tmdbId);
 
          if (exists) {
-            return { success: true, error: null };
+            return { success: false, error: null };
          }
 

[NoCoverage] ArrowFunction
features/lists/hooks/useLists.ts:112:19
 
          await addMovieToListRecord(listId, tmdbId, userId);
 
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
-         ));
+         setLists(() => undefined);
 
          return { success: true, error: null };

[NoCoverage] ArrowFunction
features/lists/hooks/useLists.ts:112:36
 
          await addMovieToListRecord(listId, tmdbId, userId);
 
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
+         setLists(prev => prev.map(() => undefined
          ));
 

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:113:59
          await addMovieToListRecord(listId, tmdbId, userId);
 
          setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
+            list.id === listId ? { ...list, movie_count: (true) + 1 } : list
          ));
 

[NoCoverage] EqualityOperator
features/lists/hooks/useLists.ts:113:13
          await addMovieToListRecord(listId, tmdbId, userId);
 
          setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
+            list.id !== listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
          ));
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:116:28
             list.id === listId ? { ...list, movie_count: (list.movie_count || 0) + 1 } : list
          ));
 
-         return { success: true, error: null };
+         return { success: false, error: null };
       } catch (error) {
          console.error("Erro ao adicionar filme à lista:", error);

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:117:23
          ));
 
          return { success: true, error: null };
-      } catch (error) {
-         console.error("Erro ao adicionar filme à lista:", error);
-         return { success: false, error: "Erro ao adicionar filme à lista." };
-      }
+      } catch (error) {}
    };
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:119:28
          return { success: true, error: null };
       } catch (error) {
          console.error("Erro ao adicionar filme à lista:", error);
-         return { success: false, error: "Erro ao adicionar filme à lista." };
+         return { success: true, error: "Erro ao adicionar filme à lista." };
       }
    };

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:131:9
       rating_type: "manual" | "average" | null,
       manual_rating: number | null,
       auto_sync: boolean,
-   ) => {
-      try {
-         await updateListRecord(listId, { name, description, has_rating, rating_type, manual_rating, auto_sync });
-         
-         fetchLists(); 
-         return { success: true, error: null };
-      } catch (error) {
-         console.error("Erro ao atualizar lista:", error);
-         return { success: false, error: "Erro ao atualizar a lista." };
-      }
-   };
+   ) => {};
 
    const removeMovieFromList = async (listId: string, tmdbId: number) => {

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:132:11
       manual_rating: number | null,
       auto_sync: boolean,
    ) => {
-      try {
-         await updateListRecord(listId, { name, description, has_rating, rating_type, manual_rating, auto_sync });
-         
-         fetchLists(); 
-         return { success: true, error: null };
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao atualizar lista:", error);
          return { success: false, error: "Erro ao atualizar a lista." };

[NoCoverage] ObjectLiteral
features/lists/hooks/useLists.ts:133:41
       auto_sync: boolean,
    ) => {
       try {
-         await updateListRecord(listId, { name, description, has_rating, rating_type, manual_rating, auto_sync });
+         await updateListRecord(listId, {});
          
          fetchLists(); 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:136:28
          await updateListRecord(listId, { name, description, has_rating, rating_type, manual_rating, auto_sync });
          
          fetchLists(); 
-         return { success: true, error: null };
+         return { success: false, error: null };
       } catch (error) {
          console.error("Erro ao atualizar lista:", error);

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:137:23
          
          fetchLists(); 
          return { success: true, error: null };
-      } catch (error) {
-         console.error("Erro ao atualizar lista:", error);
-         return { success: false, error: "Erro ao atualizar a lista." };
-      }
+      } catch (error) {}
    };
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:139:28
          return { success: true, error: null };
       } catch (error) {
          console.error("Erro ao atualizar lista:", error);
-         return { success: false, error: "Erro ao atualizar a lista." };
+         return { success: true, error: "Erro ao atualizar a lista." };
       }
    };

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:143:74
       }
    };
 
-   const removeMovieFromList = async (listId: string, tmdbId: number) => {
-      try {
-         await removeMovieFromListRecord(listId, tmdbId);
-         
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
-         ));
-
-         return { success: true, error: null };
-      } catch (error) {
-         console.error("Erro ao remover filme da lista:", error);
-         return { success: false, error: "Erro ao remover filme da lista." };
-      }
-   }
+   const removeMovieFromList = async (listId: string, tmdbId: number) => {}
 
    return { lists, loading, fetchLists, createList, addMovieToList, updateList, removeMovieFromList};

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:144:11
    };
 
    const removeMovieFromList = async (listId: string, tmdbId: number) => {
-      try {
-         await removeMovieFromListRecord(listId, tmdbId);
-         
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
-         ));
-
-         return { success: true, error: null };
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao remover filme da lista:", error);
          return { success: false, error: "Erro ao remover filme da lista." };

[NoCoverage] ArrowFunction
features/lists/hooks/useLists.ts:147:19
       try {
          await removeMovieFromListRecord(listId, tmdbId);
          
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
-         ));
+         setLists(() => undefined);
 
          return { success: true, error: null };

[NoCoverage] ArrowFunction
features/lists/hooks/useLists.ts:147:36
       try {
          await removeMovieFromListRecord(listId, tmdbId);
          
-         setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
+         setLists(prev => prev.map(() => undefined
          ));
 

[NoCoverage] ArithmeticOperator
features/lists/hooks/useLists.ts:148:70
          await removeMovieFromListRecord(listId, tmdbId);
          
          setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
+            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) + 1) } : list
          ));
 

[NoCoverage] ConditionalExpression
features/lists/hooks/useLists.ts:148:13
          await removeMovieFromListRecord(listId, tmdbId);
          
          setLists(prev => prev.map(list => 
-            list.id === listId ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
+            false ? { ...list, movie_count: Math.max(0, (list.movie_count || 0) - 1) } : list
          ));
 

[NoCoverage] BlockStatement
features/lists/hooks/useLists.ts:152:23
          ));
 
          return { success: true, error: null };
-      } catch (error) {
-         console.error("Erro ao remover filme da lista:", error);
-         return { success: false, error: "Erro ao remover filme da lista." };
-      }
+      } catch (error) {}
    }
 

[NoCoverage] BooleanLiteral
features/lists/hooks/useLists.ts:154:28
          return { success: true, error: null };
       } catch (error) {
          console.error("Erro ao remover filme da lista:", error);
-         return { success: false, error: "Erro ao remover filme da lista." };
+         return { success: true, error: "Erro ao remover filme da lista." };
       }
    }

[NoCoverage] ObjectLiteral
features/lists/hooks/useLists.ts:158:11
       }
    }
 
-   return { lists, loading, fetchLists, createList, addMovieToList, updateList, removeMovieFromList};
+   return {};
 }
