[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:51:58
   
   const [isLiked, setIsLiked] = useState(isInitialLiked);
   const [likesCount, setLikesCount] = useState(initialLikes);
-  const [isActionLoading, setIsActionLoading] = useState(false);
+  const [isActionLoading, setIsActionLoading] = useState(true);
 
   const handleToggleLike = async (): Promise<ToggleLikeResult> => {
killedBy: useListSocial handleDuplicate ensures isActionLoading is reset to false in finally block
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:53:67
   const [likesCount, setLikesCount] = useState(initialLikes);
   const [isActionLoading, setIsActionLoading] = useState(false);
 
-  const handleToggleLike = async (): Promise<ToggleLikeResult> => {
-    if (!currentUserId) return { success: false, error: "Usuário não autenticado." };
-
-    const previousLiked = isLiked;
-    const previousCount = likesCount;
-    
-    setIsLiked(!previousLiked);
-    setLikesCount(prev => previousLiked ? prev - 1 : prev + 1);
-
-    try {
-      await toggleListLike(listId);
-      return { success: true, error: null };
-    } catch (error) {
-      setIsLiked(previousLiked);
-      setLikesCount(previousCount);
-      console.error("Erro ao curtir lista:", error);
-      return { success: false, error: "Erro ao processar curtida." };
-    }
-  };
+  const handleToggleLike = async (): Promise<ToggleLikeResult> => {};
 
   const handleShare = async (): Promise<ShareResult> => {
killedBy: useListSocial handleToggleLike returns error when not authenticated
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:54:43
   const [isActionLoading, setIsActionLoading] = useState(false);
 
   const handleToggleLike = async (): Promise<ToggleLikeResult> => {
-    if (!currentUserId) return { success: false, error: "Usuário não autenticado." };
+    if (!currentUserId) return { success: true, error: "Usuário não autenticado." };
 
     const previousLiked = isLiked;
killedBy: useListSocial handleToggleLike returns error when not authenticated
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
features/lists/hooks/useListSocial.ts:54:9
   const [isActionLoading, setIsActionLoading] = useState(false);
 
   const handleToggleLike = async (): Promise<ToggleLikeResult> => {
-    if (!currentUserId) return { success: false, error: "Usuário não autenticado." };
+    if (true) return { success: false, error: "Usuário não autenticado." };
 
     const previousLiked = isLiked;
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:59:16
     const previousLiked = isLiked;
     const previousCount = likesCount;
     
-    setIsLiked(!previousLiked);
+    setIsLiked(previousLiked);
     setLikesCount(prev => previousLiked ? prev - 1 : prev + 1);
 
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
features/lists/hooks/useListSocial.ts:60:54
     const previousCount = likesCount;
     
     setIsLiked(!previousLiked);
-    setLikesCount(prev => previousLiked ? prev - 1 : prev + 1);
+    setLikesCount(prev => previousLiked ? prev - 1 : prev - 1);
 
     try {
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected 4 to be 6 // Object.is equality

[Killed] ArrowFunction
features/lists/hooks/useListSocial.ts:60:19
     const previousCount = likesCount;
     
     setIsLiked(!previousLiked);
-    setLikesCount(prev => previousLiked ? prev - 1 : prev + 1);
+    setLikesCount(() => undefined);
 
     try {
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected undefined to be 6 // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:62:9
     setIsLiked(!previousLiked);
     setLikesCount(prev => previousLiked ? prev - 1 : prev + 1);
 
-    try {
-      await toggleListLike(listId);
-      return { success: true, error: null };
-    } catch (error) {
+    try {} catch (error) {
       setIsLiked(previousLiked);
       setLikesCount(previousCount);
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:64:25
 
     try {
       await toggleListLike(listId);
-      return { success: true, error: null };
+      return { success: false, error: null };
     } catch (error) {
       setIsLiked(previousLiked);
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
features/lists/hooks/useListSocial.ts:64:14
 
     try {
       await toggleListLike(listId);
-      return { success: true, error: null };
+      return {};
     } catch (error) {
       setIsLiked(previousLiked);
killedBy: useListSocial handleToggleLike updates state optimistically and confirms via service
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:65:21
     try {
       await toggleListLike(listId);
       return { success: true, error: null };
-    } catch (error) {
-      setIsLiked(previousLiked);
-      setLikesCount(previousCount);
-      console.error("Erro ao curtir lista:", error);
-      return { success: false, error: "Erro ao processar curtida." };
-    }
+    } catch (error) {}
   };
 
killedBy: useListSocial handleToggleLike rolls back state on service failure
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:69:25
       setIsLiked(previousLiked);
       setLikesCount(previousCount);
       console.error("Erro ao curtir lista:", error);
-      return { success: false, error: "Erro ao processar curtida." };
+      return { success: true, error: "Erro ao processar curtida." };
     }
   };
killedBy: useListSocial handleToggleLike rolls back state on service failure
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
features/lists/hooks/useListSocial.ts:69:39
       setIsLiked(previousLiked);
       setLikesCount(previousCount);
       console.error("Erro ao curtir lista:", error);
-      return { success: false, error: "Erro ao processar curtida." };
+      return { success: false, error: "" };
     }
   };
killedBy: useListSocial handleToggleLike rolls back state on service failure
statusReason: expected '' to be 'Erro ao processar curtida.' // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:76:9
   const handleShare = async (): Promise<ShareResult> => {
     const url = buildListShareUrl(listId, ownerUsername);
 
-    try {
-      const title = "Compartilhar lista";
-      const text = "Veja esta lista no JJ Reviews";
-
-      if (Capacitor.isNativePlatform()) {
-        await Share.share({
-          title,
-          text,
-          url,
-          dialogTitle: "Compartilhar Lista",
-        });
-        return { success: true, url, error: null };
-      }
-
-      if (navigator.share) {
-        await navigator.share({ title, text, url });
-        return { success: true, url, error: null };
-      }
-
-      await navigator.clipboard.writeText(url);
-      return { success: true, url, error: null };
-    } catch (err) {
+    try {} catch (err) {
       console.error("Erro ao copiar link:", err);
 
killedBy: useListSocial handleShare successfully copies share URL to clipboard
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
features/lists/hooks/useListSocial.ts:77:21
     const url = buildListShareUrl(listId, ownerUsername);
 
     try {
-      const title = "Compartilhar lista";
+      const title = "";
       const text = "Veja esta lista no JJ Reviews";
 

[Survived] ConditionalExpression
features/lists/hooks/useListSocial.ts:80:11
       const title = "Compartilhar lista";
       const text = "Veja esta lista no JJ Reviews";
 
-      if (Capacitor.isNativePlatform()) {
+      if (true) {
         await Share.share({
           title,

[NoCoverage] BlockStatement
features/lists/hooks/useListSocial.ts:80:41
       const title = "Compartilhar lista";
       const text = "Veja esta lista no JJ Reviews";
 
-      if (Capacitor.isNativePlatform()) {
-        await Share.share({
-          title,
-          text,
-          url,
-          dialogTitle: "Compartilhar Lista",
-        });
-        return { success: true, url, error: null };
-      }
+      if (Capacitor.isNativePlatform()) {}
 
       if (navigator.share) {

[NoCoverage] StringLiteral
features/lists/hooks/useListSocial.ts:85:24
           title,
           text,
           url,
-          dialogTitle: "Compartilhar Lista",
+          dialogTitle: "",
         });
         return { success: true, url, error: null };

[NoCoverage] BooleanLiteral
features/lists/hooks/useListSocial.ts:87:27
           url,
           dialogTitle: "Compartilhar Lista",
         });
-        return { success: true, url, error: null };
+        return { success: false, url, error: null };
       }
 

[Survived] ConditionalExpression
features/lists/hooks/useListSocial.ts:90:11
         return { success: true, url, error: null };
       }
 
-      if (navigator.share) {
+      if (true) {
         await navigator.share({ title, text, url });
         return { success: true, url, error: null };

[NoCoverage] BlockStatement
features/lists/hooks/useListSocial.ts:90:28
         return { success: true, url, error: null };
       }
 
-      if (navigator.share) {
-        await navigator.share({ title, text, url });
-        return { success: true, url, error: null };
-      }
+      if (navigator.share) {}
 
       await navigator.clipboard.writeText(url);

[NoCoverage] ObjectLiteral
features/lists/hooks/useListSocial.ts:91:31
       }
 
       if (navigator.share) {
-        await navigator.share({ title, text, url });
+        await navigator.share({});
         return { success: true, url, error: null };
       }

[NoCoverage] BooleanLiteral
features/lists/hooks/useListSocial.ts:92:27
 
       if (navigator.share) {
         await navigator.share({ title, text, url });
-        return { success: true, url, error: null };
+        return { success: false, url, error: null };
       }
 

[NoCoverage] ObjectLiteral
features/lists/hooks/useListSocial.ts:92:16
 
       if (navigator.share) {
         await navigator.share({ title, text, url });
-        return { success: true, url, error: null };
+        return {};
       }
 

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:96:25
       }
 
       await navigator.clipboard.writeText(url);
-      return { success: true, url, error: null };
+      return { success: false, url, error: null };
     } catch (err) {
       console.error("Erro ao copiar link:", err);
killedBy: useListSocial handleShare successfully copies share URL to clipboard
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
features/lists/hooks/useListSocial.ts:96:14
       }
 
       await navigator.clipboard.writeText(url);
-      return { success: true, url, error: null };
+      return {};
     } catch (err) {
       console.error("Erro ao copiar link:", err);
killedBy: useListSocial handleShare successfully copies share URL to clipboard
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:97:19
 
       await navigator.clipboard.writeText(url);
       return { success: true, url, error: null };
-    } catch (err) {
-      console.error("Erro ao copiar link:", err);
-
-      try {
-        await navigator.clipboard.writeText(url);
-        return { success: true, url, error: null };
-      } catch {
-        return { success: false, url, error: "Erro ao compartilhar lista." };
-      }
-    }
+    } catch (err) {}
   };
 
killedBy: useListSocial handleShare returns error when clipboard API fails but includes URL
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
features/lists/hooks/useListSocial.ts:98:21
       await navigator.clipboard.writeText(url);
       return { success: true, url, error: null };
     } catch (err) {
-      console.error("Erro ao copiar link:", err);
+      console.error("", err);
 
       try {

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:100:11
     } catch (err) {
       console.error("Erro ao copiar link:", err);
 
-      try {
-        await navigator.clipboard.writeText(url);
-        return { success: true, url, error: null };
-      } catch {
+      try {} catch {
         return { success: false, url, error: "Erro ao compartilhar lista." };
       }
killedBy: useListSocial handleShare returns error when clipboard API fails but includes URL
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:103:15
       try {
         await navigator.clipboard.writeText(url);
         return { success: true, url, error: null };
-      } catch {
-        return { success: false, url, error: "Erro ao compartilhar lista." };
-      }
+      } catch {}
     }
   };
killedBy: useListSocial handleShare returns error when clipboard API fails but includes URL
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:104:27
         await navigator.clipboard.writeText(url);
         return { success: true, url, error: null };
       } catch {
-        return { success: false, url, error: "Erro ao compartilhar lista." };
+        return { success: true, url, error: "Erro ao compartilhar lista." };
       }
     }
killedBy: useListSocial handleShare returns error when clipboard API fails but includes URL
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
features/lists/hooks/useListSocial.ts:104:46
         await navigator.clipboard.writeText(url);
         return { success: true, url, error: null };
       } catch {
-        return { success: false, url, error: "Erro ao compartilhar lista." };
+        return { success: false, url, error: "" };
       }
     }
killedBy: useListSocial handleShare returns error when clipboard API fails but includes URL
statusReason: expected '' to be 'Erro ao compartilhar lista.' // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:113:34
     newTitle: string,
     selectedType: ListType = "private",
     options?: DuplicateOptions
-  ): Promise<DuplicateResult> => {
-    if (!currentUserId) return { success: false, data: null, error: "Usuário não autenticado." };
-
-    setIsActionLoading(true);
-    try {
-      const newList = await cloneListService(
-        listId,
-        currentUserId,
-        newTitle,
-        selectedType,
-        options
-      );
-      
-      return { success: true, data: newList, error: null };
-    } catch (error) {
-      console.error("Erro ao duplicar lista:", error);
-      return { success: false, data: null, error: "Erro ao duplicar a lista." };
-    } finally {
-      setIsActionLoading(false);
-    }
-  };
+  ): Promise<DuplicateResult> => {};
 
   return {
killedBy: useListSocial handleDuplicate returns error when not authenticated
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
features/lists/hooks/useListSocial.ts:114:9
     selectedType: ListType = "private",
     options?: DuplicateOptions
   ): Promise<DuplicateResult> => {
-    if (!currentUserId) return { success: false, data: null, error: "Usuário não autenticado." };
+    if (true) return { success: false, data: null, error: "Usuário não autenticado." };
 
     setIsActionLoading(true);
killedBy: useListSocial handleDuplicate uses provided title and calls clone service
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:114:9
     selectedType: ListType = "private",
     options?: DuplicateOptions
   ): Promise<DuplicateResult> => {
-    if (!currentUserId) return { success: false, data: null, error: "Usuário não autenticado." };
+    if (currentUserId) return { success: false, data: null, error: "Usuário não autenticado." };
 
     setIsActionLoading(true);
killedBy: useListSocial handleDuplicate returns error when not authenticated
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
features/lists/hooks/useListSocial.ts:116:24
   ): Promise<DuplicateResult> => {
     if (!currentUserId) return { success: false, data: null, error: "Usuário não autenticado." };
 
-    setIsActionLoading(true);
+    setIsActionLoading(false);
     try {
       const newList = await cloneListService(

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:117:9
     if (!currentUserId) return { success: false, data: null, error: "Usuário não autenticado." };
 
     setIsActionLoading(true);
-    try {
-      const newList = await cloneListService(
-        listId,
-        currentUserId,
-        newTitle,
-        selectedType,
-        options
-      );
-      
-      return { success: true, data: newList, error: null };
-    } catch (error) {
+    try {} catch (error) {
       console.error("Erro ao duplicar lista:", error);
       return { success: false, data: null, error: "Erro ao duplicar a lista." };
killedBy: useListSocial handleDuplicate uses provided title and calls clone service
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:126:25
         options
       );
       
-      return { success: true, data: newList, error: null };
+      return { success: false, data: newList, error: null };
     } catch (error) {
       console.error("Erro ao duplicar lista:", error);
killedBy: useListSocial handleDuplicate uses provided title and calls clone service
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
features/lists/hooks/useListSocial.ts:126:14
         options
       );
       
-      return { success: true, data: newList, error: null };
+      return {};
     } catch (error) {
       console.error("Erro ao duplicar lista:", error);
killedBy: useListSocial handleDuplicate uses provided title and calls clone service
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:127:21
       );
       
       return { success: true, data: newList, error: null };
-    } catch (error) {
-      console.error("Erro ao duplicar lista:", error);
-      return { success: false, data: null, error: "Erro ao duplicar a lista." };
-    } finally {
+    } catch (error) {} finally {
       setIsActionLoading(false);
     }
killedBy: useListSocial handleDuplicate returns error on clone failure
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:129:25
       return { success: true, data: newList, error: null };
     } catch (error) {
       console.error("Erro ao duplicar lista:", error);
-      return { success: false, data: null, error: "Erro ao duplicar a lista." };
+      return { success: true, data: null, error: "Erro ao duplicar a lista." };
     } finally {
       setIsActionLoading(false);
killedBy: useListSocial handleDuplicate returns error on clone failure
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
features/lists/hooks/useListSocial.ts:130:15
     } catch (error) {
       console.error("Erro ao duplicar lista:", error);
       return { success: false, data: null, error: "Erro ao duplicar a lista." };
-    } finally {
-      setIsActionLoading(false);
-    }
+    } finally {}
   };
 
killedBy: useListSocial handleDuplicate ensures isActionLoading is reset to false in finally block
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
features/lists/hooks/useListSocial.ts:131:26
       console.error("Erro ao duplicar lista:", error);
       return { success: false, data: null, error: "Erro ao duplicar a lista." };
     } finally {
-      setIsActionLoading(false);
+      setIsActionLoading(true);
     }
   };
killedBy: useListSocial handleDuplicate ensures isActionLoading is reset to false in finally block
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
features/lists/hooks/useListSocial.ts:135:10
     }
   };
 
-  return {
-    isLiked,
-    likesCount,
-    isActionLoading,
-    handleToggleLike,
-    handleShare,
-    handleDuplicate
-  };
+  return {};
 }
killedBy: useListSocial handleToggleLike returns error when not authenticated
statusReason: result.current.handleToggleLike is not a function
