[Killed] OptionalChaining
features/lists/services/listSocialService.ts:33:19
     p_list_id: listId,
   });
 
-  const rpcCode = (error as { code?: string } | null)?.code;
+  const rpcCode = (error as {
+  code?: string;
+} | null).code;
   const rpcMessage = (error as { message?: string } | null)?.message?.toLowerCase() || "";
   const needsLegacyParams =
killedBy: listSocialService toggleListLike toggles like with new rpc signature
statusReason: Cannot read properties of null (reading 'code')

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:34:22
   });
 
   const rpcCode = (error as { code?: string } | null)?.code;
-  const rpcMessage = (error as { message?: string } | null)?.message?.toLowerCase() || "";
+  const rpcMessage = true;
   const needsLegacyParams =
     Boolean(userId) &&
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: rpcMessage.includes is not a function

[Killed] OptionalChaining
features/lists/services/listSocialService.ts:34:22
   });
 
   const rpcCode = (error as { code?: string } | null)?.code;
-  const rpcMessage = (error as { message?: string } | null)?.message?.toLowerCase() || "";
+  const rpcMessage = (error as {
+  message?: string;
+} | null).message?.toLowerCase() || "";
   const needsLegacyParams =
     Boolean(userId) &&
killedBy: listSocialService toggleListLike toggles like with new rpc signature
statusReason: Cannot read properties of null (reading 'message')

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:36:5
   const rpcCode = (error as { code?: string } | null)?.code;
   const rpcMessage = (error as { message?: string } | null)?.message?.toLowerCase() || "";
   const needsLegacyParams =
-    Boolean(userId) &&
-    Boolean(error) &&
-    (
-      rpcCode === "42883" ||
-      rpcCode === "PGRST202" ||
-      rpcMessage.includes("p_user_id") ||
-      rpcMessage.includes("toggle_list_like(uuid) does not exist")
-    );
+    false;
 
   if (needsLegacyParams) {
killedBy: listSocialService toggleListLike uses legacy rpc params when backend requires p_user_id
statusReason: missing p_user_id

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:36:5
   const rpcCode = (error as { code?: string } | null)?.code;
   const rpcMessage = (error as { message?: string } | null)?.message?.toLowerCase() || "";
   const needsLegacyParams =
-    Boolean(userId) &&
-    Boolean(error) &&
-    (
-      rpcCode === "42883" ||
-      rpcCode === "PGRST202" ||
-      rpcMessage.includes("p_user_id") ||
-      rpcMessage.includes("toggle_list_like(uuid) does not exist")
-    );
+    true;
 
   if (needsLegacyParams) {

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:39:7
     Boolean(userId) &&
     Boolean(error) &&
     (
-      rpcCode === "42883" ||
-      rpcCode === "PGRST202" ||
-      rpcMessage.includes("p_user_id") ||
+      false ||
       rpcMessage.includes("toggle_list_like(uuid) does not exist")
     );
killedBy: listSocialService toggleListLike uses legacy rpc params when backend requires p_user_id
statusReason: missing p_user_id

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:39:7
     Boolean(userId) &&
     Boolean(error) &&
     (
-      rpcCode === "42883" ||
-      rpcCode === "PGRST202" ||
-      rpcMessage.includes("p_user_id") ||
-      rpcMessage.includes("toggle_list_like(uuid) does not exist")
+      (rpcCode === "42883" || rpcCode === "PGRST202" || rpcMessage.includes("p_user_id")) && rpcMessage.includes("toggle_list_like(uuid) does not exist")
     );
 
killedBy: listSocialService toggleListLike uses legacy rpc params when backend requires p_user_id
statusReason: missing p_user_id

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:40:7
     Boolean(error) &&
     (
       rpcCode === "42883" ||
-      rpcCode === "PGRST202" ||
+      false ||
       rpcMessage.includes("p_user_id") ||
       rpcMessage.includes("toggle_list_like(uuid) does not exist")

[Survived] EqualityOperator
features/lists/services/listSocialService.ts:40:7
     Boolean(error) &&
     (
       rpcCode === "42883" ||
-      rpcCode === "PGRST202" ||
+      rpcCode !== "PGRST202" ||
       rpcMessage.includes("p_user_id") ||
       rpcMessage.includes("toggle_list_like(uuid) does not exist")

[Survived] StringLiteral
features/lists/services/listSocialService.ts:41:27
     (
       rpcCode === "42883" ||
       rpcCode === "PGRST202" ||
-      rpcMessage.includes("p_user_id") ||
+      rpcMessage.includes("") ||
       rpcMessage.includes("toggle_list_like(uuid) does not exist")
     );

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:45:7
       rpcMessage.includes("toggle_list_like(uuid) does not exist")
     );
 
-  if (needsLegacyParams) {
+  if (false) {
     const legacyResponse = await supabase.rpc("toggle_list_like", {
       p_list_id: listId,
killedBy: listSocialService toggleListLike uses legacy rpc params when backend requires p_user_id
statusReason: missing p_user_id

[Killed] BlockStatement
features/lists/services/listSocialService.ts:45:26
       rpcMessage.includes("toggle_list_like(uuid) does not exist")
     );
 
-  if (needsLegacyParams) {
-    const legacyResponse = await supabase.rpc("toggle_list_like", {
-      p_list_id: listId,
-      p_user_id: userId,
-    });
-    data = legacyResponse.data;
-    error = legacyResponse.error;
-  }
+  if (needsLegacyParams) {}
 
   if (error) {
killedBy: listSocialService toggleListLike uses legacy rpc params when backend requires p_user_id
statusReason: missing p_user_id

[Killed] ObjectLiteral
features/lists/services/listSocialService.ts:46:67
     );
 
   if (needsLegacyParams) {
-    const legacyResponse = await supabase.rpc("toggle_list_like", {
-      p_list_id: listId,
-      p_user_id: userId,
-    });
+    const legacyResponse = await supabase.rpc("toggle_list_like", {});
     data = legacyResponse.data;
     error = legacyResponse.error;
killedBy: listSocialService toggleListLike uses legacy rpc params when backend requires p_user_id
statusReason: expected 2nd "vi.fn()" call to have been called with [ 'toggle_list_like', …(1) ]

[Killed] BlockStatement
features/lists/services/listSocialService.ts:54:14
     error = legacyResponse.error;
   }
 
-  if (error) {
-    // Local environments may not have the RPC created yet.
-    if ((error as { code?: string }).code === "404") {
-      try {
-        if (!userId) {
-          throw error;
-        }
-        return await toggleListLikeFallback(listId, userId);
-      } catch (fallbackError) {
-        const fallbackCode = (fallbackError as { code?: string }).code;
-        const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
-        const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
-
-        if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
-          console.warn("List likes tables/RPC are not available in localhost. Skipping persistence.");
-          return true;
-        }
-
-        throw fallbackError;
-      }
-    }
-    throw error;
-  }
+  if (error) {}
   return Boolean(data);
 }
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: promise resolved "false" instead of rejecting

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:56:9
 
   if (error) {
     // Local environments may not have the RPC created yet.
-    if ((error as { code?: string }).code === "404") {
+    if ((error as {
+  code?: string;
+}).code !== "404") {
       try {
         if (!userId) {
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: missing function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:56:9
 
   if (error) {
     // Local environments may not have the RPC created yet.
-    if ((error as { code?: string }).code === "404") {
+    if (true) {
       try {
         if (!userId) {
killedBy: listSocialService toggleListLike throws non-404 rpc errors
statusReason: expected TypeError: Cannot read properties of unde… to deeply equal { code: '500', message: 'db failure' }

[Killed] BlockStatement
features/lists/services/listSocialService.ts:57:11
   if (error) {
     // Local environments may not have the RPC created yet.
     if ((error as { code?: string }).code === "404") {
-      try {
-        if (!userId) {
-          throw error;
-        }
-        return await toggleListLikeFallback(listId, userId);
-      } catch (fallbackError) {
+      try {} catch (fallbackError) {
         const fallbackCode = (fallbackError as { code?: string }).code;
         const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: missing function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:58:13
     // Local environments may not have the RPC created yet.
     if ((error as { code?: string }).code === "404") {
       try {
-        if (!userId) {
+        if (false) {
           throw error;
         }
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: expected TypeError: Cannot read properties of unde… to deeply equal { code: '404', message: 'not found' }

[Killed] BlockStatement
features/lists/services/listSocialService.ts:58:22
     // Local environments may not have the RPC created yet.
     if ((error as { code?: string }).code === "404") {
       try {
-        if (!userId) {
-          throw error;
-        }
+        if (!userId) {}
         return await toggleListLikeFallback(listId, userId);
       } catch (fallbackError) {
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: expected TypeError: Cannot read properties of unde… to deeply equal { code: '404', message: 'not found' }

[Killed] BlockStatement
features/lists/services/listSocialService.ts:62:31
           throw error;
         }
         return await toggleListLikeFallback(listId, userId);
-      } catch (fallbackError) {
-        const fallbackCode = (fallbackError as { code?: string }).code;
-        const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
-        const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
-
-        if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
-          console.warn("List likes tables/RPC are not available in localhost. Skipping persistence.");
-          return true;
-        }
-
-        throw fallbackError;
-      }
+      } catch (fallbackError) {}
     }
     throw error;
killedBy: listSocialService toggleListLike returns true on localhost when likes table is missing in fallback
statusReason: missing function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:64:33
         return await toggleListLikeFallback(listId, userId);
       } catch (fallbackError) {
         const fallbackCode = (fallbackError as { code?: string }).code;
-        const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
+        const fallbackMessage = true;
         const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
 
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: expected TypeError: fallbackMessage.includes is no… to deeply equal { code: '404', message: 'not found' }

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:64:33
         return await toggleListLikeFallback(listId, userId);
       } catch (fallbackError) {
         const fallbackCode = (fallbackError as { code?: string }).code;
-        const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
+        const fallbackMessage = false;
         const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
 
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: expected TypeError: fallbackMessage.includes is no… to deeply equal { code: '404', message: 'not found' }

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:65:58
       } catch (fallbackError) {
         const fallbackCode = (fallbackError as { code?: string }).code;
         const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
-        const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
+        const isLocal = typeof window !== "undefined" && window.location.hostname !== "localhost";
 
         if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
killedBy: listSocialService toggleListLike returns true on localhost when likes table is missing in fallback
statusReason: relation does not exist

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:65:25
       } catch (fallbackError) {
         const fallbackCode = (fallbackError as { code?: string }).code;
         const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
-        const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
+        const isLocal = false;
 
         if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
killedBy: listSocialService toggleListLike returns true on localhost when likes table is missing in fallback
statusReason: relation does not exist

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:67:13
         const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
         const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
 
-        if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
+        if (true) {
           console.warn("List likes tables/RPC are not available in localhost. Skipping persistence.");
           return true;
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: promise resolved "true" instead of rejecting

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:67:13
         const fallbackMessage = (fallbackError as { message?: string }).message?.toLowerCase() || "";
         const isLocal = typeof window !== "undefined" && window.location.hostname === "localhost";
 
-        if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
+        if (isLocal || fallbackCode === "42P01" || fallbackMessage.includes("does not exist")) {
           console.warn("List likes tables/RPC are not available in localhost. Skipping persistence.");
           return true;
killedBy: listSocialService toggleListLike throws when rpc 404 happens without user id for fallback
statusReason: promise resolved "true" instead of rejecting

[Killed] BooleanLiteral
features/lists/services/listSocialService.ts:69:18
 
         if (isLocal && (fallbackCode === "42P01" || fallbackMessage.includes("does not exist"))) {
           console.warn("List likes tables/RPC are not available in localhost. Skipping persistence.");
-          return true;
+          return false;
         }
 
killedBy: listSocialService toggleListLike returns true on localhost when likes table is missing in fallback
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
features/lists/services/listSocialService.ts:82:11
 
 async function toggleListLikeFallback(listId: string, userId: string): Promise<boolean> {
   const { data: existingLike, error: fetchError } = await supabase
-    .from("list_likes")
+    .from("")
     .select("list_id")
     .eq("list_id", listId)

[Survived] StringLiteral
features/lists/services/listSocialService.ts:83:13
 async function toggleListLikeFallback(listId: string, userId: string): Promise<boolean> {
   const { data: existingLike, error: fetchError } = await supabase
     .from("list_likes")
-    .select("list_id")
+    .select("")
     .eq("list_id", listId)
     .eq("user_id", userId)

[Survived] StringLiteral
features/lists/services/listSocialService.ts:84:9
   const { data: existingLike, error: fetchError } = await supabase
     .from("list_likes")
     .select("list_id")
-    .eq("list_id", listId)
+    .eq("", listId)
     .eq("user_id", userId)
     .maybeSingle();

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:88:7
     .eq("user_id", userId)
     .maybeSingle();
 
-  if (fetchError) throw fetchError;
+  if (true) throw fetchError;
 
   if (existingLike) {
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: Cannot read properties of null (reading 'code')

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:88:7
     .eq("user_id", userId)
     .maybeSingle();
 
-  if (fetchError) throw fetchError;
+  if (false) throw fetchError;
 
   if (existingLike) {
killedBy: listSocialService toggleListLike returns true on localhost when likes table is missing in fallback
statusReason: Cannot read properties of undefined (reading 'insert')

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:90:7
 
   if (fetchError) throw fetchError;
 
-  if (existingLike) {
+  if (false) {
     const { error: deleteError } = await supabase
       .from("list_likes")
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: supabase.from(...).insert is not a function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:90:7
 
   if (fetchError) throw fetchError;
 
-  if (existingLike) {
+  if (true) {
     const { error: deleteError } = await supabase
       .from("list_likes")
killedBy: listSocialService toggleListLike fallback inserts like when no existing row on rpc 404
statusReason: supabase.from(...).delete is not a function

[Survived] StringLiteral
features/lists/services/listSocialService.ts:95:11
       .from("list_likes")
       .delete()
       .eq("list_id", listId)
-      .eq("user_id", userId);
+      .eq("", userId);
 
     if (deleteError) throw deleteError;

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:97:9
       .eq("list_id", listId)
       .eq("user_id", userId);
 
-    if (deleteError) throw deleteError;
+    if (true) throw deleteError;
     return false;
   }
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: Cannot read properties of null (reading 'code')

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:97:9
       .eq("list_id", listId)
       .eq("user_id", userId);
 
-    if (deleteError) throw deleteError;
+    if (false) throw deleteError;
     return false;
   }

[Killed] BooleanLiteral
features/lists/services/listSocialService.ts:98:12
       .eq("user_id", userId);
 
     if (deleteError) throw deleteError;
-    return false;
+    return true;
   }
 
killedBy: listSocialService toggleListLike fallback deletes existing like on rpc 404
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:105:7
     .from("list_likes")
     .insert({ list_id: listId, user_id: userId });
 
-  if (insertError) throw insertError;
+  if (true) throw insertError;
   return true;
 }
killedBy: listSocialService toggleListLike fallback inserts like when no existing row on rpc 404
statusReason: Cannot read properties of null (reading 'code')

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:105:7
     .from("list_likes")
     .insert({ list_id: listId, user_id: userId });
 
-  if (insertError) throw insertError;
+  if (false) throw insertError;
   return true;
 }

[Killed] BooleanLiteral
features/lists/services/listSocialService.ts:106:10
     .insert({ list_id: listId, user_id: userId });
 
   if (insertError) throw insertError;
-  return true;
+  return false;
 }
 
killedBy: listSocialService toggleListLike fallback inserts like when no existing row on rpc 404
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
features/lists/services/listSocialService.ts:111:11
 
 export async function fetchListLikers(listId: string): Promise<ListLiker[]> {
   const { data: likesData, error: likesError } = await supabase
-    .from("list_likes")
+    .from("")
     .select("user_id, created_at")
     .eq("list_id", listId)

[Survived] StringLiteral
features/lists/services/listSocialService.ts:113:9
   const { data: likesData, error: likesError } = await supabase
     .from("list_likes")
     .select("user_id, created_at")
-    .eq("list_id", listId)
+    .eq("", listId)
     .order("created_at", { ascending: false });
 

[Survived] BooleanLiteral
features/lists/services/listSocialService.ts:114:39
     .from("list_likes")
     .select("user_id, created_at")
     .eq("list_id", listId)
-    .order("created_at", { ascending: false });
+    .order("created_at", { ascending: true });
 
   if (likesError) throw likesError;

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:116:7
     .eq("list_id", listId)
     .order("created_at", { ascending: false });
 
-  if (likesError) throw likesError;
+  if (true) throw likesError;
 
   const likes = (likesData || []) as { user_id: string; created_at: string }[];
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: null

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:116:7
     .eq("list_id", listId)
     .order("created_at", { ascending: false });
 
-  if (likesError) throw likesError;
+  if (false) throw likesError;
 
   const likes = (likesData || []) as { user_id: string; created_at: string }[];
killedBy: listSocialService fetchListLikers throws when likes fetch fails
statusReason: promise resolved "[]" instead of rejecting

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:119:7
   if (likesError) throw likesError;
 
   const likes = (likesData || []) as { user_id: string; created_at: string }[];
-  if (likes.length === 0) return [];
+  if (false) return [];
 
   const userIds = Array.from(new Set(likes.map((like) => like.user_id)));
killedBy: listSocialService fetchListLikers returns empty array when list has no likes
statusReason: Cannot read properties of undefined (reading 'select')

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:119:7
   if (likesError) throw likesError;
 
   const likes = (likesData || []) as { user_id: string; created_at: string }[];
-  if (likes.length === 0) return [];
+  if (true) return [];
 
   const userIds = Array.from(new Set(likes.map((like) => like.user_id)));
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: expected [] to deeply equal [ { id: 'u1', …(3) }, …(1) ]

[Survived] ArrowFunction
features/lists/services/listSocialService.ts:121:48
   const likes = (likesData || []) as { user_id: string; created_at: string }[];
   if (likes.length === 0) return [];
 
-  const userIds = Array.from(new Set(likes.map((like) => like.user_id)));
+  const userIds = Array.from(new Set(likes.map(() => undefined)));
 
   const { data: profilesData, error: profilesError } = await supabase

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:128:7
     .select("id, username, avatar_url")
     .in("id", userIds);
 
-  if (profilesError) throw profilesError;
+  if (true) throw profilesError;
 
   const profileById = new Map(
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: null

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:128:7
     .select("id, username, avatar_url")
     .in("id", userIds);
 
-  if (profilesError) throw profilesError;
+  if (false) throw profilesError;
 
   const profileById = new Map(

[Killed] ArrowFunction
features/lists/services/listSocialService.ts:131:97
   if (profilesError) throw profilesError;
 
   const profileById = new Map(
-    ((profilesData || []) as { id: string; username: string; avatar_url: string | null }[]).map((profile) => [
-      profile.id,
-      profile,
-    ])
+    ((profilesData || []) as { id: string; username: string; avatar_url: string | null }[]).map(() => undefined)
   );
 
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: Iterator value undefined is not an entry object

[Killed] MethodExpression
features/lists/services/listSocialService.ts:137:10
     ])
   );
 
-  return likes
-    .map((like) => {
-      const profile = profileById.get(like.user_id);
-      if (!profile) return null;
-      return {
-        id: profile.id,
-        username: profile.username,
-        avatar_url: profile.avatar_url,
-        liked_at: like.created_at,
-      };
-    })
-    .filter((liker): liker is ListLiker => liker !== null);
+  return likes.map(like => {
+  const profile = profileById.get(like.user_id);
+  if (!profile) return null;
+  return {
+    id: profile.id,
+    username: profile.username,
+    avatar_url: profile.avatar_url,
+    liked_at: like.created_at
+  };
+});
 }
 
killedBy: listSocialService fetchListLikers filters likes that have no matching profile
statusReason: expected [ null ] to deeply equal []

[Killed] BlockStatement
features/lists/services/listSocialService.ts:138:20
   );
 
   return likes
-    .map((like) => {
-      const profile = profileById.get(like.user_id);
-      if (!profile) return null;
-      return {
-        id: profile.id,
-        username: profile.username,
-        avatar_url: profile.avatar_url,
-        liked_at: like.created_at,
-      };
-    })
+    .map((like) => {})
     .filter((liker): liker is ListLiker => liker !== null);
 }
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: expected [ undefined, undefined ] to deeply equal [ { id: 'u1', …(3) }, …(1) ]

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:140:11
   return likes
     .map((like) => {
       const profile = profileById.get(like.user_id);
-      if (!profile) return null;
+      if (false) return null;
       return {
         id: profile.id,
killedBy: listSocialService fetchListLikers filters likes that have no matching profile
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
features/lists/services/listSocialService.ts:140:11
   return likes
     .map((like) => {
       const profile = profileById.get(like.user_id);
-      if (!profile) return null;
+      if (profile) return null;
       return {
         id: profile.id,
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: expected [] to deeply equal [ { id: 'u1', …(3) }, …(1) ]

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:148:44
         liked_at: like.created_at,
       };
     })
-    .filter((liker): liker is ListLiker => liker !== null);
+    .filter((liker): liker is ListLiker => liker === null);
 }
 
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: expected [] to deeply equal [ { id: 'u1', …(3) }, …(1) ]

[Killed] ArrowFunction
features/lists/services/listSocialService.ts:148:13
         liked_at: like.created_at,
       };
     })
-    .filter((liker): liker is ListLiker => liker !== null);
+    .filter(() => undefined);
 }
 
killedBy: listSocialService fetchListLikers returns likers joined with profiles
statusReason: expected [] to deeply equal [ { id: 'u1', …(3) }, …(1) ]

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:161:27
   listType: "private" | "partial_shared" | "full_shared",
   options: CloneListOptions = {}
 ): Promise<CustomList> {
-  const collaboratorIds = options.collaboratorIds || [];
+  const collaboratorIds = false;
   const shouldCopyRatings = options.copyRatings ?? true;
   const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
killedBy: listSocialService cloneListService throws when shared clone has no collaborators
statusReason: expected [Function] to throw error including 'Listas compartilhadas exigem pelo men…' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:161:27
   listType: "private" | "partial_shared" | "full_shared",
   options: CloneListOptions = {}
 ): Promise<CustomList> {
-  const collaboratorIds = options.collaboratorIds || [];
+  const collaboratorIds = true;
   const shouldCopyRatings = options.copyRatings ?? true;
   const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
killedBy: listSocialService cloneListService throws when shared clone has no collaborators
statusReason: expected [Function] to throw error including 'Listas compartilhadas exigem pelo men…' but got 'Cannot read properties of undefined (…'
