[NoCoverage] BooleanLiteral
features/lists/services/listSocialService.ts:162:52
   options: CloneListOptions = {}
 ): Promise<CustomList> {
   const collaboratorIds = options.collaboratorIds || [];
-  const shouldCopyRatings = options.copyRatings ?? true;
+  const shouldCopyRatings = options.copyRatings ?? false;
   const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
 

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:162:29
   options: CloneListOptions = {}
 ): Promise<CustomList> {
   const collaboratorIds = options.collaboratorIds || [];
-  const shouldCopyRatings = options.copyRatings ?? true;
+  const shouldCopyRatings = options.copyRatings && true;
   const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
 

[Survived] BooleanLiteral
features/lists/services/listSocialService.ts:163:68
 ): Promise<CustomList> {
   const collaboratorIds = options.collaboratorIds || [];
   const shouldCopyRatings = options.copyRatings ?? true;
-  const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
+  const ratingsExclusiveToList = options.ratingsExclusiveToList ?? false;
 
   if (listType !== "private" && collaboratorIds.length === 0) {

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:163:34
 ): Promise<CustomList> {
   const collaboratorIds = options.collaboratorIds || [];
   const shouldCopyRatings = options.copyRatings ?? true;
-  const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
+  const ratingsExclusiveToList = options.ratingsExclusiveToList && true;
 
   if (listType !== "private" && collaboratorIds.length === 0) {

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:165:7
   const shouldCopyRatings = options.copyRatings ?? true;
   const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
 
-  if (listType !== "private" && collaboratorIds.length === 0) {
+  if (listType !== "private" || collaboratorIds.length === 0) {
     throw new Error("Listas compartilhadas exigem pelo menos um colaborador.");
   }
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: Listas compartilhadas exigem pelo menos um colaborador.

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:165:7
   const shouldCopyRatings = options.copyRatings ?? true;
   const ratingsExclusiveToList = options.ratingsExclusiveToList ?? true;
 
-  if (listType !== "private" && collaboratorIds.length === 0) {
+  if (false) {
     throw new Error("Listas compartilhadas exigem pelo menos um colaborador.");
   }
killedBy: listSocialService cloneListService throws when shared clone has no collaborators
statusReason: expected [Function] to throw error including 'Listas compartilhadas exigem pelo men…' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:170:7
   }
 
   let sourceMeta: SourceListMeta | null = null;
-  if (shouldCopyRatings) {
+  if (true) {
     const { data: sourceList, error: sourceListError } = await supabase
       .from("lists")
killedBy: listSocialService cloneListService throws when movie list fetch fails
statusReason: expected [Function] to throw error including 'movies-failed' but got '__vite_ssr_import_0__.supabase.from(.…'

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:170:7
   }
 
   let sourceMeta: SourceListMeta | null = null;
-  if (shouldCopyRatings) {
+  if (false) {
     const { data: sourceList, error: sourceListError } = await supabase
       .from("lists")
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Survived] StringLiteral
features/lists/services/listSocialService.ts:173:15
   if (shouldCopyRatings) {
     const { data: sourceList, error: sourceListError } = await supabase
       .from("lists")
-      .select("owner_id, description, has_rating, rating_type, manual_rating, auto_sync, type")
+      .select("")
       .eq("id", sourceListId)
       .single();

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:177:9
       .eq("id", sourceListId)
       .single();
 
-    if (sourceListError || !sourceList) throw sourceListError || new Error("Lista de origem não encontrada.");
+    if (false) throw sourceListError || new Error("Lista de origem não encontrada.");
     sourceMeta = sourceList as SourceListMeta;
   }
killedBy: listSocialService cloneListService throws when source list metadata cannot be loaded
statusReason: expected [Function] to throw error including 'source-failed' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:177:47
       .eq("id", sourceListId)
       .single();
 
-    if (sourceListError || !sourceList) throw sourceListError || new Error("Lista de origem não encontrada.");
+    if (sourceListError || !sourceList) throw sourceListError && new Error("Lista de origem não encontrada.");
     sourceMeta = sourceList as SourceListMeta;
   }
killedBy: listSocialService cloneListService throws when source list metadata cannot be loaded
statusReason: expected [Function] to throw error including 'source-failed' but got 'Lista de origem não encontrada.'

[Killed] OptionalChaining
features/lists/services/listSocialService.ts:186:18
   const newList = await createListRecord({
     ownerId: newUserId,
     name: newTitle,
-    description: sourceMeta?.description || "",
+    description: sourceMeta.description || "",
     type: listType,
     has_rating: sourceMeta?.has_rating ?? false,
killedBy: listSocialService cloneListService throws when movie list fetch fails
statusReason: expected [Function] to throw error including 'movies-failed' but got 'Cannot read properties of null (readi…'

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:186:18
   const newList = await createListRecord({
     ownerId: newUserId,
     name: newTitle,
-    description: sourceMeta?.description || "",
+    description: sourceMeta?.description && "",
     type: listType,
     has_rating: sourceMeta?.has_rating ?? false,

[Killed] OptionalChaining
features/lists/services/listSocialService.ts:188:17
     name: newTitle,
     description: sourceMeta?.description || "",
     type: listType,
-    has_rating: sourceMeta?.has_rating ?? false,
+    has_rating: sourceMeta.has_rating ?? false,
     rating_type: sourceMeta?.rating_type ?? null,
     manual_rating: sourceMeta?.manual_rating ?? null,
killedBy: listSocialService cloneListService throws when movie list fetch fails
statusReason: expected [Function] to throw error including 'movies-failed' but got 'Cannot read properties of null (readi…'

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:188:17
     name: newTitle,
     description: sourceMeta?.description || "",
     type: listType,
-    has_rating: sourceMeta?.has_rating ?? false,
+    has_rating: sourceMeta?.has_rating && false,
     rating_type: sourceMeta?.rating_type ?? null,
     manual_rating: sourceMeta?.manual_rating ?? null,

[Killed] OptionalChaining
features/lists/services/listSocialService.ts:189:18
     description: sourceMeta?.description || "",
     type: listType,
     has_rating: sourceMeta?.has_rating ?? false,
-    rating_type: sourceMeta?.rating_type ?? null,
+    rating_type: sourceMeta.rating_type ?? null,
     manual_rating: sourceMeta?.manual_rating ?? null,
     auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
killedBy: listSocialService cloneListService throws when movie list fetch fails
statusReason: expected [Function] to throw error including 'movies-failed' but got 'Cannot read properties of null (readi…'

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:189:18
     description: sourceMeta?.description || "",
     type: listType,
     has_rating: sourceMeta?.has_rating ?? false,
-    rating_type: sourceMeta?.rating_type ?? null,
+    rating_type: sourceMeta?.rating_type && null,
     manual_rating: sourceMeta?.manual_rating ?? null,
     auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false

[Killed] OptionalChaining
features/lists/services/listSocialService.ts:190:20
     type: listType,
     has_rating: sourceMeta?.has_rating ?? false,
     rating_type: sourceMeta?.rating_type ?? null,
-    manual_rating: sourceMeta?.manual_rating ?? null,
+    manual_rating: sourceMeta.manual_rating ?? null,
     auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
   });
killedBy: listSocialService cloneListService throws when movie list fetch fails
statusReason: expected [Function] to throw error including 'movies-failed' but got 'Cannot read properties of null (readi…'

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:190:20
     type: listType,
     has_rating: sourceMeta?.has_rating ?? false,
     rating_type: sourceMeta?.rating_type ?? null,
-    manual_rating: sourceMeta?.manual_rating ?? null,
+    manual_rating: sourceMeta?.manual_rating && null,
     auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
   });

[Survived] EqualityOperator
features/lists/services/listSocialService.ts:191:16
     has_rating: sourceMeta?.has_rating ?? false,
     rating_type: sourceMeta?.rating_type ?? null,
     manual_rating: sourceMeta?.manual_rating ?? null,
-    auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
+    auto_sync: listType !== "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
   });
 

[Survived] BooleanLiteral
features/lists/services/listSocialService.ts:191:80
     has_rating: sourceMeta?.has_rating ?? false,
     rating_type: sourceMeta?.rating_type ?? null,
     manual_rating: sourceMeta?.manual_rating ?? null,
-    auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
+    auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : true
   });
 

[Killed] BlockStatement
features/lists/services/listSocialService.ts:194:31
     auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
   });
 
-  if (listType !== "private") {
-    await addCollaboratorsToList(newList.id, collaboratorIds);
-    await notifyListCollaborators(newUserId, newList.id, listType, collaboratorIds);
-  }
+  if (listType !== "private") {}
 
   // Busca os filmes da lista de origem
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'new_123', [ 'u2' ] ]

Number of calls: 0

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:194:7
     auto_sync: listType === "full_shared" ? (sourceMeta?.auto_sync ?? false) : false
   });
 
-  if (listType !== "private") {
+  if (listType === "private") {
     await addCollaboratorsToList(newList.id, collaboratorIds);
     await notifyListCollaborators(newUserId, newList.id, listType, collaboratorIds);
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'new_123', [ 'u2' ] ]

Number of calls: 0

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:208:7
   if (fetchError) throw fetchError;
 
   // Insere os filmes na nova lista se houver filmes
-  if (movies && movies.length > 0) {
+  if (false) {
     const toInsert = movies.map(m => ({ 
       list_id: newList.id, 
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: supabase.from(...).select is not a function

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:208:17
   if (fetchError) throw fetchError;
 
   // Insere os filmes na nova lista se houver filmes
-  if (movies && movies.length > 0) {
+  if (movies && movies.length <= 0) {
     const toInsert = movies.map(m => ({ 
       list_id: newList.id, 
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: supabase.from(...).select is not a function

[Survived] ArrowFunction
features/lists/services/listSocialService.ts:209:33
 
   // Insere os filmes na nova lista se houver filmes
   if (movies && movies.length > 0) {
-    const toInsert = movies.map(m => ({ 
-      list_id: newList.id, 
-      tmdb_id: m.tmdb_id 
-    }));
+    const toInsert = movies.map(() => undefined);
     
     const { error: insError } = await supabase

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:218:9
       .from("list_movies")
       .insert(toInsert);
 
-    if (insError) throw insError;
+    if (true) throw insError;
   }
 
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: null

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:218:9
       .from("list_movies")
       .insert(toInsert);
 
-    if (insError) throw insError;
+    if (false) throw insError;
   }
 
killedBy: listSocialService cloneListService throws when movie insertion fails
statusReason: promise resolved "{ id: 'new_123', owner_id: 'u1', …(3) }" instead of rejecting

[Killed] BlockStatement
features/lists/services/listSocialService.ts:221:40
     if (insError) throw insError;
   }
 
-  if (shouldCopyRatings && sourceMeta) {
-    const tmdbIds = (movies || []).map((movie) => movie.tmdb_id);
-    await copyRatingsDuringClone({
-      sourceListId,
-      sourceMeta,
-      targetListId: newList.id,
-      targetUserId: newUserId,
-      targetListType: listType,
-      tmdbIds,
-      ratingsExclusiveToList,
-    });
-  }
+  if (shouldCopyRatings && sourceMeta) {}
 
   return newList;
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:221:7
     if (insError) throw insError;
   }
 
-  if (shouldCopyRatings && sourceMeta) {
+  if (false) {
     const tmdbIds = (movies || []).map((movie) => movie.tmdb_id);
     await copyRatingsDuringClone({
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:222:22
   }
 
   if (shouldCopyRatings && sourceMeta) {
-    const tmdbIds = (movies || []).map((movie) => movie.tmdb_id);
+    const tmdbIds = (true).map((movie) => movie.tmdb_id);
     await copyRatingsDuringClone({
       sourceListId,
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:222:22
   }
 
   if (shouldCopyRatings && sourceMeta) {
-    const tmdbIds = (movies || []).map((movie) => movie.tmdb_id);
+    const tmdbIds = (movies && []).map((movie) => movie.tmdb_id);
     await copyRatingsDuringClone({
       sourceListId,
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:258:7
 
 async function copyRatingsDuringClone(payload: CloneRatingsPayload): Promise<void> {
   const { sourceListId, sourceMeta, targetListId, targetUserId, targetListType, tmdbIds, ratingsExclusiveToList } = payload;
-  if (tmdbIds.length === 0) return;
+  if (tmdbIds.length !== 0) return;
 
   const snapshots =
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:258:7
 
 async function copyRatingsDuringClone(payload: CloneRatingsPayload): Promise<void> {
   const { sourceListId, sourceMeta, targetListId, targetUserId, targetListType, tmdbIds, ratingsExclusiveToList } = payload;
-  if (tmdbIds.length === 0) return;
+  if (true) return;
 
   const snapshots =
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:261:5
   if (tmdbIds.length === 0) return;
 
   const snapshots =
-    sourceMeta.type === "private"
+    sourceMeta.type !== "private"
       ? await readRatingsFromPrivateSource(sourceMeta.owner_id, tmdbIds)
       : await readRatingsFromSharedSource(sourceListId, sourceMeta.owner_id, tmdbIds);
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: expected "vi.fn()" to not be called with arguments: [ 'reviews' ]

Received:

  1st vi.fn() call:

  [
-   "reviews",

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:261:5
   if (tmdbIds.length === 0) return;
 
   const snapshots =
-    sourceMeta.type === "private"
+    true
       ? await readRatingsFromPrivateSource(sourceMeta.owner_id, tmdbIds)
       : await readRatingsFromSharedSource(sourceListId, sourceMeta.owner_id, tmdbIds);
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: expected "vi.fn()" to not be called with arguments: [ 'reviews' ]

Received:

  1st vi.fn() call:

  [
-   "reviews",

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:265:7
       ? await readRatingsFromPrivateSource(sourceMeta.owner_id, tmdbIds)
       : await readRatingsFromSharedSource(sourceListId, sourceMeta.owner_id, tmdbIds);
 
-  if (snapshots.length === 0) return;
+  if (true) return;
 
   if (targetListType === "partial_shared") {
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:265:7
       ? await readRatingsFromPrivateSource(sourceMeta.owner_id, tmdbIds)
       : await readRatingsFromSharedSource(sourceListId, sourceMeta.owner_id, tmdbIds);
 
-  if (snapshots.length === 0) return;
+  if (snapshots.length !== 0) return;
 
   if (targetListType === "partial_shared") {
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_reviews' ]

Received:

  1st vi.fn() call:

  [
-   "list_reviews",

[Killed] BlockStatement
features/lists/services/listSocialService.ts:267:44
 
   if (snapshots.length === 0) return;
 
-  if (targetListType === "partial_shared") {
-    await supabase.from("list_reviews").insert(
-      snapshots.map((item) => ({
-        list_id: targetListId,
-        tmdb_id: item.tmdb_id,
-        user_id: targetUserId,
-        rating: item.rating,
-        review: item.review,
-        recommended: item.recommended,
-        location: item.location || null,
-        runtime: item.runtime || null,
-      }))
-    );
-  }
+  if (targetListType === "partial_shared") {}
 
   if (targetListType === "full_shared") {
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: supabase.from(...).upsert is not a function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:267:7
 
   if (snapshots.length === 0) return;
 
-  if (targetListType === "partial_shared") {
+  if (true) {
     await supabase.from("list_reviews").insert(
       snapshots.map((item) => ({
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: Cannot read properties of undefined (reading 'insert')

[Survived] ArrowFunction
features/lists/services/listSocialService.ts:269:21
 
   if (targetListType === "partial_shared") {
     await supabase.from("list_reviews").insert(
-      snapshots.map((item) => ({
-        list_id: targetListId,
-        tmdb_id: item.tmdb_id,
-        user_id: targetUserId,
-        rating: item.rating,
-        review: item.review,
-        recommended: item.recommended,
-        location: item.location || null,
-        runtime: item.runtime || null,
-      }))
+      snapshots.map(() => undefined)
     );
   }

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:276:19
         rating: item.rating,
         review: item.review,
         recommended: item.recommended,
-        location: item.location || null,
+        location: item.location && null,
         runtime: item.runtime || null,
       }))

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:276:19
         rating: item.rating,
         review: item.review,
         recommended: item.recommended,
-        location: item.location || null,
+        location: true,
         runtime: item.runtime || null,
       }))

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:277:18
         review: item.review,
         recommended: item.recommended,
         location: item.location || null,
-        runtime: item.runtime || null,
+        runtime: true,
       }))
     );

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:277:18
         review: item.review,
         recommended: item.recommended,
         location: item.location || null,
-        runtime: item.runtime || null,
+        runtime: item.runtime && null,
       }))
     );

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:282:7
     );
   }
 
-  if (targetListType === "full_shared") {
+  if (targetListType !== "full_shared") {
     await supabase.from("list_reviews").insert(
       snapshots.map((item) => ({
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: supabase.from(...).insert is not a function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:282:7
     );
   }
 
-  if (targetListType === "full_shared") {
+  if (true) {
     await supabase.from("list_reviews").insert(
       snapshots.map((item) => ({
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: supabase.from(...).insert is not a function

[Survived] ArrowFunction
features/lists/services/listSocialService.ts:284:21
 
   if (targetListType === "full_shared") {
     await supabase.from("list_reviews").insert(
-      snapshots.map((item) => ({
-        list_id: targetListId,
-        tmdb_id: item.tmdb_id,
-        user_id: null,
-        rating: item.rating,
-        review: item.review,
-        recommended: item.recommended,
-      }))
+      snapshots.map(() => undefined)
     );
   }

[Survived] ObjectLiteral
features/lists/services/listSocialService.ts:284:32
 
   if (targetListType === "full_shared") {
     await supabase.from("list_reviews").insert(
-      snapshots.map((item) => ({
-        list_id: targetListId,
-        tmdb_id: item.tmdb_id,
-        user_id: null,
-        rating: item.rating,
-        review: item.review,
-        recommended: item.recommended,
-      }))
+      snapshots.map((item) => ({}))
     );
   }

[Killed] EqualityOperator
features/lists/services/listSocialService.ts:295:31
     );
   }
 
-  const shouldCopyToProfile = targetListType === "private" || !ratingsExclusiveToList;
+  const shouldCopyToProfile = targetListType !== "private" || !ratingsExclusiveToList;
   if (shouldCopyToProfile) {
     await supabase.from("reviews").upsert(
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: Cannot read properties of undefined (reading 'upsert')

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:295:31
     );
   }
 
-  const shouldCopyToProfile = targetListType === "private" || !ratingsExclusiveToList;
+  const shouldCopyToProfile = targetListType === "private" && !ratingsExclusiveToList;
   if (shouldCopyToProfile) {
     await supabase.from("reviews").upsert(
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: supabase.from(...).select is not a function

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:296:7
   }
 
   const shouldCopyToProfile = targetListType === "private" || !ratingsExclusiveToList;
-  if (shouldCopyToProfile) {
+  if (true) {
     await supabase.from("reviews").upsert(
       snapshots.map((item) => ({
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: Cannot read properties of undefined (reading 'upsert')

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:296:7
   }
 
   const shouldCopyToProfile = targetListType === "private" || !ratingsExclusiveToList;
-  if (shouldCopyToProfile) {
+  if (false) {
     await supabase.from("reviews").upsert(
       snapshots.map((item) => ({
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: supabase.from(...).select is not a function

[Survived] ArrowFunction
features/lists/services/listSocialService.ts:298:21
   const shouldCopyToProfile = targetListType === "private" || !ratingsExclusiveToList;
   if (shouldCopyToProfile) {
     await supabase.from("reviews").upsert(
-      snapshots.map((item) => ({
-        user_id: targetUserId,
-        tmdb_id: item.tmdb_id,
-        rating: item.rating,
-        review: item.review,
-        recommended: item.recommended,
-        location: item.location || null,
-        runtime: item.runtime || null,
-        status: "watched",
-      })),
+      snapshots.map(() => undefined),
       { onConflict: "user_id,tmdb_id" }
     );

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:304:19
         rating: item.rating,
         review: item.review,
         recommended: item.recommended,
-        location: item.location || null,
+        location: false,
         runtime: item.runtime || null,
         status: "watched",

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:305:18
         review: item.review,
         recommended: item.recommended,
         location: item.location || null,
-        runtime: item.runtime || null,
+        runtime: false,
         status: "watched",
       })),

[Killed] BlockStatement
features/lists/services/listSocialService.ts:313:108
   }
 }
 
-async function readRatingsFromPrivateSource(ownerId: string, tmdbIds: number[]): Promise<ReviewSnapshot[]> {
-  const { data, error } = await supabase
-    .from("reviews")
-    .select("tmdb_id, rating, review, recommended, location, runtime")
-    .eq("user_id", ownerId)
-    .in("tmdb_id", tmdbIds);
-
-  if (error) throw error;
-  return (data || []) as ReviewSnapshot[];
-}
+async function readRatingsFromPrivateSource(ownerId: string, tmdbIds: number[]): Promise<ReviewSnapshot[]> {}
 
 async function readRatingsFromSharedSource(
killedBy: listSocialService cloneListService clones shared list with ratings from private source and syncs profile when not exclusive
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] StringLiteral
features/lists/services/listSocialService.ts:316:13
 async function readRatingsFromPrivateSource(ownerId: string, tmdbIds: number[]): Promise<ReviewSnapshot[]> {
   const { data, error } = await supabase
     .from("reviews")
-    .select("tmdb_id, rating, review, recommended, location, runtime")
+    .select("")
     .eq("user_id", ownerId)
     .in("tmdb_id", tmdbIds);

[Survived] StringLiteral
features/lists/services/listSocialService.ts:333:9
     .from("list_reviews")
     .select("tmdb_id, user_id, rating, review, recommended, location, runtime")
     .eq("list_id", sourceListId)
-    .in("tmdb_id", tmdbIds);
+    .in("", tmdbIds);
 
   if (error) throw error;
