[Survived] BlockStatement
features/lists/services/listSocialService.ts:338:90
   if (error) throw error;
 
   const grouped = new Map<number, Array<ReviewSnapshot & { user_id?: string | null }>>();
-  for (const row of (data || []) as Array<ReviewSnapshot & { user_id?: string | null }>) {
-    const list = grouped.get(row.tmdb_id) || [];
-    list.push(row);
-    grouped.set(row.tmdb_id, list);
-  }
+  for (const row of (data || []) as Array<ReviewSnapshot & { user_id?: string | null }>) {}
 
   const snapshots: ReviewSnapshot[] = [];

[Killed] ConditionalExpression
features/lists/services/listSocialService.ts:339:18
 
   const grouped = new Map<number, Array<ReviewSnapshot & { user_id?: string | null }>>();
   for (const row of (data || []) as Array<ReviewSnapshot & { user_id?: string | null }>) {
-    const list = grouped.get(row.tmdb_id) || [];
+    const list = true;
     list.push(row);
     grouped.set(row.tmdb_id, list);
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: list.push is not a function

[Killed] LogicalOperator
features/lists/services/listSocialService.ts:339:18
 
   const grouped = new Map<number, Array<ReviewSnapshot & { user_id?: string | null }>>();
   for (const row of (data || []) as Array<ReviewSnapshot & { user_id?: string | null }>) {
-    const list = grouped.get(row.tmdb_id) || [];
+    const list = grouped.get(row.tmdb_id) && [];
     list.push(row);
     grouped.set(row.tmdb_id, list);
killedBy: listSocialService cloneListService clones full shared target from shared source using grouped review rows
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] ArrayDeclaration
features/lists/services/listSocialService.ts:344:39
     grouped.set(row.tmdb_id, list);
   }
 
-  const snapshots: ReviewSnapshot[] = [];
+  const snapshots: ReviewSnapshot[] = ["Stryker was here"];
   for (const [tmdbId, rows] of grouped.entries()) {
     const groupRow = rows.find((item) => item.user_id == null);

[Survived] BlockStatement
features/lists/services/listSocialService.ts:345:51
   }
 
   const snapshots: ReviewSnapshot[] = [];
-  for (const [tmdbId, rows] of grouped.entries()) {
-    const groupRow = rows.find((item) => item.user_id == null);
-    const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
-    const chosen = groupRow || ownerRow || rows[0];
-    if (!chosen) continue;
-    snapshots.push({
-      tmdb_id: tmdbId,
-      rating: chosen.rating,
-      review: chosen.review,
-      recommended: chosen.recommended,
-      location: chosen.location || null,
-      runtime: chosen.runtime || null,
-    });
-  }
+  for (const [tmdbId, rows] of grouped.entries()) {}
 
   return snapshots;

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:346:42
 
   const snapshots: ReviewSnapshot[] = [];
   for (const [tmdbId, rows] of grouped.entries()) {
-    const groupRow = rows.find((item) => item.user_id == null);
+    const groupRow = rows.find((item) => true);
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
     const chosen = groupRow || ownerRow || rows[0];

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:346:42
 
   const snapshots: ReviewSnapshot[] = [];
   for (const [tmdbId, rows] of grouped.entries()) {
-    const groupRow = rows.find((item) => item.user_id == null);
+    const groupRow = rows.find((item) => false);
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
     const chosen = groupRow || ownerRow || rows[0];

[Survived] ArrowFunction
features/lists/services/listSocialService.ts:347:32
   const snapshots: ReviewSnapshot[] = [];
   for (const [tmdbId, rows] of grouped.entries()) {
     const groupRow = rows.find((item) => item.user_id == null);
-    const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
+    const ownerRow = rows.find(() => undefined);
     const chosen = groupRow || ownerRow || rows[0];
     if (!chosen) continue;

[Survived] EqualityOperator
features/lists/services/listSocialService.ts:347:42
   const snapshots: ReviewSnapshot[] = [];
   for (const [tmdbId, rows] of grouped.entries()) {
     const groupRow = rows.find((item) => item.user_id == null);
-    const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
+    const ownerRow = rows.find((item) => item.user_id !== sourceOwnerId);
     const chosen = groupRow || ownerRow || rows[0];
     if (!chosen) continue;

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:348:20
   for (const [tmdbId, rows] of grouped.entries()) {
     const groupRow = rows.find((item) => item.user_id == null);
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
-    const chosen = groupRow || ownerRow || rows[0];
+    const chosen = groupRow && ownerRow || rows[0];
     if (!chosen) continue;
     snapshots.push({

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:348:20
   for (const [tmdbId, rows] of grouped.entries()) {
     const groupRow = rows.find((item) => item.user_id == null);
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
-    const chosen = groupRow || ownerRow || rows[0];
+    const chosen = false;
     if (!chosen) continue;
     snapshots.push({

[Survived] BooleanLiteral
features/lists/services/listSocialService.ts:349:9
     const groupRow = rows.find((item) => item.user_id == null);
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
     const chosen = groupRow || ownerRow || rows[0];
-    if (!chosen) continue;
+    if (chosen) continue;
     snapshots.push({
       tmdb_id: tmdbId,

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:349:9
     const groupRow = rows.find((item) => item.user_id == null);
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
     const chosen = groupRow || ownerRow || rows[0];
-    if (!chosen) continue;
+    if (false) continue;
     snapshots.push({
       tmdb_id: tmdbId,

[Survived] ObjectLiteral
features/lists/services/listSocialService.ts:350:20
     const ownerRow = rows.find((item) => item.user_id === sourceOwnerId);
     const chosen = groupRow || ownerRow || rows[0];
     if (!chosen) continue;
-    snapshots.push({
-      tmdb_id: tmdbId,
-      rating: chosen.rating,
-      review: chosen.review,
-      recommended: chosen.recommended,
-      location: chosen.location || null,
-      runtime: chosen.runtime || null,
-    });
+    snapshots.push({});
   }
 

[Survived] LogicalOperator
features/lists/services/listSocialService.ts:355:17
       rating: chosen.rating,
       review: chosen.review,
       recommended: chosen.recommended,
-      location: chosen.location || null,
+      location: chosen.location && null,
       runtime: chosen.runtime || null,
     });

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:355:17
       rating: chosen.rating,
       review: chosen.review,
       recommended: chosen.recommended,
-      location: chosen.location || null,
+      location: false,
       runtime: chosen.runtime || null,
     });

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:356:16
       review: chosen.review,
       recommended: chosen.recommended,
       location: chosen.location || null,
-      runtime: chosen.runtime || null,
+      runtime: false,
     });
   }

[Survived] ConditionalExpression
features/lists/services/listSocialService.ts:356:16
       review: chosen.review,
       recommended: chosen.recommended,
       location: chosen.location || null,
-      runtime: chosen.runtime || null,
+      runtime: true,
     });
   }
