[NoCoverage] ConditionalExpression
features/movies/hooks/useMovieFilters.ts:9:21
 
 export function useMovieFilters(movies: MovieData[]) {
    const [searchParams, setSearchParams] = useSearchParams();
-   const viewMode = (searchParams.get("aba") as "watched" | "watchlist" | "lists") || "watched";
+   const viewMode = false;
 
    const setViewMode = (mode: "watched" | "watchlist" | "lists") => {

[NoCoverage] ConditionalExpression
features/movies/hooks/useMovieFilters.ts:9:21
 
 export function useMovieFilters(movies: MovieData[]) {
    const [searchParams, setSearchParams] = useSearchParams();
-   const viewMode = (searchParams.get("aba") as "watched" | "watchlist" | "lists") || "watched";
+   const viewMode = true;
 
    const setViewMode = (mode: "watched" | "watchlist" | "lists") => {

[NoCoverage] BlockStatement
features/movies/hooks/useMovieFilters.ts:11:69
    const [searchParams, setSearchParams] = useSearchParams();
    const viewMode = (searchParams.get("aba") as "watched" | "watchlist" | "lists") || "watched";
 
-   const setViewMode = (mode: "watched" | "watchlist" | "lists") => {
-      setSearchParams(prev => {
-         if (mode === "watched") {
-            prev.delete("aba"); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
-         } else {
-            prev.set("aba", mode);
-         }
-         return prev;
-      });
-   };
+   const setViewMode = (mode: "watched" | "watchlist" | "lists") => {};
 
    // Estados locais de filtros

[NoCoverage] BlockStatement
features/movies/hooks/useMovieFilters.ts:12:31
    const viewMode = (searchParams.get("aba") as "watched" | "watchlist" | "lists") || "watched";
 
    const setViewMode = (mode: "watched" | "watchlist" | "lists") => {
-      setSearchParams(prev => {
-         if (mode === "watched") {
-            prev.delete("aba"); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
-         } else {
-            prev.set("aba", mode);
-         }
-         return prev;
-      });
+      setSearchParams(prev => {});
    };
 

[NoCoverage] ConditionalExpression
features/movies/hooks/useMovieFilters.ts:13:14
 
    const setViewMode = (mode: "watched" | "watchlist" | "lists") => {
       setSearchParams(prev => {
-         if (mode === "watched") {
+         if (false) {
             prev.delete("aba"); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
          } else {

[NoCoverage] ConditionalExpression
features/movies/hooks/useMovieFilters.ts:13:14
 
    const setViewMode = (mode: "watched" | "watchlist" | "lists") => {
       setSearchParams(prev => {
-         if (mode === "watched") {
+         if (true) {
             prev.delete("aba"); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
          } else {

[NoCoverage] StringLiteral
features/movies/hooks/useMovieFilters.ts:14:25
    const setViewMode = (mode: "watched" | "watchlist" | "lists") => {
       setSearchParams(prev => {
          if (mode === "watched") {
-            prev.delete("aba"); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
+            prev.delete(""); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
          } else {
             prev.set("aba", mode);

[NoCoverage] BlockStatement
features/movies/hooks/useMovieFilters.ts:15:17
       setSearchParams(prev => {
          if (mode === "watched") {
             prev.delete("aba"); // Como "watched" é o padrão, limpa a URL para ficar mais limpo
-         } else {
-            prev.set("aba", mode);
-         }
+         } else {}
          return prev;
       });

[NoCoverage] StringLiteral
features/movies/hooks/useMovieFilters.ts:24:58
 
    // Estados locais de filtros
    const [searchTerm, setSearchTerm] = useState("");
-   const [sortOrder, setSortOrder] = useState<SortOrder>("default");
+   const [sortOrder, setSortOrder] = useState<SortOrder>("");
    const [onlyNational, setOnlyNational] = useState(false);
    const [onlyOscar, setOnlyOscar] = useState(false);

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovieFilters.ts:25:53
    // Estados locais de filtros
    const [searchTerm, setSearchTerm] = useState("");
    const [sortOrder, setSortOrder] = useState<SortOrder>("default");
-   const [onlyNational, setOnlyNational] = useState(false);
+   const [onlyNational, setOnlyNational] = useState(true);
    const [onlyOscar, setOnlyOscar] = useState(false);
    const [onlyInternational, setOnlyInternational] = useState(false);

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovieFilters.ts:26:47
    const [searchTerm, setSearchTerm] = useState("");
    const [sortOrder, setSortOrder] = useState<SortOrder>("default");
    const [onlyNational, setOnlyNational] = useState(false);
-   const [onlyOscar, setOnlyOscar] = useState(false);
+   const [onlyOscar, setOnlyOscar] = useState(true);
    const [onlyInternational, setOnlyInternational] = useState(false);
    const [selectedGenre, setSelectedGenre] = useState("");

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovieFilters.ts:27:63
    const [sortOrder, setSortOrder] = useState<SortOrder>("default");
    const [onlyNational, setOnlyNational] = useState(false);
    const [onlyOscar, setOnlyOscar] = useState(false);
-   const [onlyInternational, setOnlyInternational] = useState(false);
+   const [onlyInternational, setOnlyInternational] = useState(true);
    const [selectedGenre, setSelectedGenre] = useState("");
    const [selectedDirector, setSelectedDirector] = useState("");

[NoCoverage] BlockStatement
features/movies/hooks/useMovieFilters.ts:32:42
    const [selectedDirector, setSelectedDirector] = useState("");
 
    // Extração dinâmica de gêneros (Apenas para popular o dropdown no menu)
-   const availableGenres = useMemo(() => {
-      const genres = new Set<string>();
-      movies.forEach(m => m.genres?.forEach(g => genres.add(g)));
-      return Array.from(genres).sort();
-   }, [movies]);
+   const availableGenres = useMemo(() => {}, [movies]);
 
    // ARQUITETURA FC/IS ACONTECE AQUI

[NoCoverage] ArrowFunction
features/movies/hooks/useMovieFilters.ts:34:45
    // Extração dinâmica de gêneros (Apenas para popular o dropdown no menu)
    const availableGenres = useMemo(() => {
       const genres = new Set<string>();
-      movies.forEach(m => m.genres?.forEach(g => genres.add(g)));
+      movies.forEach(m => m.genres?.forEach(() => undefined));
       return Array.from(genres).sort();
    }, [movies]);

[NoCoverage] OptionalChaining
features/movies/hooks/useMovieFilters.ts:34:27
    // Extração dinâmica de gêneros (Apenas para popular o dropdown no menu)
    const availableGenres = useMemo(() => {
       const genres = new Set<string>();
-      movies.forEach(m => m.genres?.forEach(g => genres.add(g)));
+      movies.forEach(m => m.genres.forEach(g => genres.add(g)));
       return Array.from(genres).sort();
    }, [movies]);

[NoCoverage] MethodExpression
features/movies/hooks/useMovieFilters.ts:35:14
    const availableGenres = useMemo(() => {
       const genres = new Set<string>();
       movies.forEach(m => m.genres?.forEach(g => genres.add(g)));
-      return Array.from(genres).sort();
+      return Array.from(genres);
    }, [movies]);
 

[NoCoverage] BlockStatement
features/movies/hooks/useMovieFilters.ts:40:41
 
    // ARQUITETURA FC/IS ACONTECE AQUI
    // O hook apenas empacota os estados atuais e delega todo o trabalho pesado para o Core.
-   const filteredMovies = useMemo(() => {
-      const filters = {
-         viewMode,
-         searchTerm,
-         onlyNational,
-         onlyOscar,
-         onlyInternational,
-         selectedGenre,
-         selectedDirector,
-      };
-
-      const filtered = filterMovies(movies, filters);
-      return sortMovies(filtered, sortOrder);
-   }, [
+   const filteredMovies = useMemo(() => {}, [
       movies,
       viewMode,

[NoCoverage] ArrayDeclaration
features/movies/hooks/useMovieFilters.ts:53:7
 
       const filtered = filterMovies(movies, filters);
       return sortMovies(filtered, sortOrder);
-   }, [
-      movies,
-      viewMode,
-      searchTerm,
-      onlyNational,
-      onlyOscar,
-      onlyInternational,
-      selectedGenre,
-      selectedDirector,
-      sortOrder
-   ]);
+   }, []);
 
    // Retorna tudo para o Componente React usar
