[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:13:43
  */
 export function useMovies(session: Session | null) {
    const [movies, setMovies] = useState<MovieData[]>([]);
-   const [loading, setLoading] = useState(true);
+   const [loading, setLoading] = useState(false);
    const hasFetchedOnce = useRef(false);
 

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:14:34
 export function useMovies(session: Session | null) {
    const [movies, setMovies] = useState<MovieData[]>([]);
    const [loading, setLoading] = useState(true);
-   const hasFetchedOnce = useRef(false);
+   const hasFetchedOnce = useRef(true);
 
    const fetchMovies = useCallback(async () => {

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:17:30
    const hasFetchedOnce = useRef(false);
 
    const fetchMovies = useCallback(async () => {
-      if (!session?.user.id) {
-         setLoading(false); 
-         return; 
-      }
+      if (!session?.user.id) {}
 
       // Só mostra skeleton no primeiro carregamento (refresh silencioso se já tem dados)

[NoCoverage] OptionalChaining
features/movies/hooks/useMovies.ts:17:12
    const hasFetchedOnce = useRef(false);
 
    const fetchMovies = useCallback(async () => {
-      if (!session?.user.id) {
+      if (!session.user.id) {
          setLoading(false); 
          return; 

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:18:21
 
    const fetchMovies = useCallback(async () => {
       if (!session?.user.id) {
-         setLoading(false); 
+         setLoading(true); 
          return; 
       }

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:23:36
       }
 
       // Só mostra skeleton no primeiro carregamento (refresh silencioso se já tem dados)
-      if (!hasFetchedOnce.current) {
-         setLoading(true);
-      }
+      if (!hasFetchedOnce.current) {}
 
       try {

[NoCoverage] ConditionalExpression
features/movies/hooks/useMovies.ts:23:11
       }
 
       // Só mostra skeleton no primeiro carregamento (refresh silencioso se já tem dados)
-      if (!hasFetchedOnce.current) {
+      if (true) {
          setLoading(true);
       }

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:24:21
 
       // Só mostra skeleton no primeiro carregamento (refresh silencioso se já tem dados)
       if (!hasFetchedOnce.current) {
-         setLoading(true);
+         setLoading(false);
       }
 

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:27:11
          setLoading(true);
       }
 
-      try {
-         const { data: supabaseData, error } = await supabase
-            .from("reviews")
-            .select("*")
-            .eq("user_id", session.user.id)
-            .order("created_at", { ascending: false });
-
-         if (error) throw error;
-         if (!supabaseData) return;
-
-         const fullMovies = await Promise.all(
-            supabaseData.map((movie) => enrichMovieWithTmdb(movie)),
-         );
-
-         setMovies(fullMovies);
-         hasFetchedOnce.current = true;
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro geral:", error);
       } finally {

[NoCoverage] StringLiteral
features/movies/hooks/useMovies.ts:31:17
          const { data: supabaseData, error } = await supabase
             .from("reviews")
             .select("*")
-            .eq("user_id", session.user.id)
+            .eq("", session.user.id)
             .order("created_at", { ascending: false });
 

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:32:47
             .from("reviews")
             .select("*")
             .eq("user_id", session.user.id)
-            .order("created_at", { ascending: false });
+            .order("created_at", { ascending: true });
 
          if (error) throw error;

[NoCoverage] ConditionalExpression
features/movies/hooks/useMovies.ts:35:14
             .order("created_at", { ascending: false });
 
          if (error) throw error;
-         if (!supabaseData) return;
+         if (false) return;
 
          const fullMovies = await Promise.all(

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:35:14
             .order("created_at", { ascending: false });
 
          if (error) throw error;
-         if (!supabaseData) return;
+         if (supabaseData) return;
 
          const fullMovies = await Promise.all(

[NoCoverage] ArrowFunction
features/movies/hooks/useMovies.ts:38:30
          if (!supabaseData) return;
 
          const fullMovies = await Promise.all(
-            supabaseData.map((movie) => enrichMovieWithTmdb(movie)),
+            supabaseData.map(() => undefined),
          );
 

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:42:35
          );
 
          setMovies(fullMovies);
-         hasFetchedOnce.current = true;
+         hasFetchedOnce.current = false;
       } catch (error) {
          console.error("Erro geral:", error);

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:43:23
 
          setMovies(fullMovies);
          hasFetchedOnce.current = true;
-      } catch (error) {
-         console.error("Erro geral:", error);
-      } finally {
+      } catch (error) {} finally {
          setLoading(false);
       }

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:45:17
          hasFetchedOnce.current = true;
       } catch (error) {
          console.error("Erro geral:", error);
-      } finally {
-         setLoading(false);
-      }
+      } finally {}
    }, [session]);
 

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:50:20
       }
    }, [session]);
 
-   useEffect(() => {
-      if (!session) {
-         setMovies([]);
-         setLoading(false);
-         hasFetchedOnce.current = false;
-      } else {
-         fetchMovies();
-      }
-   }, [session, fetchMovies]);
+   useEffect(() => {}, [session, fetchMovies]);
 
    return { movies, loading, fetchMovies };

[NoCoverage] ConditionalExpression
features/movies/hooks/useMovies.ts:51:11
    }, [session]);
 
    useEffect(() => {
-      if (!session) {
+      if (true) {
          setMovies([]);
          setLoading(false);

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:51:21
    }, [session]);
 
    useEffect(() => {
-      if (!session) {
-         setMovies([]);
-         setLoading(false);
-         hasFetchedOnce.current = false;
-      } else {
+      if (!session) {} else {
          fetchMovies();
       }

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:53:21
    useEffect(() => {
       if (!session) {
          setMovies([]);
-         setLoading(false);
+         setLoading(true);
          hasFetchedOnce.current = false;
       } else {

[NoCoverage] BooleanLiteral
features/movies/hooks/useMovies.ts:54:35
       if (!session) {
          setMovies([]);
          setLoading(false);
-         hasFetchedOnce.current = false;
+         hasFetchedOnce.current = true;
       } else {
          fetchMovies();

[NoCoverage] BlockStatement
features/movies/hooks/useMovies.ts:55:14
          setMovies([]);
          setLoading(false);
          hasFetchedOnce.current = false;
-      } else {
-         fetchMovies();
-      }
+      } else {}
    }, [session, fetchMovies]);
 

[NoCoverage] ObjectLiteral
features/movies/hooks/useMovies.ts:60:11
       }
    }, [session, fetchMovies]);
 
-   return { movies, loading, fetchMovies };
+   return {};
 }
 
