[Survived] ArrayDeclaration
features/movies/logic/enrichMovie.ts:4:43
 import type { MovieData, TmdbProvider } from "@/types";
 
 // Instancia fora da função para não recriar a cada filme 
-const regionNames = new Intl.DisplayNames(["pt-BR"], { type: "region" });
+const regionNames = new Intl.DisplayNames([], { type: "region" });
 
 // só precisa garantir que tem tmdb_id. O resto pode ou não existir (ex: filmes de listas).

[Survived] ObjectLiteral
features/movies/logic/enrichMovie.ts:4:54
 import type { MovieData, TmdbProvider } from "@/types";
 
 // Instancia fora da função para não recriar a cada filme 
-const regionNames = new Intl.DisplayNames(["pt-BR"], { type: "region" });
+const regionNames = new Intl.DisplayNames(["pt-BR"], {});
 
 // só precisa garantir que tem tmdb_id. O resto pode ou não existir (ex: filmes de listas).

[Killed] OptionalChaining
features/movies/logic/enrichMovie.ts:53:22
    oscarNomineesIds: number[] = []
 ): MovieData {
    
-   const directors = tmdbData.credits?.crew
+   const directors = tmdbData.credits.crew
       ?.filter((p) => p.job === "Director")
       .map((d) => d.name)
killedBy: mapTmdbToMovieData (Functional Core) deve identificar um filme como Nacional e como Indicado ao Oscar do ano corrente
statusReason: Cannot read properties of undefined (reading 'crew')

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:53:22
    oscarNomineesIds: number[] = []
 ): MovieData {
    
-   const directors = tmdbData.credits?.crew
-      ?.filter((p) => p.job === "Director")
-      .map((d) => d.name)
-      .join(", ") || "Desconhecido";
+   const directors = false;
 
    const cast = tmdbData.credits?.cast
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected false to be 'David Fincher' // Object.is equality

[Killed] EqualityOperator
features/movies/logic/enrichMovie.ts:54:23
 ): MovieData {
    
    const directors = tmdbData.credits?.crew
-      ?.filter((p) => p.job === "Director")
+      ?.filter((p) => p.job !== "Director")
       .map((d) => d.name)
       .join(", ") || "Desconhecido";
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected 'Art Linson' to be 'David Fincher' // Object.is equality

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:54:23
 ): MovieData {
    
    const directors = tmdbData.credits?.crew
-      ?.filter((p) => p.job === "Director")
+      ?.filter((p) => true)
       .map((d) => d.name)
       .join(", ") || "Desconhecido";
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected 'David Fincher, Art Linson' to be 'David Fincher' // Object.is equality

[Killed] ArrowFunction
features/movies/logic/enrichMovie.ts:55:12
    
    const directors = tmdbData.credits?.crew
       ?.filter((p) => p.job === "Director")
-      .map((d) => d.name)
+      .map(() => undefined)
       .join(", ") || "Desconhecido";
 
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected 'Desconhecido' to be 'David Fincher' // Object.is equality

[Killed] StringLiteral
features/movies/logic/enrichMovie.ts:56:22
    const directors = tmdbData.credits?.crew
       ?.filter((p) => p.job === "Director")
       .map((d) => d.name)
-      .join(", ") || "Desconhecido";
+      .join(", ") || "";
 
    const cast = tmdbData.credits?.cast
killedBy: Tratamento de Falhas e Dados Ausentes) deve lidar com uma resposta do TMDB completamente vazia sem quebrar a aplicação (Fallback Seguro)
statusReason: expected '' to be 'Desconhecido' // Object.is equality

[Killed] LogicalOperator
features/movies/logic/enrichMovie.ts:58:17
       .map((d) => d.name)
       .join(", ") || "Desconhecido";
 
-   const cast = tmdbData.credits?.cast
-      ?.slice(0, 5)
-      .map((c) => c.name) || [];
+   const cast = tmdbData.credits?.cast?.slice(0, 5).map(c => c.name) && [];
 
    const genres = tmdbData.genres?.map((g) => g.name) || [];
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected [] to have a length of 5 but got +0

[Killed] MethodExpression
features/movies/logic/enrichMovie.ts:58:17
       .map((d) => d.name)
       .join(", ") || "Desconhecido";
 
-   const cast = tmdbData.credits?.cast
-      ?.slice(0, 5)
+   const cast = tmdbData.credits?.cast
       .map((c) => c.name) || [];
 
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected [ 'Brad Pitt', 'Edward Norton', …(4) ] to have a length of 5 but got 6

[Killed] ArrowFunction
features/movies/logic/enrichMovie.ts:60:12
 
    const cast = tmdbData.credits?.cast
       ?.slice(0, 5)
-      .map((c) => c.name) || [];
+      .map(() => undefined) || [];
 
    const genres = tmdbData.genres?.map((g) => g.name) || [];
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected [ undefined, undefined, …(3) ] to include 'Brad Pitt'

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:62:19
       ?.slice(0, 5)
       .map((c) => c.name) || [];
 
-   const genres = tmdbData.genres?.map((g) => g.name) || [];
+   const genres = true;
 
    const rawCountries = tmdbData.production_countries || [];
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected true to deeply equal [ 'Drama', 'Suspense' ]

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:62:19
       ?.slice(0, 5)
       .map((c) => c.name) || [];
 
-   const genres = tmdbData.genres?.map((g) => g.name) || [];
+   const genres = false;
 
    const rawCountries = tmdbData.production_countries || [];
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected false to deeply equal [ 'Drama', 'Suspense' ]

[Killed] LogicalOperator
features/movies/logic/enrichMovie.ts:64:25
 
    const genres = tmdbData.genres?.map((g) => g.name) || [];
 
-   const rawCountries = tmdbData.production_countries || [];
+   const rawCountries = tmdbData.production_countries && [];
    
    // Tradução nativa e dinâmica com Intl.DisplayNames
killedBy: mapTmdbToMovieData (Functional Core) deve identificar um filme como Nacional e como Indicado ao Oscar do ano corrente
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:64:25
 
    const genres = tmdbData.genres?.map((g) => g.name) || [];
 
-   const rawCountries = tmdbData.production_countries || [];
+   const rawCountries = false;
    
    // Tradução nativa e dinâmica com Intl.DisplayNames
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: rawCountries.map is not a function

[Killed] BlockStatement
features/movies/logic/enrichMovie.ts:67:56
    const rawCountries = tmdbData.production_countries || [];
    
    // Tradução nativa e dinâmica com Intl.DisplayNames
-   const translatedCountries = rawCountries.map((c) => {
-      try {
-         const translated = regionNames.of(c.iso_3166_1);
-         return translated && translated !== c.iso_3166_1 ? translated : c.name;
-      } catch {
-         return c.name;
-      }
-   });
+   const translatedCountries = rawCountries.map((c) => {});
 
    const isNational = rawCountries.some((c) => c.iso_3166_1 === "BR");
killedBy: Tratamento de Falhas e Dados Ausentes) deve ignorar códigos de país inválidos no Intl.DisplayNames sem lançar exceção (Try/Catch)
statusReason: expected [ undefined ] to include 'País Inventado'

[Killed] BlockStatement
features/movies/logic/enrichMovie.ts:68:11
    
    // Tradução nativa e dinâmica com Intl.DisplayNames
    const translatedCountries = rawCountries.map((c) => {
-      try {
-         const translated = regionNames.of(c.iso_3166_1);
-         return translated && translated !== c.iso_3166_1 ? translated : c.name;
-      } catch {
+      try {} catch {
          return c.name;
       }
killedBy: Tratamento de Falhas e Dados Ausentes) deve ignorar códigos de país inválidos no Intl.DisplayNames sem lançar exceção (Try/Catch)
statusReason: expected [ undefined ] to include 'País Inventado'

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:70:31
    const translatedCountries = rawCountries.map((c) => {
       try {
          const translated = regionNames.of(c.iso_3166_1);
-         return translated && translated !== c.iso_3166_1 ? translated : c.name;
+         return translated && true ? translated : c.name;
       } catch {
          return c.name;
killedBy: Tratamento de Falhas e Dados Ausentes) deve ignorar códigos de país inválidos no Intl.DisplayNames sem lançar exceção (Try/Catch)
statusReason: expected [ 'XX' ] to include 'País Inventado'

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:70:17
    const translatedCountries = rawCountries.map((c) => {
       try {
          const translated = regionNames.of(c.iso_3166_1);
-         return translated && translated !== c.iso_3166_1 ? translated : c.name;
+         return true ? translated : c.name;
       } catch {
          return c.name;
killedBy: Tratamento de Falhas e Dados Ausentes) deve ignorar códigos de país inválidos no Intl.DisplayNames sem lançar exceção (Try/Catch)
statusReason: expected [ 'XX' ] to include 'País Inventado'

[NoCoverage] BlockStatement
features/movies/logic/enrichMovie.ts:71:15
       try {
          const translated = regionNames.of(c.iso_3166_1);
          return translated && translated !== c.iso_3166_1 ? translated : c.name;
-      } catch {
-         return c.name;
-      }
+      } catch {}
    });
 

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:76:48
       }
    });
 
-   const isNational = rawCountries.some((c) => c.iso_3166_1 === "BR");
+   const isNational = rawCountries.some((c) => true);
    const isOscar = oscarNomineesIds.includes(supabaseRow.tmdb_id);
 
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:76:48
       }
    });
 
-   const isNational = rawCountries.some((c) => c.iso_3166_1 === "BR");
+   const isNational = rawCountries.some((c) => false);
    const isOscar = oscarNomineesIds.includes(supabaseRow.tmdb_id);
 
killedBy: mapTmdbToMovieData (Functional Core) deve identificar um filme como Nacional e como Indicado ao Oscar do ano corrente
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
features/movies/logic/enrichMovie.ts:79:22
    const isNational = rawCountries.some((c) => c.iso_3166_1 === "BR");
    const isOscar = oscarNomineesIds.includes(supabaseRow.tmdb_id);
 
-   const providers = tmdbData["watch/providers"]?.results?.BR?.flatrate || [];
+   const providers = tmdbData["watch/providers"]?.results?.BR?.flatrate && [];
 
    return {
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: Cannot read properties of undefined (reading 'provider_name')

[Killed] ConditionalExpression
features/movies/logic/enrichMovie.ts:79:22
    const isNational = rawCountries.some((c) => c.iso_3166_1 === "BR");
    const isOscar = oscarNomineesIds.includes(supabaseRow.tmdb_id);
 
-   const providers = tmdbData["watch/providers"]?.results?.BR?.flatrate || [];
+   const providers = false;
 
    return {
killedBy: mapTmdbToMovieData (Functional Core) deve mapear os dados crus do TMDB e juntar com os dados do banco local
statusReason: Cannot read properties of undefined (reading 'provider_name')
