[Killed] BlockStatement
features/movies/logic/filterMovies.ts:14:36
 }
 
 export function filterMovies(movies: MovieData[], filters: MovieFilters): MovieData[] {
-   return movies.filter((movie) => {
-      // Filtro base de Aba (Assistidos vs Watchlist)
-      const movieStatus = movie.status || "watched";
-      if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
-
-      // Filtros de Categoria
-      if (filters.onlyNational && !movie.isNational) return false;
-      if (filters.onlyOscar && !movie.isOscar) return false;
-      if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
-      if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
-      if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
-
-      // Busca Full-text
-      if (!filters.searchTerm) return true;
-      
-      const searchLower = filters.searchTerm.toLowerCase().trim();
-      return (
-         movie.title?.toLowerCase().includes(searchLower) ||
-         movie.review?.toLowerCase().includes(searchLower) ||
-         movie.director?.toLowerCase().includes(searchLower) ||
-         movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
-         movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
-         (movie.isOscar && "oscar".includes(searchLower))
-      );
-   });
+   return movies.filter((movie) => {});
 }
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
features/movies/logic/filterMovies.ts:14:11
 }
 
 export function filterMovies(movies: MovieData[], filters: MovieFilters): MovieData[] {
-   return movies.filter((movie) => {
-      // Filtro base de Aba (Assistidos vs Watchlist)
-      const movieStatus = movie.status || "watched";
-      if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
-
-      // Filtros de Categoria
-      if (filters.onlyNational && !movie.isNational) return false;
-      if (filters.onlyOscar && !movie.isOscar) return false;
-      if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
-      if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
-      if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
-
-      // Busca Full-text
-      if (!filters.searchTerm) return true;
-      
-      const searchLower = filters.searchTerm.toLowerCase().trim();
-      return (
-         movie.title?.toLowerCase().includes(searchLower) ||
-         movie.review?.toLowerCase().includes(searchLower) ||
-         movie.director?.toLowerCase().includes(searchLower) ||
-         movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
-         movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
-         (movie.isOscar && "oscar".includes(searchLower))
-      );
-   });
+   return movies;
 }
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [ { id: 1, tmdb_id: 100, …(8) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:16:27
 export function filterMovies(movies: MovieData[], filters: MovieFilters): MovieData[] {
    return movies.filter((movie) => {
       // Filtro base de Aba (Assistidos vs Watchlist)
-      const movieStatus = movie.status || "watched";
+      const movieStatus = true;
       if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
 
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
features/movies/logic/filterMovies.ts:16:27
 export function filterMovies(movies: MovieData[], filters: MovieFilters): MovieData[] {
    return movies.filter((movie) => {
       // Filtro base de Aba (Assistidos vs Watchlist)
-      const movieStatus = movie.status || "watched";
+      const movieStatus = movie.status && "watched";
       if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
 
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
features/movies/logic/filterMovies.ts:17:11
    return movies.filter((movie) => {
       // Filtro base de Aba (Assistidos vs Watchlist)
       const movieStatus = movie.status || "watched";
-      if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
+      if (filters.viewMode !== "lists" || movieStatus !== filters.viewMode) return false;
 
       // Filtros de Categoria
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:17:11
    return movies.filter((movie) => {
       // Filtro base de Aba (Assistidos vs Watchlist)
       const movieStatus = movie.status || "watched";
-      if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
+      if (true) return false;
 
       // Filtros de Categoria
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:20:11
       if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
 
       // Filtros de Categoria
-      if (filters.onlyNational && !movie.isNational) return false;
+      if (false) return false;
       if (filters.onlyOscar && !movie.isOscar) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
killedBy: filterMovies (Functional Core) deve combinar filtros: Nacional + Oscar
statusReason: expected [ { id: 1, tmdb_id: 100, …(8) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:20:11
       if (filters.viewMode !== "lists" && movieStatus !== filters.viewMode) return false;
 
       // Filtros de Categoria
-      if (filters.onlyNational && !movie.isNational) return false;
+      if (true) return false;
       if (filters.onlyOscar && !movie.isOscar) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:21:11
 
       // Filtros de Categoria
       if (filters.onlyNational && !movie.isNational) return false;
-      if (filters.onlyOscar && !movie.isOscar) return false;
+      if (true) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
       if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
features/movies/logic/filterMovies.ts:21:55
 
       // Filtros de Categoria
       if (filters.onlyNational && !movie.isNational) return false;
-      if (filters.onlyOscar && !movie.isOscar) return false;
+      if (filters.onlyOscar && !movie.isOscar) return true;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
       if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
killedBy: filterMovies (Functional Core) deve combinar filtros: Nacional + Oscar
statusReason: expected [ { id: 1, tmdb_id: 100, …(8) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:22:11
       // Filtros de Categoria
       if (filters.onlyNational && !movie.isNational) return false;
       if (filters.onlyOscar && !movie.isOscar) return false;
-      if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
+      if (true) return false;
       if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
       if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
features/movies/logic/filterMovies.ts:22:92
       // Filtros de Categoria
       if (filters.onlyNational && !movie.isNational) return false;
       if (filters.onlyOscar && !movie.isOscar) return false;
-      if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
+      if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return true;
       if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
       if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
killedBy: filterMovies (Functional Core) deve filtrar filmes Internacionais (que não contêm 'Estados Unidos')
statusReason: expected [ { id: 1, tmdb_id: 100, …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] LogicalOperator
features/movies/logic/filterMovies.ts:23:11
       if (filters.onlyNational && !movie.isNational) return false;
       if (filters.onlyOscar && !movie.isOscar) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
-      if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
+      if (filters.selectedDirector || movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
       if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
 
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] OptionalChaining
features/movies/logic/filterMovies.ts:23:39
       if (filters.onlyNational && !movie.isNational) return false;
       if (filters.onlyOscar && !movie.isOscar) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
-      if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
+      if (filters.selectedDirector && movie.director.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
       if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
 
killedBy: Tratamento de Falhas não deve quebrar se os filmes não tiverem gêneros ou diretores cadastrados
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:24:11
       if (filters.onlyOscar && !movie.isOscar) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
       if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
-      if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
+      if (true) return false;
 
       // Busca Full-text
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
features/movies/logic/filterMovies.ts:24:11
       if (filters.onlyOscar && !movie.isOscar) return false;
       if (filters.onlyInternational && movie.countries?.includes("Estados Unidos")) return false;
       if (filters.selectedDirector && movie.director?.toLowerCase() !== filters.selectedDirector.toLowerCase()) return false;
-      if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
+      if (filters.selectedGenre || !movie.genres?.includes(filters.selectedGenre)) return false;
 
       // Busca Full-text
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:27:11
       if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
 
       // Busca Full-text
-      if (!filters.searchTerm) return true;
+      if (true) return true;
       
       const searchLower = filters.searchTerm.toLowerCase().trim();
killedBy: filterMovies (Functional Core) deve filtrar corretamente por busca de texto (título case-insensitive)
statusReason: expected [ { id: 1, tmdb_id: 100, …(8) }, …(1) ] to have a length of 1 but got 2

[Killed] BooleanLiteral
features/movies/logic/filterMovies.ts:27:39
       if (filters.selectedGenre && !movie.genres?.includes(filters.selectedGenre)) return false;
 
       // Busca Full-text
-      if (!filters.searchTerm) return true;
+      if (!filters.searchTerm) return false;
       
       const searchLower = filters.searchTerm.toLowerCase().trim();
killedBy: filterMovies (Functional Core) deve filtrar corretamente pela aba (viewMode)
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
features/movies/logic/filterMovies.ts:29:27
       // Busca Full-text
       if (!filters.searchTerm) return true;
       
-      const searchLower = filters.searchTerm.toLowerCase().trim();
+      const searchLower = filters.searchTerm.toUpperCase().trim();
       return (
          movie.title?.toLowerCase().includes(searchLower) ||
killedBy: filterMovies (Functional Core) deve filtrar corretamente por busca de texto (título case-insensitive)
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
features/movies/logic/filterMovies.ts:29:27
       // Busca Full-text
       if (!filters.searchTerm) return true;
       
-      const searchLower = filters.searchTerm.toLowerCase().trim();
+      const searchLower = filters.searchTerm.toLowerCase();
       return (
          movie.title?.toLowerCase().includes(searchLower) ||
killedBy: Tratamento de Falhas deve ser case-insensitive e ignorar espaços extras na busca
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
features/movies/logic/filterMovies.ts:31:10
       
       const searchLower = filters.searchTerm.toLowerCase().trim();
       return (
-         movie.title?.toLowerCase().includes(searchLower) ||
-         movie.review?.toLowerCase().includes(searchLower) ||
+         movie.title?.toLowerCase().includes(searchLower) && movie.review?.toLowerCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
killedBy: filterMovies (Functional Core) deve filtrar corretamente por busca de texto (título case-insensitive)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
features/movies/logic/filterMovies.ts:31:10
       
       const searchLower = filters.searchTerm.toLowerCase().trim();
       return (
-         movie.title?.toLowerCase().includes(searchLower) ||
-         movie.review?.toLowerCase().includes(searchLower) ||
-         movie.director?.toLowerCase().includes(searchLower) ||
-         movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
-         movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
-         (movie.isOscar && "oscar".includes(searchLower))
+         false
       );
    });
killedBy: filterMovies (Functional Core) deve filtrar corretamente por busca de texto (título case-insensitive)
statusReason: expected [] to have a length of 1 but got +0

[Killed] OptionalChaining
features/movies/logic/filterMovies.ts:32:10
       const searchLower = filters.searchTerm.toLowerCase().trim();
       return (
          movie.title?.toLowerCase().includes(searchLower) ||
-         movie.review?.toLowerCase().includes(searchLower) ||
+         movie.review.toLowerCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
killedBy: filterMovies (Functional Core) deve filtrar corretamente por busca de texto (título case-insensitive)
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] MethodExpression
features/movies/logic/filterMovies.ts:32:10
       const searchLower = filters.searchTerm.toLowerCase().trim();
       return (
          movie.title?.toLowerCase().includes(searchLower) ||
-         movie.review?.toLowerCase().includes(searchLower) ||
+         movie.review?.toUpperCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||

[Survived] OptionalChaining
features/movies/logic/filterMovies.ts:33:10
       return (
          movie.title?.toLowerCase().includes(searchLower) ||
          movie.review?.toLowerCase().includes(searchLower) ||
-         movie.director?.toLowerCase().includes(searchLower) ||
+         movie.director.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
          movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||

[Survived] MethodExpression
features/movies/logic/filterMovies.ts:33:10
       return (
          movie.title?.toLowerCase().includes(searchLower) ||
          movie.review?.toLowerCase().includes(searchLower) ||
-         movie.director?.toLowerCase().includes(searchLower) ||
+         movie.director?.toUpperCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
          movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||

[Survived] MethodExpression
features/movies/logic/filterMovies.ts:34:10
          movie.title?.toLowerCase().includes(searchLower) ||
          movie.review?.toLowerCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
-         movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
+         movie.genres?.every(g => g.toLowerCase().includes(searchLower)) ||
          movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
          (movie.isOscar && "oscar".includes(searchLower))

[Survived] ArrowFunction
features/movies/logic/filterMovies.ts:34:29
          movie.title?.toLowerCase().includes(searchLower) ||
          movie.review?.toLowerCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
-         movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
+         movie.genres?.some(() => undefined) ||
          movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
          (movie.isOscar && "oscar".includes(searchLower))

[Survived] OptionalChaining
features/movies/logic/filterMovies.ts:35:10
          movie.review?.toLowerCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
-         movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
+         movie.cast.some(actor => actor.toLowerCase().includes(searchLower)) ||
          (movie.isOscar && "oscar".includes(searchLower))
       );

[Survived] MethodExpression
features/movies/logic/filterMovies.ts:35:10
          movie.review?.toLowerCase().includes(searchLower) ||
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
-         movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
+         movie.cast?.every(actor => actor.toLowerCase().includes(searchLower)) ||
          (movie.isOscar && "oscar".includes(searchLower))
       );

[Survived] LogicalOperator
features/movies/logic/filterMovies.ts:36:11
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
          movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
-         (movie.isOscar && "oscar".includes(searchLower))
+         (movie.isOscar || "oscar".includes(searchLower))
       );
    });

[Survived] ConditionalExpression
features/movies/logic/filterMovies.ts:36:11
          movie.director?.toLowerCase().includes(searchLower) ||
          movie.genres?.some(g => g.toLowerCase().includes(searchLower)) ||
          movie.cast?.some(actor => actor.toLowerCase().includes(searchLower)) ||
-         (movie.isOscar && "oscar".includes(searchLower))
+         (false)
       );
    });
