[Killed] BlockStatement
features/movies/logic/sortMovies.ts:5:80
 
 export type SortOrder = "default" | "rating" | "date" | "alpha";
 
-export function sortMovies(movies: MovieData[], order: SortOrder): MovieData[] {
-   return [...movies].sort((a, b) => {
-      switch (order) {
-         case "rating": 
-            return (b.rating ?? 0) - (a.rating ?? 0);
-         case "date": 
-            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
-         case "alpha": 
-            return (a.title || "").localeCompare(b.title || "");
-         default: 
-            return b.id - a.id; 
-      }
-   });
-}
+export function sortMovies(movies: MovieData[], order: SortOrder): MovieData[] {}
killedBy: sortMovies (Functional Core) deve ordenar os filmes por nota (rating) de forma decrescente
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
features/movies/logic/sortMovies.ts:6:38
 export type SortOrder = "default" | "rating" | "date" | "alpha";
 
 export function sortMovies(movies: MovieData[], order: SortOrder): MovieData[] {
-   return [...movies].sort((a, b) => {
-      switch (order) {
-         case "rating": 
-            return (b.rating ?? 0) - (a.rating ?? 0);
-         case "date": 
-            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
-         case "alpha": 
-            return (a.title || "").localeCompare(b.title || "");
-         default: 
-            return b.id - a.id; 
-      }
-   });
+   return [...movies].sort((a, b) => {});
 }
killedBy: sortMovies (Functional Core) deve ordenar os filmes por nota (rating) de forma decrescente
statusReason: expected [ 5, 9, 7 ] to deeply equal [ 9, 7, 5 ]

[Killed] MethodExpression
features/movies/logic/sortMovies.ts:6:11
 export type SortOrder = "default" | "rating" | "date" | "alpha";
 
 export function sortMovies(movies: MovieData[], order: SortOrder): MovieData[] {
-   return [...movies].sort((a, b) => {
-      switch (order) {
-         case "rating": 
-            return (b.rating ?? 0) - (a.rating ?? 0);
-         case "date": 
-            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
-         case "alpha": 
-            return (a.title || "").localeCompare(b.title || "");
-         default: 
-            return b.id - a.id; 
-      }
-   });
+   return [...movies];
 }
killedBy: sortMovies (Functional Core) deve ordenar os filmes por nota (rating) de forma decrescente
statusReason: expected [ 5, 9, 7 ] to deeply equal [ 9, 7, 5 ]

[Killed] ConditionalExpression
features/movies/logic/sortMovies.ts:8:10
 export function sortMovies(movies: MovieData[], order: SortOrder): MovieData[] {
    return [...movies].sort((a, b) => {
       switch (order) {
-         case "rating": 
-            return (b.rating ?? 0) - (a.rating ?? 0);
+         case "rating":
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
killedBy: sortMovies (Functional Core) deve ordenar os filmes por nota (rating) de forma decrescente
statusReason: expected [ 5, 9, 7 ] to deeply equal [ 9, 7, 5 ]

[Killed] LogicalOperator
features/movies/logic/sortMovies.ts:9:21
    return [...movies].sort((a, b) => {
       switch (order) {
          case "rating": 
-            return (b.rating ?? 0) - (a.rating ?? 0);
+            return (b.rating && 0) - (a.rating ?? 0);
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
killedBy: sortMovies (Functional Core) deve ordenar os filmes por nota (rating) de forma decrescente
statusReason: expected [ 7, 9, 5 ] to deeply equal [ 9, 7, 5 ]

[Killed] ArithmeticOperator
features/movies/logic/sortMovies.ts:9:20
    return [...movies].sort((a, b) => {
       switch (order) {
          case "rating": 
-            return (b.rating ?? 0) - (a.rating ?? 0);
+            return (b.rating ?? 0) + (a.rating ?? 0);
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
killedBy: sortMovies (Functional Core) deve ordenar os filmes por nota (rating) de forma decrescente
statusReason: expected [ 5, 9, 7 ] to deeply equal [ 9, 7, 5 ]

[Survived] ConditionalExpression
features/movies/logic/sortMovies.ts:10:10
       switch (order) {
          case "rating": 
             return (b.rating ?? 0) - (a.rating ?? 0);
-         case "date": 
-            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
+         case "date":
          case "alpha": 
             return (a.title || "").localeCompare(b.title || "");

[Survived] StringLiteral
features/movies/logic/sortMovies.ts:10:15
       switch (order) {
          case "rating": 
             return (b.rating ?? 0) - (a.rating ?? 0);
-         case "date": 
+         case "": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
          case "alpha": 

[Killed] LogicalOperator
features/movies/logic/sortMovies.ts:11:76
          case "rating": 
             return (b.rating ?? 0) - (a.rating ?? 0);
          case "date": 
-            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
+            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date && "1900").getTime();
          case "alpha": 
             return (a.title || "").localeCompare(b.title || "");
killedBy: Tratamento de Falhas deve jogar os filmes sem data de lançamento para o final da lista (Ordenação por Data)
statusReason: expected 'Sem Data' to be 'Com Data' // Object.is equality

[Killed] LogicalOperator
features/movies/logic/sortMovies.ts:11:29
          case "rating": 
             return (b.rating ?? 0) - (a.rating ?? 0);
          case "date": 
-            return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
+            return new Date(b.release_date && "1900").getTime() - new Date(a.release_date || "1900").getTime();
          case "alpha": 
             return (a.title || "").localeCompare(b.title || "");
killedBy: Tratamento de Falhas deve jogar os filmes sem data de lançamento para o final da lista (Ordenação por Data)
statusReason: expected 'Sem Data' to be 'Com Data' // Object.is equality

[Killed] ConditionalExpression
features/movies/logic/sortMovies.ts:12:10
             return (b.rating ?? 0) - (a.rating ?? 0);
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
-         case "alpha": 
-            return (a.title || "").localeCompare(b.title || "");
+         case "alpha":
          default: 
             return b.id - a.id; 
killedBy: sortMovies (Functional Core) deve ordenar os filmes alfabeticamente (alpha)
statusReason: expected [ 'Zombieland', 'Avatar', 'Matrix' ] to deeply equal [ 'Avatar', 'Matrix', 'Zombieland' ]

[Killed] StringLiteral
features/movies/logic/sortMovies.ts:12:15
             return (b.rating ?? 0) - (a.rating ?? 0);
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
-         case "alpha": 
+         case "": 
             return (a.title || "").localeCompare(b.title || "");
          default: 
killedBy: sortMovies (Functional Core) deve ordenar os filmes alfabeticamente (alpha)
statusReason: expected [ 'Zombieland', 'Avatar', 'Matrix' ] to deeply equal [ 'Avatar', 'Matrix', 'Zombieland' ]

[Killed] ConditionalExpression
features/movies/logic/sortMovies.ts:13:21
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
          case "alpha": 
-            return (a.title || "").localeCompare(b.title || "");
+            return (true).localeCompare(b.title || "");
          default: 
             return b.id - a.id; 
killedBy: sortMovies (Functional Core) deve ordenar os filmes alfabeticamente (alpha)
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).localeCompare is not a function

[Killed] LogicalOperator
features/movies/logic/sortMovies.ts:13:21
          case "date": 
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
          case "alpha": 
-            return (a.title || "").localeCompare(b.title || "");
+            return (a.title && "").localeCompare(b.title || "");
          default: 
             return b.id - a.id; 
killedBy: sortMovies (Functional Core) deve ordenar os filmes alfabeticamente (alpha)
statusReason: expected [ 'Matrix', 'Avatar', 'Zombieland' ] to deeply equal [ 'Avatar', 'Matrix', 'Zombieland' ]

[Killed] ConditionalExpression
features/movies/logic/sortMovies.ts:14:10
             return new Date(b.release_date || "1900").getTime() - new Date(a.release_date || "1900").getTime();
          case "alpha": 
             return (a.title || "").localeCompare(b.title || "");
-         default: 
-            return b.id - a.id; 
+         default: 
       }
    });
killedBy: sortMovies (Functional Core) deve retornar o array intacto se a ordem for 'default' (id decrescente)
statusReason: expected [ 10, 20, 5 ] to deeply equal [ 20, 10, 5 ]

[Killed] ArithmeticOperator
features/movies/logic/sortMovies.ts:15:20
          case "alpha": 
             return (a.title || "").localeCompare(b.title || "");
          default: 
-            return b.id - a.id; 
+            return b.id + a.id; 
       }
    });
killedBy: sortMovies (Functional Core) deve retornar o array intacto se a ordem for 'default' (id decrescente)
statusReason: expected [ 10, 20, 5 ] to deeply equal [ 20, 10, 5 ]
