[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:46:46
    runtime: number;
 }
 
-export async function getAuthenticatedUser() {
-   const {
-      data: { user },
-      error,
-   } = await supabase.auth.getUser();
-
-   if (error || !user) return null;
-   return user;
-}
+export async function getAuthenticatedUser() {}
 
 export async function hasUserReview(userId: string, tmdbId: number): Promise<boolean> {
killedBy: moviePersistenceService returns null when user is unauthenticated
statusReason: expected undefined to be null

[Killed] BooleanLiteral
features/movies/services/moviePersistenceService.ts:52:17
       error,
    } = await supabase.auth.getUser();
 
-   if (error || !user) return null;
+   if (error || user) return null;
    return user;
 }
killedBy: moviePersistenceService returns authenticated user
statusReason: expected null to deeply equal { id: 'u1' }

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:52:8
       error,
    } = await supabase.auth.getUser();
 
-   if (error || !user) return null;
+   if (true) return null;
    return user;
 }
killedBy: moviePersistenceService returns authenticated user
statusReason: expected null to deeply equal { id: 'u1' }

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:56:87
    return user;
 }
 
-export async function hasUserReview(userId: string, tmdbId: number): Promise<boolean> {
-   const { data, error } = await supabase
-      .from("reviews")
-      .select("id")
-      .eq("user_id", userId)
-      .eq("tmdb_id", tmdbId)
-      .maybeSingle();
-
-   if (error) throw error;
-   return !!data;
-}
+export async function hasUserReview(userId: string, tmdbId: number): Promise<boolean> {}
 
 export async function getExistingProfileReview(
killedBy: moviePersistenceService checks if user review exists
statusReason: expected undefined to be true // Object.is equality

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:59:15
 export async function hasUserReview(userId: string, tmdbId: number): Promise<boolean> {
    const { data, error } = await supabase
       .from("reviews")
-      .select("id")
+      .select("")
       .eq("user_id", userId)
       .eq("tmdb_id", tmdbId)

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:60:11
    const { data, error } = await supabase
       .from("reviews")
       .select("id")
-      .eq("user_id", userId)
+      .eq("", userId)
       .eq("tmdb_id", tmdbId)
       .maybeSingle();

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:61:11
       .from("reviews")
       .select("id")
       .eq("user_id", userId)
-      .eq("tmdb_id", tmdbId)
+      .eq("", tmdbId)
       .maybeSingle();
 

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:71:42
 export async function getExistingProfileReview(
    userId: string,
    tmdbId: number
-): Promise<ExistingProfileReview | null> {
-   const { data, error } = await supabase
-      .from("reviews")
-      .select("id, status")
-      .eq("user_id", userId)
-      .eq("tmdb_id", tmdbId)
-      .maybeSingle();
-
-   if (error) throw error;
-   return (data as ExistingProfileReview | null) || null;
-}
+): Promise<ExistingProfileReview | null> {}
 
 export async function uploadReviewAttachment(userId: string, attachmentFile: File): Promise<string> {
killedBy: moviePersistenceService gets existing profile review with status
statusReason: expected undefined to deeply equal { id: 'r2', status: 'watched' }

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:75:11
    const { data, error } = await supabase
       .from("reviews")
       .select("id, status")
-      .eq("user_id", userId)
+      .eq("", userId)
       .eq("tmdb_id", tmdbId)
       .maybeSingle();

[Killed] LogicalOperator
features/movies/services/moviePersistenceService.ts:80:11
       .maybeSingle();
 
    if (error) throw error;
-   return (data as ExistingProfileReview | null) || null;
+   return data as ExistingProfileReview | null && null;
 }
 
killedBy: moviePersistenceService gets existing profile review with status
statusReason: expected null to deeply equal { id: 'r2', status: 'watched' }

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:80:11
       .maybeSingle();
 
    if (error) throw error;
-   return (data as ExistingProfileReview | null) || null;
+   return false;
 }
 
killedBy: moviePersistenceService gets existing profile review with status
statusReason: expected false to deeply equal { id: 'r2', status: 'watched' }

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:83:101
    return (data as ExistingProfileReview | null) || null;
 }
 
-export async function uploadReviewAttachment(userId: string, attachmentFile: File): Promise<string> {
-   const fileExt = attachmentFile.name.split(".").pop();
-   const fileName = `${userId}/${Date.now()}_${Math.random().toString(36).substring(7)}.${fileExt}`;
-
-   const { error: uploadError } = await supabase.storage
-      .from("review_attachments")
-      .upload(fileName, attachmentFile);
-
-   if (uploadError) throw uploadError;
-
-   const {
-      data: { publicUrl },
-   } = supabase.storage.from("review_attachments").getPublicUrl(fileName);
-
-   return publicUrl;
-}
+export async function uploadReviewAttachment(userId: string, attachmentFile: File): Promise<string> {}
 
 export async function upsertPersonalReview(
killedBy: moviePersistenceService uploads review attachment and returns public url
statusReason: expected undefined to be 'https://example.com/file.jpg' // Object.is equality

[Survived] MethodExpression
features/movies/services/moviePersistenceService.ts:85:48
 
 export async function uploadReviewAttachment(userId: string, attachmentFile: File): Promise<string> {
    const fileExt = attachmentFile.name.split(".").pop();
-   const fileName = `${userId}/${Date.now()}_${Math.random().toString(36).substring(7)}.${fileExt}`;
+   const fileName = `${userId}/${Date.now()}_${Math.random().toString(36)}.${fileExt}`;
 
    const { error: uploadError } = await supabase.storage

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:88:13
    const fileName = `${userId}/${Date.now()}_${Math.random().toString(36).substring(7)}.${fileExt}`;
 
    const { error: uploadError } = await supabase.storage
-      .from("review_attachments")
+      .from("")
       .upload(fileName, attachmentFile);
 

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:91:8
       .from("review_attachments")
       .upload(fileName, attachmentFile);
 
-   if (uploadError) throw uploadError;
+   if (true) throw uploadError;
 
    const {
killedBy: moviePersistenceService uploads review attachment and returns public url
statusReason: null

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:91:8
       .from("review_attachments")
       .upload(fileName, attachmentFile);
 
-   if (uploadError) throw uploadError;
+   if (false) throw uploadError;
 
    const {
killedBy: moviePersistenceService throws when uploading review attachment fails
statusReason: promise resolved "'https://example.com/file.jpg'" instead of rejecting

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:95:30
 
    const {
       data: { publicUrl },
-   } = supabase.storage.from("review_attachments").getPublicUrl(fileName);
+   } = supabase.storage.from("").getPublicUrl(fileName);
 
    return publicUrl;

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:112:8
       .eq("tmdb_id", tmdbId)
       .maybeSingle();
 
-   if (existingError) throw existingError;
+   if (true) throw existingError;
 
    const reviewPayload = {
killedBy: moviePersistenceService upserts personal review by updating when record exists
statusReason: promise rejected "null" instead of resolving

[Survived] ConditionalExpression
features/movies/services/moviePersistenceService.ts:112:8
       .eq("tmdb_id", tmdbId)
       .maybeSingle();
 
-   if (existingError) throw existingError;
+   if (false) throw existingError;
 
    const reviewPayload = {

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:123:32
    const watchedDate = payload.watched_date;
    delete (reviewPayload as { watched_date?: string }).watched_date;
 
-   if (existingPersonalReview) {
-      const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
-      if (error) throw error;
-      if (payload.status === "watched") {
-         await saveDiaryEntry(userId, tmdbId, watchedDate);
-      }
-      return;
-   }
+   if (existingPersonalReview) {}
 
    const { error } = await supabase.from("reviews").insert([reviewPayload]);
killedBy: moviePersistenceService upserts personal review by updating when record exists
statusReason: promise rejected "TypeError: Cannot destructure property 'e…" instead of resolving

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:123:8
    const watchedDate = payload.watched_date;
    delete (reviewPayload as { watched_date?: string }).watched_date;
 
-   if (existingPersonalReview) {
+   if (false) {
       const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
       if (error) throw error;
killedBy: moviePersistenceService upserts personal review by updating when record exists
statusReason: promise rejected "TypeError: Cannot destructure property 'e…" instead of resolving

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:124:45
    delete (reviewPayload as { watched_date?: string }).watched_date;
 
    if (existingPersonalReview) {
-      const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
+      const { error } = await supabase.from("").update(reviewPayload).eq("id", existingPersonalReview.id);
       if (error) throw error;
       if (payload.status === "watched") {

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:125:11
 
    if (existingPersonalReview) {
       const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
-      if (error) throw error;
+      if (true) throw error;
       if (payload.status === "watched") {
          await saveDiaryEntry(userId, tmdbId, watchedDate);
killedBy: moviePersistenceService upserts personal review by updating when record exists
statusReason: promise rejected "null" instead of resolving

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:125:11
 
    if (existingPersonalReview) {
       const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
-      if (error) throw error;
+      if (false) throw error;
       if (payload.status === "watched") {
          await saveDiaryEntry(userId, tmdbId, watchedDate);
killedBy: moviePersistenceService throws when upserting personal review fails on update
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ConditionalExpression
features/movies/services/moviePersistenceService.ts:126:11
    if (existingPersonalReview) {
       const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
       if (error) throw error;
-      if (payload.status === "watched") {
+      if (false) {
          await saveDiaryEntry(userId, tmdbId, watchedDate);
       }

[Survived] EqualityOperator
features/movies/services/moviePersistenceService.ts:126:11
    if (existingPersonalReview) {
       const { error } = await supabase.from("reviews").update(reviewPayload).eq("id", existingPersonalReview.id);
       if (error) throw error;
-      if (payload.status === "watched") {
+      if (payload.status !== "watched") {
          await saveDiaryEntry(userId, tmdbId, watchedDate);
       }

[Survived] ArrayDeclaration
features/movies/services/moviePersistenceService.ts:132:60
       return;
    }
 
-   const { error } = await supabase.from("reviews").insert([reviewPayload]);
+   const { error } = await supabase.from("reviews").insert([]);
    if (error) throw error;
 

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:133:8
    }
 
    const { error } = await supabase.from("reviews").insert([reviewPayload]);
-   if (error) throw error;
+   if (true) throw error;
 
    if (payload.status === "watched") {
killedBy: moviePersistenceService upserts personal review by inserting when record does not exist
statusReason: promise rejected "null" instead of resolving

[Survived] ConditionalExpression
features/movies/services/moviePersistenceService.ts:133:8
    }
 
    const { error } = await supabase.from("reviews").insert([reviewPayload]);
-   if (error) throw error;
+   if (false) throw error;
 
    if (payload.status === "watched") {

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:135:38
    const { error } = await supabase.from("reviews").insert([reviewPayload]);
    if (error) throw error;
 
-   if (payload.status === "watched") {
-      await saveDiaryEntry(userId, tmdbId, watchedDate);
-   }
+   if (payload.status === "watched") {}
 }
 
killedBy: moviePersistenceService keeps success flow when diary notification fails
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:135:8
    const { error } = await supabase.from("reviews").insert([reviewPayload]);
    if (error) throw error;
 
-   if (payload.status === "watched") {
+   if (false) {
       await saveDiaryEntry(userId, tmdbId, watchedDate);
    }
killedBy: moviePersistenceService keeps success flow when diary notification fails
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:140:100
    }
 }
 
-async function saveDiaryEntry(userId: string, tmdbId: number, watchedDate?: string): Promise<void> {
-   const normalizedDate = watchedDate || new Date().toISOString().slice(0, 10);
-
-   const { error } = await supabase.from("diary_entries").upsert(
-      {
-         user_id: userId,
-         tmdb_id: tmdbId,
-         watched_date: normalizedDate,
-      },
-      {
-         onConflict: "user_id,tmdb_id,watched_date",
-         ignoreDuplicates: true,
-      }
-   );
-
-   if (error) {
-      throw error;
-   }
-
-   try {
-      await notifyFriendsDiaryActivity(userId, normalizedDate);
-   } catch (notifyError) {
-      console.error("Falha ao notificar amigos sobre watch no diary:", notifyError);
-   }
-}
+async function saveDiaryEntry(userId: string, tmdbId: number, watchedDate?: string): Promise<void> {}
 
 export async function upsertFullSharedListReview(
killedBy: moviePersistenceService keeps success flow when diary notification fails
statusReason: expected "vi.fn()" to be called at least once

[Survived] LogicalOperator
features/movies/services/moviePersistenceService.ts:141:27
 }
 
 async function saveDiaryEntry(userId: string, tmdbId: number, watchedDate?: string): Promise<void> {
-   const normalizedDate = watchedDate || new Date().toISOString().slice(0, 10);
+   const normalizedDate = watchedDate && new Date().toISOString().slice(0, 10);
 
    const { error } = await supabase.from("diary_entries").upsert(

[Survived] ConditionalExpression
features/movies/services/moviePersistenceService.ts:141:27
 }
 
 async function saveDiaryEntry(userId: string, tmdbId: number, watchedDate?: string): Promise<void> {
-   const normalizedDate = watchedDate || new Date().toISOString().slice(0, 10);
+   const normalizedDate = false;
 
    const { error } = await supabase.from("diary_entries").upsert(

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:143:42
 async function saveDiaryEntry(userId: string, tmdbId: number, watchedDate?: string): Promise<void> {
    const normalizedDate = watchedDate || new Date().toISOString().slice(0, 10);
 
-   const { error } = await supabase.from("diary_entries").upsert(
+   const { error } = await supabase.from("").upsert(
       {
          user_id: userId,

[Survived] ObjectLiteral
features/movies/services/moviePersistenceService.ts:149:7
          tmdb_id: tmdbId,
          watched_date: normalizedDate,
       },
-      {
-         onConflict: "user_id,tmdb_id,watched_date",
-         ignoreDuplicates: true,
-      }
+      {}
    );
 

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:159:8
       throw error;
    }
 
-   try {
-      await notifyFriendsDiaryActivity(userId, normalizedDate);
-   } catch (notifyError) {
+   try {} catch (notifyError) {
       console.error("Falha ao notificar amigos sobre watch no diary:", notifyError);
    }
killedBy: moviePersistenceService keeps success flow when diary notification fails
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:161:26
 
    try {
       await notifyFriendsDiaryActivity(userId, normalizedDate);
-   } catch (notifyError) {
-      console.error("Falha ao notificar amigos sobre watch no diary:", notifyError);
-   }
+   } catch (notifyError) {}
 }
 
killedBy: moviePersistenceService keeps success flow when diary notification fails
statusReason: expected "error" to be called at least once

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:181:8
 
    if (existingError) throw existingError;
 
-   if (existingGroupReview) {
+   if (false) {
       const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingGroupReview.id);
       if (error) throw error;
killedBy: moviePersistenceService upserts full shared list review by updating when record exists
statusReason: promise rejected "TypeError: Cannot destructure property 'e…" instead of resolving

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:181:29
 
    if (existingError) throw existingError;
 
-   if (existingGroupReview) {
-      const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingGroupReview.id);
-      if (error) throw error;
-      return;
-   }
+   if (existingGroupReview) {}
 
    const { error } = await supabase.from("list_reviews").insert({
killedBy: moviePersistenceService upserts full shared list review by updating when record exists
statusReason: promise rejected "TypeError: Cannot destructure property 'e…" instead of resolving

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:183:11
 
    if (existingGroupReview) {
       const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingGroupReview.id);
-      if (error) throw error;
+      if (true) throw error;
       return;
    }
killedBy: moviePersistenceService upserts full shared list review by updating when record exists
statusReason: promise rejected "null" instead of resolving

[Survived] ConditionalExpression
features/movies/services/moviePersistenceService.ts:183:11
 
    if (existingGroupReview) {
       const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingGroupReview.id);
-      if (error) throw error;
+      if (false) throw error;
       return;
    }

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:187:42
       return;
    }
 
-   const { error } = await supabase.from("list_reviews").insert({
+   const { error } = await supabase.from("").insert({
       list_id: listId,
       tmdb_id: tmdbId,

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:205:15
 ): Promise<void> {
    const { data: existingUserReview, error: existingError } = await supabase
       .from("list_reviews")
-      .select("id")
+      .select("")
       .eq("list_id", listId)
       .eq("tmdb_id", tmdbId)

[Survived] StringLiteral
features/movies/services/moviePersistenceService.ts:208:11
       .select("id")
       .eq("list_id", listId)
       .eq("tmdb_id", tmdbId)
-      .eq("user_id", userId)
+      .eq("", userId)
       .maybeSingle();
 

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:213:28
 
    if (existingError) throw existingError;
 
-   if (existingUserReview) {
-      const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingUserReview.id);
-      if (error) throw error;
-      return;
-   }
+   if (existingUserReview) {}
 
    const { error } = await supabase.from("list_reviews").insert({
killedBy: moviePersistenceService throws when upserting partial shared review update fails
statusReason: expected [Function] to throw error including 'partial-update-failed' but got 'Cannot destructure property \'error\'…'

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:213:8
 
    if (existingError) throw existingError;
 
-   if (existingUserReview) {
+   if (true) {
       const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingUserReview.id);
       if (error) throw error;
killedBy: moviePersistenceService upserts partial shared list review by inserting when record does not exist
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] ConditionalExpression
features/movies/services/moviePersistenceService.ts:215:11
 
    if (existingUserReview) {
       const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingUserReview.id);
-      if (error) throw error;
+      if (false) throw error;
       return;
    }
killedBy: moviePersistenceService throws when upserting partial shared review update fails
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ConditionalExpression
features/movies/services/moviePersistenceService.ts:215:11
 
    if (existingUserReview) {
       const { error } = await supabase.from("list_reviews").update(payload).eq("id", existingUserReview.id);
-      if (error) throw error;
+      if (true) throw error;
       return;
    }

[Killed] BlockStatement
features/movies/services/moviePersistenceService.ts:229:94
    if (error) throw error;
 }
 
-export async function syncReviewToListMembers(payload: SyncListReviewPayload): Promise<void> {
-   const { error } = await supabase.rpc("sync_review_to_list_members", {
-      p_list_id: payload.listId,
-      p_tmdb_id: payload.tmdbId,
-      p_rating: payload.rating,
-      p_review: payload.review,
-      p_recommended: payload.recommended,
-      p_status: payload.status,
-      p_added_by: payload.addedBy,
-      p_location: payload.location,
-      p_runtime: payload.runtime,
-   });
-
-   if (error) throw error;
-}
+export async function syncReviewToListMembers(payload: SyncListReviewPayload): Promise<void> {}
 
killedBy: moviePersistenceService throws when sync rpc returns error
statusReason: promise resolved "undefined" instead of rejecting
