[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:15:23
  */
 export async function enrichMovieWithTmdb(
    movie: BaseMovieRow 
-): Promise<MovieData> {
-   try {
-      const { data } = await axios.get<TmdbRawResponse>(
-         `${BASE_URL}/movie/${movie.tmdb_id}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits,watch/providers`
-      );
-
-      return mapTmdbToMovieData(movie, data, OSCAR_NOMINEES_IDS);
-      
-   } catch (err) {
-      console.error(`Erro TMDB ID ${movie.tmdb_id}`, err);
-      return { ...movie } as MovieData;
-   }
-}
+): Promise<MovieData> {}
 
 /**

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:16:8
 export async function enrichMovieWithTmdb(
    movie: BaseMovieRow 
 ): Promise<MovieData> {
-   try {
-      const { data } = await axios.get<TmdbRawResponse>(
-         `${BASE_URL}/movie/${movie.tmdb_id}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits,watch/providers`
-      );
-
-      return mapTmdbToMovieData(movie, data, OSCAR_NOMINEES_IDS);
-      
-   } catch (err) {
+   try {} catch (err) {
       console.error(`Erro TMDB ID ${movie.tmdb_id}`, err);
       return { ...movie } as MovieData;

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:18:10
 ): Promise<MovieData> {
    try {
       const { data } = await axios.get<TmdbRawResponse>(
-         `${BASE_URL}/movie/${movie.tmdb_id}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits,watch/providers`
+         ``
       );
 

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:23:18
 
       return mapTmdbToMovieData(movie, data, OSCAR_NOMINEES_IDS);
       
-   } catch (err) {
-      console.error(`Erro TMDB ID ${movie.tmdb_id}`, err);
-      return { ...movie } as MovieData;
-   }
+   } catch (err) {}
 }
 

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:32:51
 /**
  * Busca filmes pelo nome no TMDB (para o modal de adição).
  */
-export async function searchMovies(query: string) {
-   try {
-      const { data } = await axios.get(
-         `${BASE_URL}/search/movie?api_key=${API_KEY}&language=pt-BR&query=${encodeURIComponent(query)}`
-      );
-      return data.results.slice(0, 5);
-   } catch (err) {
-      console.error("Erro ao buscar filmes no TMDB:", err);
-      return [];
-   }
-}
+export async function searchMovies(query: string) {}
 
 // Busca detalhes extras de um filme específico (como a duração em minutos)

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:33:8
  * Busca filmes pelo nome no TMDB (para o modal de adição).
  */
 export async function searchMovies(query: string) {
-   try {
-      const { data } = await axios.get(
-         `${BASE_URL}/search/movie?api_key=${API_KEY}&language=pt-BR&query=${encodeURIComponent(query)}`
-      );
-      return data.results.slice(0, 5);
-   } catch (err) {
+   try {} catch (err) {
       console.error("Erro ao buscar filmes no TMDB:", err);
       return [];

[NoCoverage] MethodExpression
features/movies/services/tmdbService.ts:37:14
       const { data } = await axios.get(
          `${BASE_URL}/search/movie?api_key=${API_KEY}&language=pt-BR&query=${encodeURIComponent(query)}`
       );
-      return data.results.slice(0, 5);
+      return data.results;
    } catch (err) {
       console.error("Erro ao buscar filmes no TMDB:", err);

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:38:18
          `${BASE_URL}/search/movie?api_key=${API_KEY}&language=pt-BR&query=${encodeURIComponent(query)}`
       );
       return data.results.slice(0, 5);
-   } catch (err) {
-      console.error("Erro ao buscar filmes no TMDB:", err);
-      return [];
-   }
+   } catch (err) {}
 }
 

[NoCoverage] ArrayDeclaration
features/movies/services/tmdbService.ts:40:14
       return data.results.slice(0, 5);
    } catch (err) {
       console.error("Erro ao buscar filmes no TMDB:", err);
-      return [];
+      return ["Stryker was here"];
    }
 }

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:45:58
 }
 
 // Busca detalhes extras de um filme específico (como a duração em minutos)
-export const getMovieDetails = async (tmdbId: number) => {
-   try {
-      const response = await fetch(
-         `${BASE_URL}/movie/${tmdbId}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits`
-      );
-      if (!response.ok) throw new Error("Erro ao buscar detalhes do filme");
-      
-      const data = await response.json();
-      return data; // Isso vai conter o campo 'runtime'
-   } catch (error) {
-      console.error(error);
-      return null;
-   }
-};
+export const getMovieDetails = async (tmdbId: number) => {};
 
 interface TmdbDiscoverMovieResult {

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:46:8
 
 // Busca detalhes extras de um filme específico (como a duração em minutos)
 export const getMovieDetails = async (tmdbId: number) => {
-   try {
-      const response = await fetch(
-         `${BASE_URL}/movie/${tmdbId}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits`
-      );
-      if (!response.ok) throw new Error("Erro ao buscar detalhes do filme");
-      
-      const data = await response.json();
-      return data; // Isso vai conter o campo 'runtime'
-   } catch (error) {
+   try {} catch (error) {
       console.error(error);
       return null;

[NoCoverage] BooleanLiteral
features/movies/services/tmdbService.ts:50:11
       const response = await fetch(
          `${BASE_URL}/movie/${tmdbId}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits`
       );
-      if (!response.ok) throw new Error("Erro ao buscar detalhes do filme");
+      if (response.ok) throw new Error("Erro ao buscar detalhes do filme");
       
       const data = await response.json();

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:50:11
       const response = await fetch(
          `${BASE_URL}/movie/${tmdbId}?api_key=${API_KEY}&language=pt-BR&append_to_response=credits`
       );
-      if (!response.ok) throw new Error("Erro ao buscar detalhes do filme");
+      if (false) throw new Error("Erro ao buscar detalhes do filme");
       
       const data = await response.json();

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:54:20
       
       const data = await response.json();
       return data; // Isso vai conter o campo 'runtime'
-   } catch (error) {
-      console.error(error);
-      return null;
-   }
+   } catch (error) {}
 };
 

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:82:44
    voteCountGte?: number;
 }
 
-function buildSeed(source: string): number {
-   let hash = 0;
-   for (let i = 0; i < source.length; i += 1) {
-      hash = (hash * 31 + source.charCodeAt(i)) >>> 0;
-   }
-   return hash;
-}
+function buildSeed(source: string): number {}
 
 function toMovieDataFromDiscover(item: TmdbDiscoverMovieResult, dateKey: string): MovieData {

[NoCoverage] EqualityOperator
features/movies/services/tmdbService.ts:84:20
 
 function buildSeed(source: string): number {
    let hash = 0;
-   for (let i = 0; i < source.length; i += 1) {
+   for (let i = 0; i <= source.length; i += 1) {
       hash = (hash * 31 + source.charCodeAt(i)) >>> 0;
    }

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:84:47
 
 function buildSeed(source: string): number {
    let hash = 0;
-   for (let i = 0; i < source.length; i += 1) {
-      hash = (hash * 31 + source.charCodeAt(i)) >>> 0;
-   }
+   for (let i = 0; i < source.length; i += 1) {}
    return hash;
 }

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:90:93
    return hash;
 }
 
-function toMovieDataFromDiscover(item: TmdbDiscoverMovieResult, dateKey: string): MovieData {
-   return {
-      id: -item.id,
-      tmdb_id: item.id,
-      rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
-      review: "",
-      recommended: "",
-      created_at: `${dateKey}T00:00:00.000Z`,
-      title: item.title || "Sem titulo",
-      poster_path: item.poster_path || undefined,
-      release_date: item.release_date || undefined,
-      overview: item.overview || undefined,
-      director: "Nao informado",
-      status: "watched",
-      genres: [],
-      countries: [],
-      cast: [],
-   };
-}
+function toMovieDataFromDiscover(item: TmdbDiscoverMovieResult, dateKey: string): MovieData {}
 
 export async function discoverMovies(options: DiscoverMovieOptions = {}): Promise<TmdbDiscoverMovieResult[]> {

[NoCoverage] UnaryOperator
features/movies/services/tmdbService.ts:92:11
 
 function toMovieDataFromDiscover(item: TmdbDiscoverMovieResult, dateKey: string): MovieData {
    return {
-      id: -item.id,
+      id: +item.id,
       tmdb_id: item.id,
       rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:94:15
    return {
       id: -item.id,
       tmdb_id: item.id,
-      rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
+      rating: true ? Number(item.vote_average.toFixed(1)) : null,
       review: "",
       recommended: "",

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:94:15
    return {
       id: -item.id,
       tmdb_id: item.id,
-      rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
+      rating: false ? Number(item.vote_average.toFixed(1)) : null,
       review: "",
       recommended: "",

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:95:15
       id: -item.id,
       tmdb_id: item.id,
       rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
-      review: "",
+      review: "Stryker was here!",
       recommended: "",
       created_at: `${dateKey}T00:00:00.000Z`,

[NoCoverage] LogicalOperator
features/movies/services/tmdbService.ts:98:14
       review: "",
       recommended: "",
       created_at: `${dateKey}T00:00:00.000Z`,
-      title: item.title || "Sem titulo",
+      title: item.title && "Sem titulo",
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:98:14
       review: "",
       recommended: "",
       created_at: `${dateKey}T00:00:00.000Z`,
-      title: item.title || "Sem titulo",
+      title: true,
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:99:20
       recommended: "",
       created_at: `${dateKey}T00:00:00.000Z`,
       title: item.title || "Sem titulo",
-      poster_path: item.poster_path || undefined,
+      poster_path: false,
       release_date: item.release_date || undefined,
       overview: item.overview || undefined,

[NoCoverage] LogicalOperator
features/movies/services/tmdbService.ts:99:20
       recommended: "",
       created_at: `${dateKey}T00:00:00.000Z`,
       title: item.title || "Sem titulo",
-      poster_path: item.poster_path || undefined,
+      poster_path: item.poster_path && undefined,
       release_date: item.release_date || undefined,
       overview: item.overview || undefined,

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:100:21
       created_at: `${dateKey}T00:00:00.000Z`,
       title: item.title || "Sem titulo",
       poster_path: item.poster_path || undefined,
-      release_date: item.release_date || undefined,
+      release_date: false,
       overview: item.overview || undefined,
       director: "Nao informado",

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:100:21
       created_at: `${dateKey}T00:00:00.000Z`,
       title: item.title || "Sem titulo",
       poster_path: item.poster_path || undefined,
-      release_date: item.release_date || undefined,
+      release_date: true,
       overview: item.overview || undefined,
       director: "Nao informado",

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:101:17
       title: item.title || "Sem titulo",
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,
-      overview: item.overview || undefined,
+      overview: false,
       director: "Nao informado",
       status: "watched",

[NoCoverage] LogicalOperator
features/movies/services/tmdbService.ts:101:17
       title: item.title || "Sem titulo",
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,
-      overview: item.overview || undefined,
+      overview: item.overview && undefined,
       director: "Nao informado",
       status: "watched",

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:102:17
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,
       overview: item.overview || undefined,
-      director: "Nao informado",
+      director: "",
       status: "watched",
       genres: [],

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:103:15
       release_date: item.release_date || undefined,
       overview: item.overview || undefined,
       director: "Nao informado",
-      status: "watched",
+      status: "",
       genres: [],
       countries: [],

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:110:110
    };
 }
 
-export async function discoverMovies(options: DiscoverMovieOptions = {}): Promise<TmdbDiscoverMovieResult[]> {
-   const {
-      page = 1,
-      withGenres = [],
-      sortBy = "popularity.desc",
-      voteCountGte = 0,
-   } = options;
-
-   try {
-      const withGenresParam = withGenres.length > 0 ? `&with_genres=${withGenres.join(",")}` : "";
-
-      const { data } = await axios.get<TmdbDiscoverResponse>(
-         `${BASE_URL}/discover/movie?api_key=${API_KEY}&language=pt-BR&sort_by=${sortBy}&include_adult=false&include_video=false&page=${page}&vote_count.gte=${voteCountGte}${withGenresParam}`
-      );
-
-      return data.results || [];
-   } catch (error) {
-      console.error("Erro ao buscar filmes discover do TMDB:", error);
-      return [];
-   }
-}
+export async function discoverMovies(options: DiscoverMovieOptions = {}): Promise<TmdbDiscoverMovieResult[]> {}
 
 export async function getDailyBattleTmdbPool(dateKey: string, count = 16): Promise<MovieData[]> {

[NoCoverage] ArrayDeclaration
features/movies/services/tmdbService.ts:113:20
 export async function discoverMovies(options: DiscoverMovieOptions = {}): Promise<TmdbDiscoverMovieResult[]> {
    const {
       page = 1,
-      withGenres = [],
+      withGenres = ["Stryker was here"],
       sortBy = "popularity.desc",
       voteCountGte = 0,

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:114:16
    const {
       page = 1,
       withGenres = [],
-      sortBy = "popularity.desc",
+      sortBy = "",
       voteCountGte = 0,
    } = options;

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:118:8
       voteCountGte = 0,
    } = options;
 
-   try {
-      const withGenresParam = withGenres.length > 0 ? `&with_genres=${withGenres.join(",")}` : "";
-
-      const { data } = await axios.get<TmdbDiscoverResponse>(
-         `${BASE_URL}/discover/movie?api_key=${API_KEY}&language=pt-BR&sort_by=${sortBy}&include_adult=false&include_video=false&page=${page}&vote_count.gte=${voteCountGte}${withGenresParam}`
-      );
-
-      return data.results || [];
-   } catch (error) {
+   try {} catch (error) {
       console.error("Erro ao buscar filmes discover do TMDB:", error);
       return [];

[NoCoverage] EqualityOperator
features/movies/services/tmdbService.ts:119:31
    } = options;
 
    try {
-      const withGenresParam = withGenres.length > 0 ? `&with_genres=${withGenres.join(",")}` : "";
+      const withGenresParam = withGenres.length >= 0 ? `&with_genres=${withGenres.join(",")}` : "";
 
       const { data } = await axios.get<TmdbDiscoverResponse>(

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:119:31
    } = options;
 
    try {
-      const withGenresParam = withGenres.length > 0 ? `&with_genres=${withGenres.join(",")}` : "";
+      const withGenresParam = true ? `&with_genres=${withGenres.join(",")}` : "";
 
       const { data } = await axios.get<TmdbDiscoverResponse>(

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:122:10
       const withGenresParam = withGenres.length > 0 ? `&with_genres=${withGenres.join(",")}` : "";
 
       const { data } = await axios.get<TmdbDiscoverResponse>(
-         `${BASE_URL}/discover/movie?api_key=${API_KEY}&language=pt-BR&sort_by=${sortBy}&include_adult=false&include_video=false&page=${page}&vote_count.gte=${voteCountGte}${withGenresParam}`
+         ``
       );
 

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:125:14
          `${BASE_URL}/discover/movie?api_key=${API_KEY}&language=pt-BR&sort_by=${sortBy}&include_adult=false&include_video=false&page=${page}&vote_count.gte=${voteCountGte}${withGenresParam}`
       );
 
-      return data.results || [];
+      return true;
    } catch (error) {
       console.error("Erro ao buscar filmes discover do TMDB:", error);

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:125:14
          `${BASE_URL}/discover/movie?api_key=${API_KEY}&language=pt-BR&sort_by=${sortBy}&include_adult=false&include_video=false&page=${page}&vote_count.gte=${voteCountGte}${withGenresParam}`
       );
 
-      return data.results || [];
+      return false;
    } catch (error) {
       console.error("Erro ao buscar filmes discover do TMDB:", error);

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:126:20
       );
 
       return data.results || [];
-   } catch (error) {
-      console.error("Erro ao buscar filmes discover do TMDB:", error);
-      return [];
-   }
+   } catch (error) {}
 }
 

[NoCoverage] ArithmeticOperator
features/movies/services/tmdbService.ts:135:26
 export async function getDailyBattleTmdbPool(dateKey: string, count = 16): Promise<MovieData[]> {
    try {
       const baseSeed = buildSeed(`battle-daily-16|${dateKey}`);
-      const startPage = (baseSeed % 8) + 1;
+      const startPage = (baseSeed * 8) + 1;
       const pages = [startPage, startPage + 1, startPage + 2].map((page) => ((page - 1) % 20) + 1);
 

[NoCoverage] ArithmeticOperator
features/movies/services/tmdbService.ts:135:25
 export async function getDailyBattleTmdbPool(dateKey: string, count = 16): Promise<MovieData[]> {
    try {
       const baseSeed = buildSeed(`battle-daily-16|${dateKey}`);
-      const startPage = (baseSeed % 8) + 1;
+      const startPage = baseSeed % 8 - 1;
       const pages = [startPage, startPage + 1, startPage + 2].map((page) => ((page - 1) % 20) + 1);
 

[NoCoverage] ArrowFunction
features/movies/services/tmdbService.ts:136:67
    try {
       const baseSeed = buildSeed(`battle-daily-16|${dateKey}`);
       const startPage = (baseSeed % 8) + 1;
-      const pages = [startPage, startPage + 1, startPage + 2].map((page) => ((page - 1) % 20) + 1);
+      const pages = [startPage, startPage + 1, startPage + 2].map(() => undefined);
 
       const responses = await Promise.all(

[NoCoverage] ArithmeticOperator
features/movies/services/tmdbService.ts:136:77
    try {
       const baseSeed = buildSeed(`battle-daily-16|${dateKey}`);
       const startPage = (baseSeed % 8) + 1;
-      const pages = [startPage, startPage + 1, startPage + 2].map((page) => ((page - 1) % 20) + 1);
+      const pages = [startPage, startPage + 1, startPage + 2].map((page) => (page - 1) % 20 - 1);
 
       const responses = await Promise.all(

[NoCoverage] ArrowFunction
features/movies/services/tmdbService.ts:139:20
       const pages = [startPage, startPage + 1, startPage + 2].map((page) => ((page - 1) % 20) + 1);
 
       const responses = await Promise.all(
-         pages.map((page) =>
-            discoverMovies({
-               page,
-               sortBy: "popularity.desc",
-               voteCountGte: 250,
-            })
+         pages.map(() => undefined
          )
       );

[NoCoverage] ArrowFunction
features/movies/services/tmdbService.ts:148:67
          )
       );
 
-      const pool = responses.flatMap((results) => results).filter((item) => item?.id && item.poster_path);
+      const pool = responses.flatMap((results) => results).filter(() => undefined);
       const unique = pool.filter((item, index, arr) => arr.findIndex((other) => other.id === item.id) === index);
 

[NoCoverage] OptionalChaining
features/movies/services/tmdbService.ts:148:77
          )
       );
 
-      const pool = responses.flatMap((results) => results).filter((item) => item?.id && item.poster_path);
+      const pool = responses.flatMap((results) => results).filter((item) => item.id && item.poster_path);
       const unique = pool.filter((item, index, arr) => arr.findIndex((other) => other.id === item.id) === index);
 

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:149:56
       );
 
       const pool = responses.flatMap((results) => results).filter((item) => item?.id && item.poster_path);
-      const unique = pool.filter((item, index, arr) => arr.findIndex((other) => other.id === item.id) === index);
+      const unique = pool.filter((item, index, arr) => false);
 
       if (unique.length === 0) {

[NoCoverage] ArrowFunction
features/movies/services/tmdbService.ts:149:70
       );
 
       const pool = responses.flatMap((results) => results).filter((item) => item?.id && item.poster_path);
-      const unique = pool.filter((item, index, arr) => arr.findIndex((other) => other.id === item.id) === index);
+      const unique = pool.filter((item, index, arr) => arr.findIndex(() => undefined) === index);
 
       if (unique.length === 0) {

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:151:11
       const pool = responses.flatMap((results) => results).filter((item) => item?.id && item.poster_path);
       const unique = pool.filter((item, index, arr) => arr.findIndex((other) => other.id === item.id) === index);
 
-      if (unique.length === 0) {
+      if (true) {
          return [];
       }

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:151:32
       const pool = responses.flatMap((results) => results).filter((item) => item?.id && item.poster_path);
       const unique = pool.filter((item, index, arr) => arr.findIndex((other) => other.id === item.id) === index);
 
-      if (unique.length === 0) {
-         return [];
-      }
+      if (unique.length === 0) {}
 
       const picked: TmdbDiscoverMovieResult[] = [];

[NoCoverage] MethodExpression
features/movies/services/tmdbService.ts:159:30
       const copy = [...unique];
       let cursor = baseSeed;
 
-      while (picked.length < Math.min(count, copy.length)) {
+      while (picked.length < Math.max(count, copy.length)) {
          const idx = cursor % copy.length;
          picked.push(copy[idx]);

[NoCoverage] ConditionalExpression
features/movies/services/tmdbService.ts:159:14
       const copy = [...unique];
       let cursor = baseSeed;
 
-      while (picked.length < Math.min(count, copy.length)) {
+      while (false) {
          const idx = cursor % copy.length;
          picked.push(copy[idx]);

[NoCoverage] ArithmeticOperator
features/movies/services/tmdbService.ts:160:22
       let cursor = baseSeed;
 
       while (picked.length < Math.min(count, copy.length)) {
-         const idx = cursor % copy.length;
+         const idx = cursor * copy.length;
          picked.push(copy[idx]);
          copy.splice(idx, 1);

[NoCoverage] ArithmeticOperator
features/movies/services/tmdbService.ts:163:20
          const idx = cursor % copy.length;
          picked.push(copy[idx]);
          copy.splice(idx, 1);
-         cursor = (cursor * 17 + 11) >>> 0;
+         cursor = (cursor / 17 + 11) >>> 0;
       }
 

[NoCoverage] ArithmeticOperator
features/movies/services/tmdbService.ts:163:20
          const idx = cursor % copy.length;
          picked.push(copy[idx]);
          copy.splice(idx, 1);
-         cursor = (cursor * 17 + 11) >>> 0;
+         cursor = (cursor * 17 - 11) >>> 0;
       }
 

[NoCoverage] ArrowFunction
features/movies/services/tmdbService.ts:166:25
          cursor = (cursor * 17 + 11) >>> 0;
       }
 
-      return picked.map((item) => toMovieDataFromDiscover(item, dateKey));
+      return picked.map(() => undefined);
    } catch (error) {
       console.error("Erro ao montar pool diário da batalha via TMDB:", error);

[NoCoverage] BlockStatement
features/movies/services/tmdbService.ts:167:20
       }
 
       return picked.map((item) => toMovieDataFromDiscover(item, dateKey));
-   } catch (error) {
-      console.error("Erro ao montar pool diário da batalha via TMDB:", error);
-      return [];
-   }
+   } catch (error) {}
 }

[NoCoverage] StringLiteral
features/movies/services/tmdbService.ts:168:21
 
       return picked.map((item) => toMovieDataFromDiscover(item, dateKey));
    } catch (error) {
-      console.error("Erro ao montar pool diário da batalha via TMDB:", error);
+      console.error("", error);
       return [];
    }
