[NoCoverage] BooleanLiteral
features/notifications/hooks/useNotifications.ts:14:43
 export function useNotifications(userId?: string) {
    const [notifications, setNotifications] = useState<AppNotification[]>([]);
    const [unreadCount, setUnreadCount] = useState(0);
-   const [loading, setLoading] = useState(false);
+   const [loading, setLoading] = useState(true);
 
    const fetchNotifications = useCallback(async () => {

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:16:55
    const [unreadCount, setUnreadCount] = useState(0);
    const [loading, setLoading] = useState(false);
 
-   const fetchNotifications = useCallback(async () => {
-      if (!userId) return;
-      setLoading(true);
-      
-      try {
-         const data = await fetchRecentNotifications(userId);
-
-         const formattedData = formatNotifications(data as RawNotification[]);
-         setNotifications(formattedData);
-         setUnreadCount(countUnread(formattedData));
-
-      } catch (error) {
-         console.error("Erro ao processar notificações:", error);
-      } finally {
-         setLoading(false);
-      }
-    }, [userId]);
+   const fetchNotifications = useCallback(async () => {}, [userId]);
 
    // Marca uma notificação específica como lida

[NoCoverage] BooleanLiteral
features/notifications/hooks/useNotifications.ts:17:11
    const [loading, setLoading] = useState(false);
 
    const fetchNotifications = useCallback(async () => {
-      if (!userId) return;
+      if (userId) return;
       setLoading(true);
       

[NoCoverage] ConditionalExpression
features/notifications/hooks/useNotifications.ts:17:11
    const [loading, setLoading] = useState(false);
 
    const fetchNotifications = useCallback(async () => {
-      if (!userId) return;
+      if (false) return;
       setLoading(true);
       

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:20:11
       if (!userId) return;
       setLoading(true);
       
-      try {
-         const data = await fetchRecentNotifications(userId);
-
-         const formattedData = formatNotifications(data as RawNotification[]);
-         setNotifications(formattedData);
-         setUnreadCount(countUnread(formattedData));
-
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao processar notificações:", error);
       } finally {

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:27:23
          setNotifications(formattedData);
          setUnreadCount(countUnread(formattedData));
 
-      } catch (error) {
-         console.error("Erro ao processar notificações:", error);
-      } finally {
+      } catch (error) {} finally {
          setLoading(false);
       }

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:29:17
 
       } catch (error) {
          console.error("Erro ao processar notificações:", error);
-      } finally {
-         setLoading(false);
-      }
+      } finally {}
     }, [userId]);
 

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:35:57
     }, [userId]);
 
    // Marca uma notificação específica como lida
-   const markAsRead = async (notificationId: string) => {
-      try {
-         await markNotificationAsRead(notificationId);
-
-         setNotifications((prev) => {
-            const updated = prev.map((n) => (n.id === notificationId ? { ...n, is_read: true } : n));
-            setUnreadCount(countUnread(updated)); 
-            return updated;
-         });
-
-      } catch (error) {
-         console.error("Erro ao marcar como lida:", error);
-      }
-   };
+   const markAsRead = async (notificationId: string) => {};
 
    // Marca TODAS como lidas de uma vez

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:36:11
 
    // Marca uma notificação específica como lida
    const markAsRead = async (notificationId: string) => {
-      try {
-         await markNotificationAsRead(notificationId);
-
-         setNotifications((prev) => {
-            const updated = prev.map((n) => (n.id === notificationId ? { ...n, is_read: true } : n));
-            setUnreadCount(countUnread(updated)); 
-            return updated;
-         });
-
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao marcar como lida:", error);
       }

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:39:37
       try {
          await markNotificationAsRead(notificationId);
 
-         setNotifications((prev) => {
-            const updated = prev.map((n) => (n.id === notificationId ? { ...n, is_read: true } : n));
-            setUnreadCount(countUnread(updated)); 
-            return updated;
-         });
+         setNotifications((prev) => {});
 
       } catch (error) {

[NoCoverage] EqualityOperator
features/notifications/hooks/useNotifications.ts:40:46
          await markNotificationAsRead(notificationId);
 
          setNotifications((prev) => {
-            const updated = prev.map((n) => (n.id === notificationId ? { ...n, is_read: true } : n));
+            const updated = prev.map((n) => (n.id !== notificationId ? { ...n, is_read: true } : n));
             setUnreadCount(countUnread(updated)); 
             return updated;

[NoCoverage] ArrowFunction
features/notifications/hooks/useNotifications.ts:40:38
          await markNotificationAsRead(notificationId);
 
          setNotifications((prev) => {
-            const updated = prev.map((n) => (n.id === notificationId ? { ...n, is_read: true } : n));
+            const updated = prev.map(() => undefined);
             setUnreadCount(countUnread(updated)); 
             return updated;

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:45:23
             return updated;
          });
 
-      } catch (error) {
-         console.error("Erro ao marcar como lida:", error);
-      }
+      } catch (error) {}
    };
 

[NoCoverage] StringLiteral
features/notifications/hooks/useNotifications.ts:46:24
          });
 
       } catch (error) {
-         console.error("Erro ao marcar como lida:", error);
+         console.error("", error);
       }
    };

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:51:38
    };
 
    // Marca TODAS como lidas de uma vez
-   const markAllAsRead = async () => {
-      if (!userId || unreadCount === 0) return;
-      try {
-         await markAllUserNotificationsAsRead(userId);
-
-         setNotifications((prev) => {
-            const updated = prev.map((n) => ({ ...n, is_read: true }));
-            setUnreadCount(countUnread(updated)); 
-            return updated;
-         });
-      } catch (error) {
-         console.error("Erro ao marcar todas como lidas:", error);
-      }
-   };
+   const markAllAsRead = async () => {};
 
    useEffect(() => {

[NoCoverage] EqualityOperator
features/notifications/hooks/useNotifications.ts:52:22
 
    // Marca TODAS como lidas de uma vez
    const markAllAsRead = async () => {
-      if (!userId || unreadCount === 0) return;
+      if (!userId || unreadCount !== 0) return;
       try {
          await markAllUserNotificationsAsRead(userId);

[NoCoverage] LogicalOperator
features/notifications/hooks/useNotifications.ts:52:11
 
    // Marca TODAS como lidas de uma vez
    const markAllAsRead = async () => {
-      if (!userId || unreadCount === 0) return;
+      if (!userId && unreadCount === 0) return;
       try {
          await markAllUserNotificationsAsRead(userId);

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:53:11
    // Marca TODAS como lidas de uma vez
    const markAllAsRead = async () => {
       if (!userId || unreadCount === 0) return;
-      try {
-         await markAllUserNotificationsAsRead(userId);
-
-         setNotifications((prev) => {
-            const updated = prev.map((n) => ({ ...n, is_read: true }));
-            setUnreadCount(countUnread(updated)); 
-            return updated;
-         });
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao marcar todas como lidas:", error);
       }

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:56:37
       try {
          await markAllUserNotificationsAsRead(userId);
 
-         setNotifications((prev) => {
-            const updated = prev.map((n) => ({ ...n, is_read: true }));
-            setUnreadCount(countUnread(updated)); 
-            return updated;
-         });
+         setNotifications((prev) => {});
       } catch (error) {
          console.error("Erro ao marcar todas como lidas:", error);

[NoCoverage] ArrowFunction
features/notifications/hooks/useNotifications.ts:57:38
          await markAllUserNotificationsAsRead(userId);
 
          setNotifications((prev) => {
-            const updated = prev.map((n) => ({ ...n, is_read: true }));
+            const updated = prev.map(() => undefined);
             setUnreadCount(countUnread(updated)); 
             return updated;

[NoCoverage] BooleanLiteral
features/notifications/hooks/useNotifications.ts:57:63
          await markAllUserNotificationsAsRead(userId);
 
          setNotifications((prev) => {
-            const updated = prev.map((n) => ({ ...n, is_read: true }));
+            const updated = prev.map((n) => ({ ...n, is_read: false }));
             setUnreadCount(countUnread(updated)); 
             return updated;

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:61:23
             setUnreadCount(countUnread(updated)); 
             return updated;
          });
-      } catch (error) {
-         console.error("Erro ao marcar todas como lidas:", error);
-      }
+      } catch (error) {}
    };
 

[NoCoverage] StringLiteral
features/notifications/hooks/useNotifications.ts:62:24
             return updated;
          });
       } catch (error) {
-         console.error("Erro ao marcar todas como lidas:", error);
+         console.error("", error);
       }
    };

[NoCoverage] BlockStatement
features/notifications/hooks/useNotifications.ts:66:20
       }
    };
 
-   useEffect(() => {
-      fetchNotifications();
-
-      if (!userId) return;
-
-      return subscribeNotifications(userId, fetchNotifications);
-   }, [userId, fetchNotifications]);
+   useEffect(() => {}, [userId, fetchNotifications]);
 
    return {

[NoCoverage] ConditionalExpression
features/notifications/hooks/useNotifications.ts:69:11
    useEffect(() => {
       fetchNotifications();
 
-      if (!userId) return;
+      if (false) return;
 
       return subscribeNotifications(userId, fetchNotifications);

[NoCoverage] BooleanLiteral
features/notifications/hooks/useNotifications.ts:69:11
    useEffect(() => {
       fetchNotifications();
 
-      if (!userId) return;
+      if (userId) return;
 
       return subscribeNotifications(userId, fetchNotifications);

[NoCoverage] ArrayDeclaration
features/notifications/hooks/useNotifications.ts:72:7
       if (!userId) return;
 
       return subscribeNotifications(userId, fetchNotifications);
-   }, [userId, fetchNotifications]);
+   }, []);
 
    return {
