[NoCoverage] StringLiteral
features/profile/hooks/useProfileManager.ts:16:45
 type OnProfileChanged = (newUsername: string) => void | Promise<void>;
 
 export function useProfileManager(session: Session | null, onProfileChanged?: OnProfileChanged) {
-   const [username, setUsername] = useState("");
+   const [username, setUsername] = useState("Stryker was here!");
    const [currentUsernameState, setCurrentUsernameState] = useState("");
    const [avatarUrl, setAvatarUrl] = useState<string | null>(null);

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:19:43
    const [username, setUsername] = useState("");
    const [currentUsernameState, setCurrentUsernameState] = useState("");
    const [avatarUrl, setAvatarUrl] = useState<string | null>(null);
-   const [loading, setLoading] = useState(false);
+   const [loading, setLoading] = useState(true);
 
    // Estados do Cropper

[NoCoverage] ObjectLiteral
features/profile/hooks/useProfileManager.ts:23:37
 
    // Estados do Cropper
    const [imageSrc, setImageSrc] = useState<string | null>(null);
-   const [crop, setCrop] = useState({ x: 0, y: 0 });
+   const [crop, setCrop] = useState({});
    const [zoom, setZoom] = useState(1);
    const [croppedAreaPixels, setCroppedAreaPixels] = useState<Area | null>(null);

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:26:47
    const [crop, setCrop] = useState({ x: 0, y: 0 });
    const [zoom, setZoom] = useState(1);
    const [croppedAreaPixels, setCroppedAreaPixels] = useState<Area | null>(null);
-   const [uploading, setUploading] = useState(false);
+   const [uploading, setUploading] = useState(true);
 
    useEffect(() => {

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:28:20
    const [croppedAreaPixels, setCroppedAreaPixels] = useState<Area | null>(null);
    const [uploading, setUploading] = useState(false);
 
-   useEffect(() => {
-      const fetchProfileData = async () => {
-         if (!session?.user.id) return;
-         try {
-            const data = await fetchUserProfile(session.user.id);
-            setAvatarUrl(data.avatarUrl);
-            setUsername(data.username);
-            setCurrentUsernameState(data.username);
-         } catch (err) {
-            console.error("Erro ao carregar perfil:", err);
-         }
-      };
-      fetchProfileData();
-   }, [session]);
+   useEffect(() => {}, [session]);
 
    const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:29:44
    const [uploading, setUploading] = useState(false);
 
    useEffect(() => {
-      const fetchProfileData = async () => {
-         if (!session?.user.id) return;
-         try {
-            const data = await fetchUserProfile(session.user.id);
-            setAvatarUrl(data.avatarUrl);
-            setUsername(data.username);
-            setCurrentUsernameState(data.username);
-         } catch (err) {
-            console.error("Erro ao carregar perfil:", err);
-         }
-      };
+      const fetchProfileData = async () => {};
       fetchProfileData();
    }, [session]);

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:30:14
 
    useEffect(() => {
       const fetchProfileData = async () => {
-         if (!session?.user.id) return;
+         if (session?.user.id) return;
          try {
             const data = await fetchUserProfile(session.user.id);

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:30:14
 
    useEffect(() => {
       const fetchProfileData = async () => {
-         if (!session?.user.id) return;
+         if (false) return;
          try {
             const data = await fetchUserProfile(session.user.id);

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:31:14
    useEffect(() => {
       const fetchProfileData = async () => {
          if (!session?.user.id) return;
-         try {
-            const data = await fetchUserProfile(session.user.id);
-            setAvatarUrl(data.avatarUrl);
-            setUsername(data.username);
-            setCurrentUsernameState(data.username);
-         } catch (err) {
+         try {} catch (err) {
             console.error("Erro ao carregar perfil:", err);
          }

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:36:24
             setAvatarUrl(data.avatarUrl);
             setUsername(data.username);
             setCurrentUsernameState(data.username);
-         } catch (err) {
-            console.error("Erro ao carregar perfil:", err);
-         }
+         } catch (err) {}
       };
       fetchProfileData();

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:43:73
       fetchProfileData();
    }, [session]);
 
-   const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-      if (e.target.files && e.target.files.length > 0) {
-         setImageSrc(URL.createObjectURL(e.target.files[0]));
-      }
-   };
+   const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
    const onCropComplete = useCallback((_croppedArea: Area, croppedAreaPixels: Area) => {

[NoCoverage] EqualityOperator
features/profile/hooks/useProfileManager.ts:44:29
    }, [session]);
 
    const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-      if (e.target.files && e.target.files.length > 0) {
+      if (e.target.files && e.target.files.length <= 0) {
          setImageSrc(URL.createObjectURL(e.target.files[0]));
       }

[NoCoverage] LogicalOperator
features/profile/hooks/useProfileManager.ts:44:11
    }, [session]);
 
    const handleFileChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-      if (e.target.files && e.target.files.length > 0) {
+      if (e.target.files || e.target.files.length > 0) {
          setImageSrc(URL.createObjectURL(e.target.files[0]));
       }

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:49:88
       }
    };
 
-   const onCropComplete = useCallback((_croppedArea: Area, croppedAreaPixels: Area) => {
-      setCroppedAreaPixels(croppedAreaPixels);
-   }, []);
+   const onCropComplete = useCallback((_croppedArea: Area, croppedAreaPixels: Area) => {}, []);
 
    const handleUploadCroppedImage = async () => {

[NoCoverage] ArrayDeclaration
features/profile/hooks/useProfileManager.ts:51:7
 
    const onCropComplete = useCallback((_croppedArea: Area, croppedAreaPixels: Area) => {
       setCroppedAreaPixels(croppedAreaPixels);
-   }, []);
+   }, ["Stryker was here"]);
 
    const handleUploadCroppedImage = async () => {

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:53:49
       setCroppedAreaPixels(croppedAreaPixels);
    }, []);
 
-   const handleUploadCroppedImage = async () => {
-      if (!imageSrc || !croppedAreaPixels || !session?.user.id) return;
-
-      try {
-         setUploading(true);
-         const croppedImageBlob = await getCroppedImg(imageSrc, croppedAreaPixels);
-         if (!croppedImageBlob) throw new Error("Erro ao processar imagem.");
-
-         const publicUrl = await uploadUserAvatar(session.user.id, croppedImageBlob);
-
-         setAvatarUrl(publicUrl);
-         setImageSrc(null);
-         toast.success("Foto de perfil atualizada com sucesso!");
-      } catch (err) {
-         toast.error(err instanceof Error ? err.message : "Erro ao fazer upload da imagem.");
-      } finally {
-         setUploading(false);
-      }
-   };
+   const handleUploadCroppedImage = async () => {};
 
    const handleUsernameChange = (e: React.ChangeEvent<HTMLInputElement>) => {

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:54:11
    }, []);
 
    const handleUploadCroppedImage = async () => {
-      if (!imageSrc || !croppedAreaPixels || !session?.user.id) return;
+      if (imageSrc || !croppedAreaPixels || !session?.user.id) return;
 
       try {

[NoCoverage] LogicalOperator
features/profile/hooks/useProfileManager.ts:54:11
    }, []);
 
    const handleUploadCroppedImage = async () => {
-      if (!imageSrc || !croppedAreaPixels || !session?.user.id) return;
+      if ((!imageSrc || !croppedAreaPixels) && !session?.user.id) return;
 
       try {

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:56:11
    const handleUploadCroppedImage = async () => {
       if (!imageSrc || !croppedAreaPixels || !session?.user.id) return;
 
-      try {
-         setUploading(true);
-         const croppedImageBlob = await getCroppedImg(imageSrc, croppedAreaPixels);
-         if (!croppedImageBlob) throw new Error("Erro ao processar imagem.");
-
-         const publicUrl = await uploadUserAvatar(session.user.id, croppedImageBlob);
-
-         setAvatarUrl(publicUrl);
-         setImageSrc(null);
-         toast.success("Foto de perfil atualizada com sucesso!");
-      } catch (err) {
+      try {} catch (err) {
          toast.error(err instanceof Error ? err.message : "Erro ao fazer upload da imagem.");
       } finally {

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:57:23
       if (!imageSrc || !croppedAreaPixels || !session?.user.id) return;
 
       try {
-         setUploading(true);
+         setUploading(false);
          const croppedImageBlob = await getCroppedImg(imageSrc, croppedAreaPixels);
          if (!croppedImageBlob) throw new Error("Erro ao processar imagem.");

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:59:14
       try {
          setUploading(true);
          const croppedImageBlob = await getCroppedImg(imageSrc, croppedAreaPixels);
-         if (!croppedImageBlob) throw new Error("Erro ao processar imagem.");
+         if (false) throw new Error("Erro ao processar imagem.");
 
          const publicUrl = await uploadUserAvatar(session.user.id, croppedImageBlob);

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:59:14
       try {
          setUploading(true);
          const croppedImageBlob = await getCroppedImg(imageSrc, croppedAreaPixels);
-         if (!croppedImageBlob) throw new Error("Erro ao processar imagem.");
+         if (true) throw new Error("Erro ao processar imagem.");
 
          const publicUrl = await uploadUserAvatar(session.user.id, croppedImageBlob);

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:66:21
          setAvatarUrl(publicUrl);
          setImageSrc(null);
          toast.success("Foto de perfil atualizada com sucesso!");
-      } catch (err) {
-         toast.error(err instanceof Error ? err.message : "Erro ao fazer upload da imagem.");
-      } finally {
+      } catch (err) {} finally {
          setUploading(false);
       }

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:68:17
          toast.success("Foto de perfil atualizada com sucesso!");
       } catch (err) {
          toast.error(err instanceof Error ? err.message : "Erro ao fazer upload da imagem.");
-      } finally {
-         setUploading(false);
-      }
+      } finally {}
    };
 

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:69:23
       } catch (err) {
          toast.error(err instanceof Error ? err.message : "Erro ao fazer upload da imagem.");
       } finally {
-         setUploading(false);
+         setUploading(true);
       }
    };

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:73:77
       }
    };
 
-   const handleUsernameChange = (e: React.ChangeEvent<HTMLInputElement>) => {
-      setUsername(sanitizeUsername(e.target.value));
-   };
+   const handleUsernameChange = (e: React.ChangeEvent<HTMLInputElement>) => {};
 
    const handleSaveUsername = async (e: React.FormEvent) => {

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:79:11
 
    const handleSaveUsername = async (e: React.FormEvent) => {
       e.preventDefault();
-      if (!session?.user.id) return;
+      if (false) return;
 
       const usernameValidation = validateUsername(username);

[NoCoverage] BooleanLiteral
features/profile/hooks/useProfileManager.ts:79:11
 
    const handleSaveUsername = async (e: React.FormEvent) => {
       e.preventDefault();
-      if (!session?.user.id) return;
+      if (session?.user.id) return;
 
       const usernameValidation = validateUsername(username);

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:82:38
       if (!session?.user.id) return;
 
       const usernameValidation = validateUsername(username);
-      if (!usernameValidation.valid) {
-         return toast.error(usernameValidation.error || "Nome de usuário inválido.");
-      }
+      if (!usernameValidation.valid) {}
 
       setLoading(true);

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:82:11
       if (!session?.user.id) return;
 
       const usernameValidation = validateUsername(username);
-      if (!usernameValidation.valid) {
+      if (false) {
          return toast.error(usernameValidation.error || "Nome de usuário inválido.");
       }

[NoCoverage] LogicalOperator
features/profile/hooks/useProfileManager.ts:83:29
 
       const usernameValidation = validateUsername(username);
       if (!usernameValidation.valid) {
-         return toast.error(usernameValidation.error || "Nome de usuário inválido.");
+         return toast.error(usernameValidation.error && "Nome de usuário inválido.");
       }
 

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:83:29
 
       const usernameValidation = validateUsername(username);
       if (!usernameValidation.valid) {
-         return toast.error(usernameValidation.error || "Nome de usuário inválido.");
+         return toast.error(true);
       }
 

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:87:11
       }
 
       setLoading(true);
-      try {
-         await updateUserProfileName(session.user.id, username);
-         toast.success("Perfil atualizado com sucesso!");
-         setCurrentUsernameState(username);
-         if (onProfileChanged) {
-            await onProfileChanged(username);
-         }
-      } catch (err) {
+      try {} catch (err) {
          if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {
             toast.error("Este nome de usuário já está em uso.");

[NoCoverage] ConditionalExpression
features/profile/hooks/useProfileManager.ts:91:14
          await updateUserProfileName(session.user.id, username);
          toast.success("Perfil atualizado com sucesso!");
          setCurrentUsernameState(username);
-         if (onProfileChanged) {
+         if (false) {
             await onProfileChanged(username);
          }

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:91:32
          await updateUserProfileName(session.user.id, username);
          toast.success("Perfil atualizado com sucesso!");
          setCurrentUsernameState(username);
-         if (onProfileChanged) {
-            await onProfileChanged(username);
-         }
+         if (onProfileChanged) {}
       } catch (err) {
          if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:94:21
          if (onProfileChanged) {
             await onProfileChanged(username);
          }
-      } catch (err) {
-         if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {
-            toast.error("Este nome de usuário já está em uso.");
-         } else {
-            toast.error(err instanceof Error ? err.message : "Erro ao salvar perfil.");
-         }
-      } finally {
+      } catch (err) {} finally {
          setLoading(false);
       }

[NoCoverage] LogicalOperator
features/profile/hooks/useProfileManager.ts:95:14
             await onProfileChanged(username);
          }
       } catch (err) {
-         if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {
+         if (typeof err === "object" && err && "code" in err || (err as {
+  code?: string;
+}).code === "23505") {
             toast.error("Este nome de usuário já está em uso.");
          } else {

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:95:110
             await onProfileChanged(username);
          }
       } catch (err) {
-         if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {
-            toast.error("Este nome de usuário já está em uso.");
-         } else {
+         if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {} else {
             toast.error(err instanceof Error ? err.message : "Erro ao salvar perfil.");
          }

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:97:17
       } catch (err) {
          if (typeof err === "object" && err && "code" in err && (err as { code?: string }).code === "23505") {
             toast.error("Este nome de usuário já está em uso.");
-         } else {
-            toast.error(err instanceof Error ? err.message : "Erro ao salvar perfil.");
-         }
+         } else {}
       } finally {
          setLoading(false);

[NoCoverage] BlockStatement
features/profile/hooks/useProfileManager.ts:100:17
          } else {
             toast.error(err instanceof Error ? err.message : "Erro ao salvar perfil.");
          }
-      } finally {
-         setLoading(false);
-      }
+      } finally {}
    };
 
