[NoCoverage] ArrayDeclaration
features/publicProfile/hooks/usePublicProfile.ts:7:54
 import type { MovieData } from "@/types";
 
 export function usePublicProfile(username: string | undefined) {
-   const [movies, setMovies] = useState<MovieData[]>([]);
+   const [movies, setMovies] = useState<MovieData[]>(["Stryker was here"]);
    const [loading, setLoading] = useState(true);
    const [error, setError] = useState<string | null>(null); 

[NoCoverage] BooleanLiteral
features/publicProfile/hooks/usePublicProfile.ts:16:11
    const [profileId, setProfileId] = useState<string | null>(null);
 
    const fetchPublicMovies = useCallback(async () => {
-      if (!username) return;
+      if (username) return;
       setLoading(true);
       setError(null); 

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:16:11
    const [profileId, setProfileId] = useState<string | null>(null);
 
    const fetchPublicMovies = useCallback(async () => {
-      if (!username) return;
+      if (true) return;
       setLoading(true);
       setError(null); 

[NoCoverage] BooleanLiteral
features/publicProfile/hooks/usePublicProfile.ts:17:18
 
    const fetchPublicMovies = useCallback(async () => {
       if (!username) return;
-      setLoading(true);
+      setLoading(false);
       setError(null); 
 

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:28:14
             .eq("username", username)
             .single();
 
-         if (profileError || !profileData) {
+         if (true) {
             throw new Error("Usuário não encontrado.");
          }

[NoCoverage] BlockStatement
features/publicProfile/hooks/usePublicProfile.ts:28:44
             .eq("username", username)
             .single();
 
-         if (profileError || !profileData) {
-            throw new Error("Usuário não encontrado.");
-         }
+         if (profileError || !profileData) {}
 
          setProfileName(profileData.username);

[NoCoverage] BooleanLiteral
features/publicProfile/hooks/usePublicProfile.ts:41:47
             .from("reviews")
             .select("*")
             .eq("user_id", profileData.id)
-            .order("created_at", { ascending: false });
+            .order("created_at", { ascending: true });
 
          if (reviewsError) throw reviewsError;

[NoCoverage] ObjectLiteral
features/publicProfile/hooks/usePublicProfile.ts:41:34
             .from("reviews")
             .select("*")
             .eq("user_id", profileData.id)
-            .order("created_at", { ascending: false });
+            .order("created_at", {});
 
          if (reviewsError) throw reviewsError;

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:43:14
             .eq("user_id", profileData.id)
             .order("created_at", { ascending: false });
 
-         if (reviewsError) throw reviewsError;
+         if (true) throw reviewsError;
          if (!reviewsData) return;
 

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:43:14
             .eq("user_id", profileData.id)
             .order("created_at", { ascending: false });
 
-         if (reviewsError) throw reviewsError;
+         if (false) throw reviewsError;
          if (!reviewsData) return;
 

[NoCoverage] BooleanLiteral
features/publicProfile/hooks/usePublicProfile.ts:44:14
             .order("created_at", { ascending: false });
 
          if (reviewsError) throw reviewsError;
-         if (!reviewsData) return;
+         if (reviewsData) return;
 
          // Enriquecemos os dados com os posteres do TMDB

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:44:14
             .order("created_at", { ascending: false });
 
          if (reviewsError) throw reviewsError;
-         if (!reviewsData) return;
+         if (false) return;
 
          // Enriquecemos os dados com os posteres do TMDB

[NoCoverage] ArrowFunction
features/publicProfile/hooks/usePublicProfile.ts:48:29
 
          // Enriquecemos os dados com os posteres do TMDB
          const fullMovies = await Promise.all(
-            reviewsData.map((movie) => enrichMovieWithTmdb(movie)),
+            reviewsData.map(() => undefined),
          );
 

[NoCoverage] BlockStatement
features/publicProfile/hooks/usePublicProfile.ts:52:21
          );
 
          setMovies(fullMovies);
-      } catch (err) {
-         if (err instanceof Error) {
-            setError(err.message || "Erro ao carregar o perfil.");
-         } else {
-            setError("Ocorreu um erro desconhecido.");
-         }
-      } finally {
+      } catch (err) {} finally {
          setLoading(false);
       }

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:53:14
 
          setMovies(fullMovies);
       } catch (err) {
-         if (err instanceof Error) {
+         if (false) {
             setError(err.message || "Erro ao carregar o perfil.");
          } else {

[NoCoverage] BlockStatement
features/publicProfile/hooks/usePublicProfile.ts:53:36
 
          setMovies(fullMovies);
       } catch (err) {
-         if (err instanceof Error) {
-            setError(err.message || "Erro ao carregar o perfil.");
-         } else {
+         if (err instanceof Error) {} else {
             setError("Ocorreu um erro desconhecido.");
          }

[NoCoverage] ConditionalExpression
features/publicProfile/hooks/usePublicProfile.ts:54:22
          setMovies(fullMovies);
       } catch (err) {
          if (err instanceof Error) {
-            setError(err.message || "Erro ao carregar o perfil.");
+            setError(false);
          } else {
             setError("Ocorreu um erro desconhecido.");

[NoCoverage] LogicalOperator
features/publicProfile/hooks/usePublicProfile.ts:54:22
          setMovies(fullMovies);
       } catch (err) {
          if (err instanceof Error) {
-            setError(err.message || "Erro ao carregar o perfil.");
+            setError(err.message && "Erro ao carregar o perfil.");
          } else {
             setError("Ocorreu um erro desconhecido.");

[NoCoverage] BlockStatement
features/publicProfile/hooks/usePublicProfile.ts:55:17
       } catch (err) {
          if (err instanceof Error) {
             setError(err.message || "Erro ao carregar o perfil.");
-         } else {
-            setError("Ocorreu um erro desconhecido.");
-         }
+         } else {}
       } finally {
          setLoading(false);

[NoCoverage] StringLiteral
features/publicProfile/hooks/usePublicProfile.ts:56:22
          if (err instanceof Error) {
             setError(err.message || "Erro ao carregar o perfil.");
          } else {
-            setError("Ocorreu um erro desconhecido.");
+            setError("");
          }
       } finally {

[NoCoverage] BlockStatement
features/publicProfile/hooks/usePublicProfile.ts:63:20
       }
    }, [username]);
 
-   useEffect(() => {
-      fetchPublicMovies();
-   }, [fetchPublicMovies]);
+   useEffect(() => {}, [fetchPublicMovies]);
 
    return { movies, loading, error, profileName, profileAvatar, profileId };

[NoCoverage] ArrayDeclaration
features/publicProfile/hooks/usePublicProfile.ts:65:7
 
    useEffect(() => {
       fetchPublicMovies();
-   }, [fetchPublicMovies]);
+   }, []);
 
    return { movies, loading, error, profileName, profileAvatar, profileId };
