[NoCoverage] UnaryOperator
features/recommendations/hooks/useRecommendations.ts:39:43
       dislikedMovieIds: [...feedback.dislikedMovieIds],
    };
 
-   const delta = reaction === "dislike" ? -2 : 2;
+   const delta = reaction === "dislike" ? +2 : 2;
 
    for (const genreName of movie.genres || []) {

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:39:18
       dislikedMovieIds: [...feedback.dislikedMovieIds],
    };
 
-   const delta = reaction === "dislike" ? -2 : 2;
+   const delta = false ? -2 : 2;
 
    for (const genreName of movie.genres || []) {

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:41:48
 
    const delta = reaction === "dislike" ? -2 : 2;
 
-   for (const genreName of movie.genres || []) {
-      const genreId = getGenreIdFromLabel(genreName);
-      if (!genreId) {
-         continue;
-      }
-
-      next.genreAdjustments[genreId] = (next.genreAdjustments[genreId] || 0) + delta;
-   }
+   for (const genreName of movie.genres || []) {}
 
    if (reaction === "dislike") {

[NoCoverage] LogicalOperator
features/recommendations/hooks/useRecommendations.ts:41:28
 
    const delta = reaction === "dislike" ? -2 : 2;
 
-   for (const genreName of movie.genres || []) {
+   for (const genreName of movie.genres && []) {
       const genreId = getGenreIdFromLabel(genreName);
       if (!genreId) {

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:43:11
 
    for (const genreName of movie.genres || []) {
       const genreId = getGenreIdFromLabel(genreName);
-      if (!genreId) {
+      if (false) {
          continue;
       }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:43:21
 
    for (const genreName of movie.genres || []) {
       const genreId = getGenreIdFromLabel(genreName);
-      if (!genreId) {
-         continue;
-      }
+      if (!genreId) {}
 
       next.genreAdjustments[genreId] = (next.genreAdjustments[genreId] || 0) + delta;

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:47:41
          continue;
       }
 
-      next.genreAdjustments[genreId] = (next.genreAdjustments[genreId] || 0) + delta;
+      next.genreAdjustments[genreId] = (true) + delta;
    }
 

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:47:41
          continue;
       }
 
-      next.genreAdjustments[genreId] = (next.genreAdjustments[genreId] || 0) + delta;
+      next.genreAdjustments[genreId] = (false) + delta;
    }
 

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:50:32
       next.genreAdjustments[genreId] = (next.genreAdjustments[genreId] || 0) + delta;
    }
 
-   if (reaction === "dislike") {
-      if (!next.dislikedMovieIds.includes(movie.tmdb_id)) {
-         next.dislikedMovieIds.push(movie.tmdb_id);
-      }
-   } else {
+   if (reaction === "dislike") {} else {
       next.dislikedMovieIds = next.dislikedMovieIds.filter((id) => id !== movie.tmdb_id);
    }

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:50:8
       next.genreAdjustments[genreId] = (next.genreAdjustments[genreId] || 0) + delta;
    }
 
-   if (reaction === "dislike") {
+   if (true) {
       if (!next.dislikedMovieIds.includes(movie.tmdb_id)) {
          next.dislikedMovieIds.push(movie.tmdb_id);

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:51:11
    }
 
    if (reaction === "dislike") {
-      if (!next.dislikedMovieIds.includes(movie.tmdb_id)) {
+      if (true) {
          next.dislikedMovieIds.push(movie.tmdb_id);
       }

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:51:11
    }
 
    if (reaction === "dislike") {
-      if (!next.dislikedMovieIds.includes(movie.tmdb_id)) {
+      if (next.dislikedMovieIds.includes(movie.tmdb_id)) {
          next.dislikedMovieIds.push(movie.tmdb_id);
       }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:54:11
       if (!next.dislikedMovieIds.includes(movie.tmdb_id)) {
          next.dislikedMovieIds.push(movie.tmdb_id);
       }
-   } else {
-      next.dislikedMovieIds = next.dislikedMovieIds.filter((id) => id !== movie.tmdb_id);
-   }
+   } else {}
 
    return next;

[NoCoverage] EqualityOperator
features/recommendations/hooks/useRecommendations.ts:55:68
          next.dislikedMovieIds.push(movie.tmdb_id);
       }
    } else {
-      next.dislikedMovieIds = next.dislikedMovieIds.filter((id) => id !== movie.tmdb_id);
+      next.dislikedMovieIds = next.dislikedMovieIds.filter((id) => id === movie.tmdb_id);
    }
 

[NoCoverage] ArrowFunction
features/recommendations/hooks/useRecommendations.ts:55:60
          next.dislikedMovieIds.push(movie.tmdb_id);
       }
    } else {
-      next.dislikedMovieIds = next.dislikedMovieIds.filter((id) => id !== movie.tmdb_id);
+      next.dislikedMovieIds = next.dislikedMovieIds.filter(() => undefined);
    }
 

[NoCoverage] ArrayDeclaration
features/recommendations/hooks/useRecommendations.ts:62:81
 }
 
 export function useRecommendations(userId: string | null | undefined, movies: MovieData[]): UseRecommendationsResult {
-   const [recommendations, setRecommendations] = useState<RecommendationItem[]>([]);
+   const [recommendations, setRecommendations] = useState<RecommendationItem[]>(["Stryker was here"]);
    const [loading, setLoading] = useState(false);
    const [error, setError] = useState<string | null>(null);

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:63:43
 
 export function useRecommendations(userId: string | null | undefined, movies: MovieData[]): UseRecommendationsResult {
    const [recommendations, setRecommendations] = useState<RecommendationItem[]>([]);
-   const [loading, setLoading] = useState(false);
+   const [loading, setLoading] = useState(true);
    const [error, setError] = useState<string | null>(null);
    const [feedbackVersion, setFeedbackVersion] = useState(0);

[NoCoverage] ArrayDeclaration
features/recommendations/hooks/useRecommendations.ts:68:25
    const [feedbackVersion, setFeedbackVersion] = useState(0);
    const [feedbackProfile, setFeedbackProfile] = useState<RecommendationFeedbackProfile>({
       genreAdjustments: {},
-      dislikedMovieIds: [],
+      dislikedMovieIds: ["Stryker was here"],
    });
 

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:71:20
       dislikedMovieIds: [],
    });
 
-   useEffect(() => {
-      let cancelled = false;
-
-      const load = async () => {
-         if (!userId) {
-            if (!cancelled) {
-               setFeedbackProfile({ genreAdjustments: {}, dislikedMovieIds: [] });
-            }
-            return;
-         }
-
-         const feedback = await fetchRecommendationFeedback(userId);
-         if (!cancelled) {
-            setFeedbackProfile(feedback);
-         }
-      };
-
-      load();
-
-      return () => {
-         cancelled = true;
-      };
-   }, [feedbackVersion, userId]);
+   useEffect(() => {}, [feedbackVersion, userId]);
 
    const favoriteGenres = useMemo(() => getFavoriteGenreLabels(movies, feedbackProfile), [feedbackProfile, movies]);

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:72:23
    });
 
    useEffect(() => {
-      let cancelled = false;
+      let cancelled = true;
 
       const load = async () => {

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:74:32
    useEffect(() => {
       let cancelled = false;
 
-      const load = async () => {
-         if (!userId) {
-            if (!cancelled) {
-               setFeedbackProfile({ genreAdjustments: {}, dislikedMovieIds: [] });
-            }
-            return;
-         }
-
-         const feedback = await fetchRecommendationFeedback(userId);
-         if (!cancelled) {
-            setFeedbackProfile(feedback);
-         }
-      };
+      const load = async () => {};
 
       load();

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:75:14
       let cancelled = false;
 
       const load = async () => {
-         if (!userId) {
+         if (userId) {
             if (!cancelled) {
                setFeedbackProfile({ genreAdjustments: {}, dislikedMovieIds: [] });

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:75:14
       let cancelled = false;
 
       const load = async () => {
-         if (!userId) {
+         if (true) {
             if (!cancelled) {
                setFeedbackProfile({ genreAdjustments: {}, dislikedMovieIds: [] });

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:76:17
 
       const load = async () => {
          if (!userId) {
-            if (!cancelled) {
+            if (true) {
                setFeedbackProfile({ genreAdjustments: {}, dislikedMovieIds: [] });
             }

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:76:17
 
       const load = async () => {
          if (!userId) {
-            if (!cancelled) {
+            if (cancelled) {
                setFeedbackProfile({ genreAdjustments: {}, dislikedMovieIds: [] });
             }

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:83:14
          }
 
          const feedback = await fetchRecommendationFeedback(userId);
-         if (!cancelled) {
+         if (true) {
             setFeedbackProfile(feedback);
          }

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:83:14
          }
 
          const feedback = await fetchRecommendationFeedback(userId);
-         if (!cancelled) {
+         if (cancelled) {
             setFeedbackProfile(feedback);
          }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:90:20
 
       load();
 
-      return () => {
-         cancelled = true;
-      };
+      return () => {};
    }, [feedbackVersion, userId]);
 

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:91:22
       load();
 
       return () => {
-         cancelled = true;
+         cancelled = false;
       };
    }, [feedbackVersion, userId]);

[NoCoverage] ArrowFunction
features/recommendations/hooks/useRecommendations.ts:95:35
       };
    }, [feedbackVersion, userId]);
 
-   const favoriteGenres = useMemo(() => getFavoriteGenreLabels(movies, feedbackProfile), [feedbackProfile, movies]);
+   const favoriteGenres = useMemo(() => undefined, [feedbackProfile, movies]);
 
    useEffect(() => {

[NoCoverage] ArrayDeclaration
features/recommendations/hooks/useRecommendations.ts:95:90
       };
    }, [feedbackVersion, userId]);
 
-   const favoriteGenres = useMemo(() => getFavoriteGenreLabels(movies, feedbackProfile), [feedbackProfile, movies]);
+   const favoriteGenres = useMemo(() => getFavoriteGenreLabels(movies, feedbackProfile), []);
 
    useEffect(() => {

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:101:14
       let cancelled = false;
 
       const run = async () => {
-         if (!userId) {
+         if (userId) {
             setRecommendations([]);
             setError(null);

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:101:14
       let cancelled = false;
 
       const run = async () => {
-         if (!userId) {
+         if (false) {
             setRecommendations([]);
             setError(null);

[NoCoverage] ArrayDeclaration
features/recommendations/hooks/useRecommendations.ts:102:32
 
       const run = async () => {
          if (!userId) {
-            setRecommendations([]);
+            setRecommendations(["Stryker was here"]);
             setError(null);
             setLoading(false);

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:104:24
          if (!userId) {
             setRecommendations([]);
             setError(null);
-            setLoading(false);
+            setLoading(true);
             return;
          }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:111:14
          setLoading(true);
          setError(null);
 
-         try {
-            const result = await getPersonalizedRecommendations(movies, 12, feedbackProfile);
-            if (!cancelled) {
-               setRecommendations(result);
-            }
-         } catch (err) {
+         try {} catch (err) {
             console.error("Erro ao gerar recomendações personalizadas:", err);
             if (!cancelled) {

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:113:17
 
          try {
             const result = await getPersonalizedRecommendations(movies, 12, feedbackProfile);
-            if (!cancelled) {
+            if (false) {
                setRecommendations(result);
             }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:113:29
 
          try {
             const result = await getPersonalizedRecommendations(movies, 12, feedbackProfile);
-            if (!cancelled) {
-               setRecommendations(result);
-            }
+            if (!cancelled) {}
          } catch (err) {
             console.error("Erro ao gerar recomendações personalizadas:", err);

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:116:24
             if (!cancelled) {
                setRecommendations(result);
             }
-         } catch (err) {
-            console.error("Erro ao gerar recomendações personalizadas:", err);
-            if (!cancelled) {
-               setRecommendations([]);
-               setError("Não foi possível carregar suas recomendações agora.");
-            }
-         } finally {
+         } catch (err) {} finally {
             if (!cancelled) {
                setLoading(false);

[NoCoverage] StringLiteral
features/recommendations/hooks/useRecommendations.ts:117:27
                setRecommendations(result);
             }
          } catch (err) {
-            console.error("Erro ao gerar recomendações personalizadas:", err);
+            console.error("", err);
             if (!cancelled) {
                setRecommendations([]);

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:118:17
             }
          } catch (err) {
             console.error("Erro ao gerar recomendações personalizadas:", err);
-            if (!cancelled) {
+            if (false) {
                setRecommendations([]);
                setError("Não foi possível carregar suas recomendações agora.");

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:118:29
             }
          } catch (err) {
             console.error("Erro ao gerar recomendações personalizadas:", err);
-            if (!cancelled) {
-               setRecommendations([]);
-               setError("Não foi possível carregar suas recomendações agora.");
-            }
+            if (!cancelled) {}
          } finally {
             if (!cancelled) {

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:122:20
                setRecommendations([]);
                setError("Não foi possível carregar suas recomendações agora.");
             }
-         } finally {
-            if (!cancelled) {
-               setLoading(false);
-            }
-         }
+         } finally {}
       };
 

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:123:17
                setError("Não foi possível carregar suas recomendações agora.");
             }
          } finally {
-            if (!cancelled) {
+            if (cancelled) {
                setLoading(false);
             }

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:123:17
                setError("Não foi possível carregar suas recomendações agora.");
             }
          } finally {
-            if (!cancelled) {
+            if (false) {
                setLoading(false);
             }

[NoCoverage] BooleanLiteral
features/recommendations/hooks/useRecommendations.ts:124:27
             }
          } finally {
             if (!cancelled) {
-               setLoading(false);
+               setLoading(true);
             }
          }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:137:20
    }, [feedbackProfile, movies, userId]);
 
    const registerReaction = async (movie: MovieData, reaction: RecommendationReaction) => {
-      if (!userId) {
-         return;
-      }
+      if (!userId) {}
 
       const current: StoredFeedback = {

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:137:11
    }, [feedbackProfile, movies, userId]);
 
    const registerReaction = async (movie: MovieData, reaction: RecommendationReaction) => {
-      if (!userId) {
+      if (true) {
          return;
       }

[NoCoverage] ObjectLiteral
features/recommendations/hooks/useRecommendations.ts:141:39
          return;
       }
 
-      const current: StoredFeedback = {
-         genreAdjustments: feedbackProfile.genreAdjustments,
-         dislikedMovieIds: feedbackProfile.dislikedMovieIds,
-      };
+      const current: StoredFeedback = {};
 
       const next = updateFeedbackByMovie(movie, current, reaction);

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:152:11
          dislikedMovieIds: next.dislikedMovieIds,
       });
 
-      try {
-         await upsertRecommendationFeedback(userId, {
-            genreAdjustments: next.genreAdjustments,
-            dislikedMovieIds: next.dislikedMovieIds,
-         });
-         setFeedbackVersion((prev) => prev + 1);
-      } catch (error) {
+      try {} catch (error) {
          console.error("Erro ao persistir feedback de recomendação:", error);
          setFeedbackVersion((prev) => prev + 1);

[NoCoverage] ObjectLiteral
features/recommendations/hooks/useRecommendations.ts:153:53
       });
 
       try {
-         await upsertRecommendationFeedback(userId, {
-            genreAdjustments: next.genreAdjustments,
-            dislikedMovieIds: next.dislikedMovieIds,
-         });
+         await upsertRecommendationFeedback(userId, {});
          setFeedbackVersion((prev) => prev + 1);
       } catch (error) {

[NoCoverage] ArithmeticOperator
features/recommendations/hooks/useRecommendations.ts:157:39
             genreAdjustments: next.genreAdjustments,
             dislikedMovieIds: next.dislikedMovieIds,
          });
-         setFeedbackVersion((prev) => prev + 1);
+         setFeedbackVersion((prev) => prev - 1);
       } catch (error) {
          console.error("Erro ao persistir feedback de recomendação:", error);

[NoCoverage] ArrowFunction
features/recommendations/hooks/useRecommendations.ts:157:29
             genreAdjustments: next.genreAdjustments,
             dislikedMovieIds: next.dislikedMovieIds,
          });
-         setFeedbackVersion((prev) => prev + 1);
+         setFeedbackVersion(() => undefined);
       } catch (error) {
          console.error("Erro ao persistir feedback de recomendação:", error);

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:158:23
             dislikedMovieIds: next.dislikedMovieIds,
          });
          setFeedbackVersion((prev) => prev + 1);
-      } catch (error) {
-         console.error("Erro ao persistir feedback de recomendação:", error);
-         setFeedbackVersion((prev) => prev + 1);
-         throw error;
-      }
+      } catch (error) {}
    };
 

[NoCoverage] ArrowFunction
features/recommendations/hooks/useRecommendations.ts:160:29
          setFeedbackVersion((prev) => prev + 1);
       } catch (error) {
          console.error("Erro ao persistir feedback de recomendação:", error);
-         setFeedbackVersion((prev) => prev + 1);
+         setFeedbackVersion(() => undefined);
          throw error;
       }

[NoCoverage] ArithmeticOperator
features/recommendations/hooks/useRecommendations.ts:160:39
          setFeedbackVersion((prev) => prev + 1);
       } catch (error) {
          console.error("Erro ao persistir feedback de recomendação:", error);
-         setFeedbackVersion((prev) => prev + 1);
+         setFeedbackVersion((prev) => prev - 1);
          throw error;
       }

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:165:64
       }
    };
 
-   const dislikeMany = async (moviesToDislike: MovieData[]) => {
-      if (!userId || moviesToDislike.length === 0) {
-         return;
-      }
-
-      let next: StoredFeedback = {
-         genreAdjustments: { ...feedbackProfile.genreAdjustments },
-         dislikedMovieIds: [...feedbackProfile.dislikedMovieIds],
-      };
-
-      for (const movie of moviesToDislike) {
-         next = updateFeedbackByMovie(movie, next, "dislike");
-      }
-
-      setFeedbackProfile({
-         genreAdjustments: next.genreAdjustments,
-         dislikedMovieIds: next.dislikedMovieIds,
-      });
-
-      await upsertRecommendationFeedback(userId, {
-         genreAdjustments: next.genreAdjustments,
-         dislikedMovieIds: next.dislikedMovieIds,
-      });
-      setFeedbackVersion((prev) => prev + 1);
-   };
+   const dislikeMany = async (moviesToDislike: MovieData[]) => {};
 
    const resetFeedback = async () => {

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:166:11
    };
 
    const dislikeMany = async (moviesToDislike: MovieData[]) => {
-      if (!userId || moviesToDislike.length === 0) {
+      if (true) {
          return;
       }

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:166:11
    };
 
    const dislikeMany = async (moviesToDislike: MovieData[]) => {
-      if (!userId || moviesToDislike.length === 0) {
+      if (false) {
          return;
       }

[NoCoverage] ArrayDeclaration
features/recommendations/hooks/useRecommendations.ts:172:28
 
       let next: StoredFeedback = {
          genreAdjustments: { ...feedbackProfile.genreAdjustments },
-         dislikedMovieIds: [...feedbackProfile.dislikedMovieIds],
+         dislikedMovieIds: [],
       };
 

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:175:44
          dislikedMovieIds: [...feedbackProfile.dislikedMovieIds],
       };
 
-      for (const movie of moviesToDislike) {
-         next = updateFeedbackByMovie(movie, next, "dislike");
-      }
+      for (const movie of moviesToDislike) {}
 
       setFeedbackProfile({

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:191:38
       setFeedbackVersion((prev) => prev + 1);
    };
 
-   const resetFeedback = async () => {
-      if (!userId) {
-         return;
-      }
-
-      const cleared: RecommendationFeedbackProfile = {
-         genreAdjustments: {},
-         dislikedMovieIds: [],
-      };
-
-      setFeedbackProfile(cleared);
-      await upsertRecommendationFeedback(userId, cleared);
-      setFeedbackVersion((prev) => prev + 1);
-   };
+   const resetFeedback = async () => {};
 
    const refreshRecommendations = () => {

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:192:11
    };
 
    const resetFeedback = async () => {
-      if (!userId) {
+      if (true) {
          return;
       }

[NoCoverage] ConditionalExpression
features/recommendations/hooks/useRecommendations.ts:192:11
    };
 
    const resetFeedback = async () => {
-      if (!userId) {
+      if (false) {
          return;
       }

[NoCoverage] ArithmeticOperator
features/recommendations/hooks/useRecommendations.ts:203:36
 
       setFeedbackProfile(cleared);
       await upsertRecommendationFeedback(userId, cleared);
-      setFeedbackVersion((prev) => prev + 1);
+      setFeedbackVersion((prev) => prev - 1);
    };
 

[NoCoverage] ArrowFunction
features/recommendations/hooks/useRecommendations.ts:203:26
 
       setFeedbackProfile(cleared);
       await upsertRecommendationFeedback(userId, cleared);
-      setFeedbackVersion((prev) => prev + 1);
+      setFeedbackVersion(() => undefined);
    };
 

[NoCoverage] BlockStatement
features/recommendations/hooks/useRecommendations.ts:206:41
       setFeedbackVersion((prev) => prev + 1);
    };
 
-   const refreshRecommendations = () => {
-      setFeedbackVersion((prev) => prev + 1);
-   };
+   const refreshRecommendations = () => {};
 
    return {

[NoCoverage] ArrowFunction
features/recommendations/hooks/useRecommendations.ts:207:26
    };
 
    const refreshRecommendations = () => {
-      setFeedbackVersion((prev) => prev + 1);
+      setFeedbackVersion(() => undefined);
    };
 

[NoCoverage] ArithmeticOperator
features/recommendations/hooks/useRecommendations.ts:207:36
    };
 
    const refreshRecommendations = () => {
-      setFeedbackVersion((prev) => prev + 1);
+      setFeedbackVersion((prev) => prev - 1);
    };
 

[NoCoverage] ObjectLiteral
features/recommendations/hooks/useRecommendations.ts:210:11
       setFeedbackVersion((prev) => prev + 1);
    };
 
-   return {
-      recommendations,
-      favoriteGenres,
-      loading,
-      error,
-      registerReaction,
-      dislikeMany,
-      resetFeedback,
-      refreshRecommendations,
-   };
+   return {};
 }
 
