[Killed] ObjectLiteral
features/recommendations/services/recommendationFeedbackService.ts:10:55
    disliked_movie_ids: number[] | null;
 }
 
-const EMPTY_FEEDBACK: RecommendationFeedbackProfile = {
-   genreAdjustments: {},
-   dislikedMovieIds: [],
-};
+const EMPTY_FEEDBACK: RecommendationFeedbackProfile = {};
 
 function normalizeFeedbackRow(row: RecommendationFeedbackRow | null): RecommendationFeedbackProfile {
killedBy: recommendationFeedbackService returns empty feedback when row is not found
statusReason: expected {} to deeply equal { genreAdjustments: {}, …(1) }

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:15:101
    dislikedMovieIds: [],
 };
 
-function normalizeFeedbackRow(row: RecommendationFeedbackRow | null): RecommendationFeedbackProfile {
-   if (!row) {
-      return EMPTY_FEEDBACK;
-   }
-
-   const genreAdjustments: Record<number, number> = {};
-   const rawGenreAdjustments = row.genre_adjustments || {};
-
-   for (const [key, value] of Object.entries(rawGenreAdjustments)) {
-      const genreId = Number(key);
-      const numeric = typeof value === "number" ? value : Number(value);
-      if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {
-         genreAdjustments[genreId] = numeric;
-      }
-   }
-
-   return {
-      genreAdjustments,
-      dislikedMovieIds: (row.disliked_movie_ids || []).filter((id) => typeof id === "number"),
-   };
-}
+function normalizeFeedbackRow(row: RecommendationFeedbackRow | null): RecommendationFeedbackProfile {}
 
 export async function fetchRecommendationFeedback(userId: string): Promise<RecommendationFeedbackProfile> {
killedBy: recommendationFeedbackService returns empty feedback when row is not found
statusReason: expected undefined to deeply equal { genreAdjustments: {}, …(1) }

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:16:14
 };
 
 function normalizeFeedbackRow(row: RecommendationFeedbackRow | null): RecommendationFeedbackProfile {
-   if (!row) {
-      return EMPTY_FEEDBACK;
-   }
+   if (!row) {}
 
    const genreAdjustments: Record<number, number> = {};
killedBy: recommendationFeedbackService returns empty feedback when row is not found
statusReason: Cannot read properties of null (reading 'genre_adjustments')

[Killed] ConditionalExpression
features/recommendations/services/recommendationFeedbackService.ts:16:8
 };
 
 function normalizeFeedbackRow(row: RecommendationFeedbackRow | null): RecommendationFeedbackProfile {
-   if (!row) {
+   if (false) {
       return EMPTY_FEEDBACK;
    }
killedBy: recommendationFeedbackService returns empty feedback when row is not found
statusReason: Cannot read properties of null (reading 'genre_adjustments')

[Killed] ConditionalExpression
features/recommendations/services/recommendationFeedbackService.ts:21:32
    }
 
    const genreAdjustments: Record<number, number> = {};
-   const rawGenreAdjustments = row.genre_adjustments || {};
+   const rawGenreAdjustments = false;
 
    for (const [key, value] of Object.entries(rawGenreAdjustments)) {
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected {} to deeply equal { '28': 2, '35': -1 }

[Killed] LogicalOperator
features/recommendations/services/recommendationFeedbackService.ts:21:32
    }
 
    const genreAdjustments: Record<number, number> = {};
-   const rawGenreAdjustments = row.genre_adjustments || {};
+   const rawGenreAdjustments = row.genre_adjustments && {};
 
    for (const [key, value] of Object.entries(rawGenreAdjustments)) {
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected {} to deeply equal { '28': 2, '35': -1 }

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:23:68
    const genreAdjustments: Record<number, number> = {};
    const rawGenreAdjustments = row.genre_adjustments || {};
 
-   for (const [key, value] of Object.entries(rawGenreAdjustments)) {
-      const genreId = Number(key);
-      const numeric = typeof value === "number" ? value : Number(value);
-      if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {
-         genreAdjustments[genreId] = numeric;
-      }
-   }
+   for (const [key, value] of Object.entries(rawGenreAdjustments)) {}
 
    return {
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected {} to deeply equal { '28': 2, '35': -1 }

[Killed] ConditionalExpression
features/recommendations/services/recommendationFeedbackService.ts:25:23
 
    for (const [key, value] of Object.entries(rawGenreAdjustments)) {
       const genreId = Number(key);
-      const numeric = typeof value === "number" ? value : Number(value);
+      const numeric = true ? value : Number(value);
       if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {
          genreAdjustments[genreId] = numeric;
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected { '28': 2, '35': '-1' } to deeply equal { '28': 2, '35': -1 }

[Killed] EqualityOperator
features/recommendations/services/recommendationFeedbackService.ts:25:23
 
    for (const [key, value] of Object.entries(rawGenreAdjustments)) {
       const genreId = Number(key);
-      const numeric = typeof value === "number" ? value : Number(value);
+      const numeric = typeof value !== "number" ? value : Number(value);
       if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {
          genreAdjustments[genreId] = numeric;
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected { '28': 2, '35': '-1' } to deeply equal { '28': 2, '35': -1 }

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:26:61
    for (const [key, value] of Object.entries(rawGenreAdjustments)) {
       const genreId = Number(key);
       const numeric = typeof value === "number" ? value : Number(value);
-      if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {
-         genreAdjustments[genreId] = numeric;
-      }
+      if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {}
    }
 
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected {} to deeply equal { '28': 2, '35': -1 }

[Killed] ConditionalExpression
features/recommendations/services/recommendationFeedbackService.ts:26:11
    for (const [key, value] of Object.entries(rawGenreAdjustments)) {
       const genreId = Number(key);
       const numeric = typeof value === "number" ? value : Number(value);
-      if (!Number.isNaN(genreId) && !Number.isNaN(numeric)) {
+      if (false) {
          genreAdjustments[genreId] = numeric;
       }
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected {} to deeply equal { '28': 2, '35': -1 }

[Killed] ConditionalExpression
features/recommendations/services/recommendationFeedbackService.ts:33:26
 
    return {
       genreAdjustments,
-      dislikedMovieIds: (row.disliked_movie_ids || []).filter((id) => typeof id === "number"),
+      dislikedMovieIds: (false).filter((id) => typeof id === "number"),
    };
 }
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).filter is not a function

[Killed] ConditionalExpression
features/recommendations/services/recommendationFeedbackService.ts:33:71
 
    return {
       genreAdjustments,
-      dislikedMovieIds: (row.disliked_movie_ids || []).filter((id) => typeof id === "number"),
+      dislikedMovieIds: (row.disliked_movie_ids || []).filter((id) => false),
    };
 }
killedBy: recommendationFeedbackService normalizes valid row payload and ignores invalid values
statusReason: expected [] to deeply equal [ 10, 30 ]

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:37:107
    };
 }
 
-export async function fetchRecommendationFeedback(userId: string): Promise<RecommendationFeedbackProfile> {
-   const { data, error } = await supabase
-      .from("recommendation_feedback")
-      .select("user_id, genre_adjustments, disliked_movie_ids")
-      .eq("user_id", userId)
-      .maybeSingle();
-
-   if (error) {
-      console.error("Erro ao carregar feedback de recomendacoes:", error);
-      return EMPTY_FEEDBACK;
-   }
-
-   return normalizeFeedbackRow(data as RecommendationFeedbackRow | null);
-}
+export async function fetchRecommendationFeedback(userId: string): Promise<RecommendationFeedbackProfile> {}
 
 export async function upsertRecommendationFeedback(
killedBy: recommendationFeedbackService returns empty feedback when row is not found
statusReason: expected undefined to deeply equal { genreAdjustments: {}, …(1) }

[Survived] StringLiteral
features/recommendations/services/recommendationFeedbackService.ts:40:15
 export async function fetchRecommendationFeedback(userId: string): Promise<RecommendationFeedbackProfile> {
    const { data, error } = await supabase
       .from("recommendation_feedback")
-      .select("user_id, genre_adjustments, disliked_movie_ids")
+      .select("")
       .eq("user_id", userId)
       .maybeSingle();

[Survived] StringLiteral
features/recommendations/services/recommendationFeedbackService.ts:41:11
    const { data, error } = await supabase
       .from("recommendation_feedback")
       .select("user_id, genre_adjustments, disliked_movie_ids")
-      .eq("user_id", userId)
+      .eq("", userId)
       .maybeSingle();
 

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:44:15
       .eq("user_id", userId)
       .maybeSingle();
 
-   if (error) {
-      console.error("Erro ao carregar feedback de recomendacoes:", error);
-      return EMPTY_FEEDBACK;
-   }
+   if (error) {}
 
    return normalizeFeedbackRow(data as RecommendationFeedbackRow | null);
killedBy: recommendationFeedbackService returns empty feedback when query fails
statusReason: expected "error" to be called at least once

[Survived] StringLiteral
features/recommendations/services/recommendationFeedbackService.ts:45:21
       .maybeSingle();
 
    if (error) {
-      console.error("Erro ao carregar feedback de recomendacoes:", error);
+      console.error("", error);
       return EMPTY_FEEDBACK;
    }

[Killed] BlockStatement
features/recommendations/services/recommendationFeedbackService.ts:55:18
 export async function upsertRecommendationFeedback(
    userId: string,
    profile: RecommendationFeedbackProfile,
-): Promise<void> {
-   const payload = {
-      user_id: userId,
-      genre_adjustments: profile.genreAdjustments,
-      disliked_movie_ids: profile.dislikedMovieIds,
-   };
-
-   const { error } = await supabase
-      .from("recommendation_feedback")
-      .upsert(payload, { onConflict: "user_id" });
-
-   if (error) {
-      throw error;
-   }
-}
+): Promise<void> {}
 
killedBy: recommendationFeedbackService upserts profile payload with expected columns
statusReason: expected "vi.fn()" to be called with arguments: [ { user_id: 'u2', …(2) }, …(1) ]

Number of calls: 0
