[Survived] StringLiteral
features/recommendations/services/recommendationService.ts:78:8
    18: "Drama",
    27: "Terror",
    28: "Acao",
-   35: "Comedia",
+   35: "",
    36: "Historia",
    37: "Faroeste",

[Survived] StringLiteral
features/recommendations/services/recommendationService.ts:79:8
    27: "Terror",
    28: "Acao",
    35: "Comedia",
-   36: "Historia",
+   36: "",
    37: "Faroeste",
    53: "Suspense",

[Survived] StringLiteral
features/recommendations/services/recommendationService.ts:80:8
    28: "Acao",
    35: "Comedia",
    36: "Historia",
-   37: "Faroeste",
+   37: "",
    53: "Suspense",
    80: "Crime",

[Survived] StringLiteral
features/recommendations/services/recommendationService.ts:87:11
    878: "Ficcao cientifica",
    9648: "Misterio",
    10402: "Musica",
-   10749: "Romance",
+   10749: "",
    10751: "Familia",
    10752: "Guerra",

[Survived] StringLiteral
features/recommendations/services/recommendationService.ts:89:11
    10402: "Musica",
    10749: "Romance",
    10751: "Familia",
-   10752: "Guerra",
+   10752: "",
    10770: "Filme para TV",
 };

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:93:52
    10770: "Filme para TV",
 };
 
-function normalizeGenreName(value: string): string {
-   return value
-      .trim()
-      .toLowerCase()
-      .normalize("NFD")
-      .replace(/[\u0300-\u036f]/g, "")
-      .replace(/[^a-z]/g, "");
-}
+function normalizeGenreName(value: string): string {}
 
 export function getGenreIdFromLabel(label: string): number | null {
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] MethodExpression
features/recommendations/services/recommendationService.ts:94:11
 };
 
 function normalizeGenreName(value: string): string {
-   return value
-      .trim()
-      .toLowerCase()
+   return value.trim().toUpperCase()
       .normalize("NFD")
       .replace(/[\u0300-\u036f]/g, "")
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Survived] MethodExpression
features/recommendations/services/recommendationService.ts:94:11
 };
 
 function normalizeGenreName(value: string): string {
-   return value
-      .trim()
+   return value
       .toLowerCase()
       .normalize("NFD")

[Killed] StringLiteral
features/recommendations/services/recommendationService.ts:97:18
    return value
       .trim()
       .toLowerCase()
-      .normalize("NFD")
+      .normalize("")
       .replace(/[\u0300-\u036f]/g, "")
       .replace(/[^a-z]/g, "");
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: The normalization form should be one of NFC, NFD, NFKC, NFKD.

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:102:67
       .replace(/[^a-z]/g, "");
 }
 
-export function getGenreIdFromLabel(label: string): number | null {
-   return GENRE_LABEL_TO_ID[normalizeGenreName(label)] || null;
-}
+export function getGenreIdFromLabel(label: string): number | null {}
 
 export function getGenreLabelFromId(genreId: number): string {
killedBy: recommendationService normalizes labels and uses fallback for unknown genre ids
statusReason: expected undefined to be 28 // Object.is equality

[Killed] LogicalOperator
features/recommendations/services/recommendationService.ts:103:11
 }
 
 export function getGenreIdFromLabel(label: string): number | null {
-   return GENRE_LABEL_TO_ID[normalizeGenreName(label)] || null;
+   return GENRE_LABEL_TO_ID[normalizeGenreName(label)] && null;
 }
 
killedBy: recommendationService normalizes labels and uses fallback for unknown genre ids
statusReason: expected null to be 28 // Object.is equality

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:103:11
 }
 
 export function getGenreIdFromLabel(label: string): number | null {
-   return GENRE_LABEL_TO_ID[normalizeGenreName(label)] || null;
+   return false;
 }
 
killedBy: recommendationService normalizes labels and uses fallback for unknown genre ids
statusReason: expected false to be 28 // Object.is equality

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:106:62
    return GENRE_LABEL_TO_ID[normalizeGenreName(label)] || null;
 }
 
-export function getGenreLabelFromId(genreId: number): string {
-   return GENRE_ID_TO_LABEL[genreId] || "Gênero";
-}
+export function getGenreLabelFromId(genreId: number): string {}
 
 function toWeight(rating?: number | null): number {
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [ undefined, undefined ] to include 'Acao'

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:107:11
 }
 
 export function getGenreLabelFromId(genreId: number): string {
-   return GENRE_ID_TO_LABEL[genreId] || "Gênero";
+   return false;
 }
 
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [ false, false ] to include 'Acao'

[Killed] LogicalOperator
features/recommendations/services/recommendationService.ts:107:11
 }
 
 export function getGenreLabelFromId(genreId: number): string {
-   return GENRE_ID_TO_LABEL[genreId] || "Gênero";
+   return GENRE_ID_TO_LABEL[genreId] && "Gênero";
 }
 
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [ 'Gênero', 'Gênero' ] to include 'Acao'

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:110:51
    return GENRE_ID_TO_LABEL[genreId] || "Gênero";
 }
 
-function toWeight(rating?: number | null): number {
-   if (typeof rating !== "number") {
-      return 0.25;
-   }
-
-   // Nota do usuário direciona o perfil: >=4 fortalece gênero, <=2.5 enfraquece.
-   if (rating >= 4) {
-      return (rating - 3) * 2;
-   }
-
-   if (rating <= 2.5) {
-      return (rating - 3) * 2;
-   }
-
-   return 0;
-}
+function toWeight(rating?: number | null): number {}
 
 function getDecadeFromReleaseDate(releaseDate?: string): number | null {
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Survived] EqualityOperator
features/recommendations/services/recommendationService.ts:111:8
 }
 
 function toWeight(rating?: number | null): number {
-   if (typeof rating !== "number") {
+   if (typeof rating === "number") {
       return 0.25;
    }

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:111:8
 }
 
 function toWeight(rating?: number | null): number {
-   if (typeof rating !== "number") {
+   if (false) {
       return 0.25;
    }

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:116:21
    }
 
    // Nota do usuário direciona o perfil: >=4 fortalece gênero, <=2.5 enfraquece.
-   if (rating >= 4) {
-      return (rating - 3) * 2;
-   }
+   if (rating >= 4) {}
 
    if (rating <= 2.5) {
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] EqualityOperator
features/recommendations/services/recommendationService.ts:116:8
    }
 
    // Nota do usuário direciona o perfil: >=4 fortalece gênero, <=2.5 enfraquece.
-   if (rating >= 4) {
+   if (rating < 4) {
       return (rating - 3) * 2;
    }
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] ArithmeticOperator
features/recommendations/services/recommendationService.ts:117:15
 
    // Nota do usuário direciona o perfil: >=4 fortalece gênero, <=2.5 enfraquece.
    if (rating >= 4) {
-      return (rating - 3) * 2;
+      return (rating + 3) * 2;
    }
 
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:117:14
 
    // Nota do usuário direciona o perfil: >=4 fortalece gênero, <=2.5 enfraquece.
    if (rating >= 4) {
-      return (rating - 3) * 2;
+      return (rating - 3) / 2;
    }
 

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:120:8
       return (rating - 3) * 2;
    }
 
-   if (rating <= 2.5) {
+   if (true) {
       return (rating - 3) * 2;
    }

[Survived] EqualityOperator
features/recommendations/services/recommendationService.ts:120:8
       return (rating - 3) * 2;
    }
 
-   if (rating <= 2.5) {
+   if (rating < 2.5) {
       return (rating - 3) * 2;
    }

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:121:14
    }
 
    if (rating <= 2.5) {
-      return (rating - 3) * 2;
+      return (rating - 3) / 2;
    }
 

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:121:15
    }
 
    if (rating <= 2.5) {
-      return (rating - 3) * 2;
+      return (rating + 3) * 2;
    }
 

[Survived] BlockStatement
features/recommendations/services/recommendationService.ts:127:72
    return 0;
 }
 
-function getDecadeFromReleaseDate(releaseDate?: string): number | null {
-   if (!releaseDate) {
-      return null;
-   }
-
-   const year = Number(releaseDate.split("-")[0]);
-   if (Number.isNaN(year) || year < 1900) {
-      return null;
-   }
-
-   return Math.floor(year / 10) * 10;
-}
+function getDecadeFromReleaseDate(releaseDate?: string): number | null {}
 
 function buildProfile(movies: MovieData[], feedback?: RecommendationFeedbackProfile): RecommendationProfile {

[Killed] BooleanLiteral
features/recommendations/services/recommendationService.ts:128:8
 }
 
 function getDecadeFromReleaseDate(releaseDate?: string): number | null {
-   if (!releaseDate) {
+   if (releaseDate) {
       return null;
    }
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:128:22
 }
 
 function getDecadeFromReleaseDate(releaseDate?: string): number | null {
-   if (!releaseDate) {
-      return null;
-   }
+   if (!releaseDate) {}
 
    const year = Number(releaseDate.split("-")[0]);
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: Cannot read properties of undefined (reading 'split')

[Survived] EqualityOperator
features/recommendations/services/recommendationService.ts:133:30
    }
 
    const year = Number(releaseDate.split("-")[0]);
-   if (Number.isNaN(year) || year < 1900) {
+   if (Number.isNaN(year) || year >= 1900) {
       return null;
    }

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:133:30
    }
 
    const year = Number(releaseDate.split("-")[0]);
-   if (Number.isNaN(year) || year < 1900) {
+   if (Number.isNaN(year) || false) {
       return null;
    }

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:137:11
       return null;
    }
 
-   return Math.floor(year / 10) * 10;
+   return Math.floor(year / 10) / 10;
 }
 

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:137:22
       return null;
    }
 
-   return Math.floor(year / 10) * 10;
+   return Math.floor(year * 10) * 10;
 }
 

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:141:49
 }
 
 function buildProfile(movies: MovieData[], feedback?: RecommendationFeedbackProfile): RecommendationProfile {
-   const ratedMovies = movies.filter((movie) => movie.status === "watched");
+   const ratedMovies = movies.filter((movie) => false);
    const genreWeights = new Map<number, number>();
    const decadeWeights = new Map<number, number>();
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [] to include 'Acao'

[Killed] EqualityOperator
features/recommendations/services/recommendationService.ts:141:49
 }
 
 function buildProfile(movies: MovieData[], feedback?: RecommendationFeedbackProfile): RecommendationProfile {
-   const ratedMovies = movies.filter((movie) => movie.status === "watched");
+   const ratedMovies = movies.filter((movie) => movie.status !== "watched");
    const genreWeights = new Map<number, number>();
    const decadeWeights = new Map<number, number>();
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [] to include 'Acao'

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:145:37
    const genreWeights = new Map<number, number>();
    const decadeWeights = new Map<number, number>();
 
-   for (const movie of ratedMovies) {
-      const weight = toWeight(movie.rating);
-
-      for (const genreName of movie.genres || []) {
-         const genreId = GENRE_LABEL_TO_ID[normalizeGenreName(genreName)];
-         if (!genreId) {
-            continue;
-         }
-
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + weight);
-      }
-
-      const decade = getDecadeFromReleaseDate(movie.release_date);
-      if (decade) {
-         decadeWeights.set(decade, (decadeWeights.get(decade) ?? 0) + weight);
-      }
-   }
+   for (const movie of ratedMovies) {}
 
    if (feedback?.genreAdjustments) {
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:148:31
    for (const movie of ratedMovies) {
       const weight = toWeight(movie.rating);
 
-      for (const genreName of movie.genres || []) {
+      for (const genreName of false) {
          const genreId = GENRE_LABEL_TO_ID[normalizeGenreName(genreName)];
          if (!genreId) {
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: boolean false is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:150:14
 
       for (const genreName of movie.genres || []) {
          const genreId = GENRE_LABEL_TO_ID[normalizeGenreName(genreName)];
-         if (!genreId) {
+         if (true) {
             continue;
          }
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] BooleanLiteral
features/recommendations/services/recommendationService.ts:150:14
 
       for (const genreName of movie.genres || []) {
          const genreId = GENRE_LABEL_TO_ID[normalizeGenreName(genreName)];
-         if (!genreId) {
+         if (genreId) {
             continue;
          }
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] ArithmeticOperator
features/recommendations/services/recommendationService.ts:154:36
             continue;
          }
 
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + weight);
+         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) - weight);
       }
 
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: expected 300 to be 200 // Object.is equality

[Killed] LogicalOperator
features/recommendations/services/recommendationService.ts:154:37
             continue;
          }
 
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + weight);
+         genreWeights.set(genreId, (genreWeights.get(genreId) && 0) + weight);
       }
 
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:158:11
       }
 
       const decade = getDecadeFromReleaseDate(movie.release_date);
-      if (decade) {
+      if (false) {
          decadeWeights.set(decade, (decadeWeights.get(decade) ?? 0) + weight);
       }

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:158:11
       }
 
       const decade = getDecadeFromReleaseDate(movie.release_date);
-      if (decade) {
+      if (true) {
          decadeWeights.set(decade, (decadeWeights.get(decade) ?? 0) + weight);
       }

[Survived] LogicalOperator
features/recommendations/services/recommendationService.ts:159:37
 
       const decade = getDecadeFromReleaseDate(movie.release_date);
       if (decade) {
-         decadeWeights.set(decade, (decadeWeights.get(decade) ?? 0) + weight);
+         decadeWeights.set(decade, (decadeWeights.get(decade) && 0) + weight);
       }
    }

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:159:36
 
       const decade = getDecadeFromReleaseDate(movie.release_date);
       if (decade) {
-         decadeWeights.set(decade, (decadeWeights.get(decade) ?? 0) + weight);
+         decadeWeights.set(decade, (decadeWeights.get(decade) ?? 0) - weight);
       }
    }

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:163:36
       }
    }
 
-   if (feedback?.genreAdjustments) {
-      for (const [genreIdRaw, adjustment] of Object.entries(feedback.genreAdjustments)) {
-         const genreId = Number(genreIdRaw);
-         if (Number.isNaN(genreId) || typeof adjustment !== "number") {
-            continue;
-         }
-
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + adjustment);
-      }
-   }
+   if (feedback?.genreAdjustments) {}
 
    const sortedGenres = Array.from(genreWeights.entries())
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] OptionalChaining
features/recommendations/services/recommendationService.ts:163:8
       }
    }
 
-   if (feedback?.genreAdjustments) {
+   if (feedback.genreAdjustments) {
       for (const [genreIdRaw, adjustment] of Object.entries(feedback.genreAdjustments)) {
          const genreId = Number(genreIdRaw);
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: Cannot read properties of undefined (reading 'genreAdjustments')

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:164:89
    }
 
    if (feedback?.genreAdjustments) {
-      for (const [genreIdRaw, adjustment] of Object.entries(feedback.genreAdjustments)) {
-         const genreId = Number(genreIdRaw);
-         if (Number.isNaN(genreId) || typeof adjustment !== "number") {
-            continue;
-         }
-
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + adjustment);
-      }
+      for (const [genreIdRaw, adjustment] of Object.entries(feedback.genreAdjustments)) {}
    }
 
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] EqualityOperator
features/recommendations/services/recommendationService.ts:166:39
    if (feedback?.genreAdjustments) {
       for (const [genreIdRaw, adjustment] of Object.entries(feedback.genreAdjustments)) {
          const genreId = Number(genreIdRaw);
-         if (Number.isNaN(genreId) || typeof adjustment !== "number") {
+         if (Number.isNaN(genreId) || typeof adjustment === "number") {
             continue;
          }
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:166:14
    if (feedback?.genreAdjustments) {
       for (const [genreIdRaw, adjustment] of Object.entries(feedback.genreAdjustments)) {
          const genreId = Number(genreIdRaw);
-         if (Number.isNaN(genreId) || typeof adjustment !== "number") {
+         if (true) {
             continue;
          }
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] ArithmeticOperator
features/recommendations/services/recommendationService.ts:170:36
             continue;
          }
 
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + adjustment);
+         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) - adjustment);
       }
    }
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] LogicalOperator
features/recommendations/services/recommendationService.ts:170:37
             continue;
          }
 
-         genreWeights.set(genreId, (genreWeights.get(genreId) ?? 0) + adjustment);
+         genreWeights.set(genreId, (genreWeights.get(genreId) && 0) + adjustment);
       }
    }
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] MethodExpression
features/recommendations/services/recommendationService.ts:174:25
       }
    }
 
-   const sortedGenres = Array.from(genreWeights.entries())
-      .sort(([, a], [, b]) => b - a)
+   const sortedGenres = Array.from(genreWeights.entries())
       .slice(0, 3)
       .map(([genreId]) => genreId);
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Survived] MethodExpression
features/recommendations/services/recommendationService.ts:174:25
       }
    }
 
-   const sortedGenres = Array.from(genreWeights.entries())
-      .sort(([, a], [, b]) => b - a)
-      .slice(0, 3)
+   const sortedGenres = Array.from(genreWeights.entries()).sort(([, a], [, b]) => b - a)
       .map(([genreId]) => genreId);
 

[Killed] ArithmeticOperator
features/recommendations/services/recommendationService.ts:175:31
    }
 
    const sortedGenres = Array.from(genreWeights.entries())
-      .sort(([, a], [, b]) => b - a)
+      .sort(([, a], [, b]) => b + a)
       .slice(0, 3)
       .map(([genreId]) => genreId);
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] ArrowFunction
features/recommendations/services/recommendationService.ts:175:13
    }
 
    const sortedGenres = Array.from(genreWeights.entries())
-      .sort(([, a], [, b]) => b - a)
+      .sort(() => undefined)
       .slice(0, 3)
       .map(([genreId]) => genreId);
killedBy: recommendationService applies feedback genre adjustments to favorite labels
statusReason: expected 'Acao' to be 'Drama' // Object.is equality

[Killed] ArrowFunction
features/recommendations/services/recommendationService.ts:177:12
    const sortedGenres = Array.from(genreWeights.entries())
       .sort(([, a], [, b]) => b - a)
       .slice(0, 3)
-      .map(([genreId]) => genreId);
+      .map(() => undefined);
 
    return {
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [ 'Gênero', 'Gênero' ] to include 'Acao'

[Killed] ArrowFunction
features/recommendations/services/recommendationService.ts:181:45
 
    return {
       favoriteGenreIds: sortedGenres,
-      favoriteGenreLabels: sortedGenres.map((genreId) => getGenreLabelFromId(genreId)),
+      favoriteGenreLabels: sortedGenres.map(() => undefined),
       genreWeights,
       decadeWeights,
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: expected [ undefined, undefined ] to include 'Acao'

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:188:65
    };
 }
 
-function toRecommendedMovie(item: DiscoverCandidate): MovieData {
-   return {
-      id: -100000 - item.id,
-      tmdb_id: item.id,
-      rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
-      review: "",
-      recommended: "Recomendado",
-      created_at: new Date().toISOString(),
-      title: item.title || "Filme recomendado",
-      poster_path: item.poster_path || undefined,
-      release_date: item.release_date || undefined,
-      overview: item.overview || undefined,
-      director: "Não informado",
-      status: "watchlist",
-      genres: (item.genre_ids || []).map((genreId) => getGenreLabelFromId(genreId)),
-      countries: [],
-      cast: [],
-   };
-}
+function toRecommendedMovie(item: DiscoverCandidate): MovieData {}
 
 function buildReasons(item: DiscoverCandidate, profile: RecommendationProfile): string[] {
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: Cannot read properties of undefined (reading 'tmdb_id')

[Survived] UnaryOperator
features/recommendations/services/recommendationService.ts:190:11
 
 function toRecommendedMovie(item: DiscoverCandidate): MovieData {
    return {
-      id: -100000 - item.id,
+      id: +100000 - item.id,
       tmdb_id: item.id,
       rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:190:11
 
 function toRecommendedMovie(item: DiscoverCandidate): MovieData {
    return {
-      id: -100000 - item.id,
+      id: -100000 + item.id,
       tmdb_id: item.id,
       rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,

[Survived] EqualityOperator
features/recommendations/services/recommendationService.ts:192:15
    return {
       id: -100000 - item.id,
       tmdb_id: item.id,
-      rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
+      rating: typeof item.vote_average !== "number" ? Number(item.vote_average.toFixed(1)) : null,
       review: "",
       recommended: "Recomendado",

[Survived] StringLiteral
features/recommendations/services/recommendationService.ts:194:20
       tmdb_id: item.id,
       rating: typeof item.vote_average === "number" ? Number(item.vote_average.toFixed(1)) : null,
       review: "",
-      recommended: "Recomendado",
+      recommended: "",
       created_at: new Date().toISOString(),
       title: item.title || "Filme recomendado",

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:196:14
       review: "",
       recommended: "Recomendado",
       created_at: new Date().toISOString(),
-      title: item.title || "Filme recomendado",
+      title: false,
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:196:14
       review: "",
       recommended: "Recomendado",
       created_at: new Date().toISOString(),
-      title: item.title || "Filme recomendado",
+      title: true,
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,

[Survived] LogicalOperator
features/recommendations/services/recommendationService.ts:197:20
       recommended: "Recomendado",
       created_at: new Date().toISOString(),
       title: item.title || "Filme recomendado",
-      poster_path: item.poster_path || undefined,
+      poster_path: item.poster_path && undefined,
       release_date: item.release_date || undefined,
       overview: item.overview || undefined,

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:197:20
       recommended: "Recomendado",
       created_at: new Date().toISOString(),
       title: item.title || "Filme recomendado",
-      poster_path: item.poster_path || undefined,
+      poster_path: false,
       release_date: item.release_date || undefined,
       overview: item.overview || undefined,

[Survived] LogicalOperator
features/recommendations/services/recommendationService.ts:198:21
       created_at: new Date().toISOString(),
       title: item.title || "Filme recomendado",
       poster_path: item.poster_path || undefined,
-      release_date: item.release_date || undefined,
+      release_date: item.release_date && undefined,
       overview: item.overview || undefined,
       director: "Não informado",

[Survived] ConditionalExpression
features/recommendations/services/recommendationService.ts:199:17
       title: item.title || "Filme recomendado",
       poster_path: item.poster_path || undefined,
       release_date: item.release_date || undefined,
-      overview: item.overview || undefined,
+      overview: true,
       director: "Não informado",
       status: "watchlist",

[Killed] ConditionalExpression
features/recommendations/services/recommendationService.ts:202:16
       overview: item.overview || undefined,
       director: "Não informado",
       status: "watchlist",
-      genres: (item.genre_ids || []).map((genreId) => getGenreLabelFromId(genreId)),
+      genres: (false).map((genreId) => getGenreLabelFromId(genreId)),
       countries: [],
       cast: [],
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function
