[Survived] MethodExpression
features/recommendations/services/recommendationService.ts:294:19
       }));
    }
 
-   const ranked = uniqueCandidates
-      .map((candidate) => ({
-         movie: toRecommendedMovie(candidate),
-         score: scoreCandidate(candidate, profile),
-         reasons: buildReasons(candidate, profile),
-      }))
-      .sort((a, b) => b.score - a.score)
+   const ranked = uniqueCandidates.map(candidate => ({
+  movie: toRecommendedMovie(candidate),
+  score: scoreCandidate(candidate, profile),
+  reasons: buildReasons(candidate, profile)
+}))
       .slice(0, limit);
 

[Survived] MethodExpression
features/recommendations/services/recommendationService.ts:294:19
       }));
    }
 
-   const ranked = uniqueCandidates
-      .map((candidate) => ({
-         movie: toRecommendedMovie(candidate),
-         score: scoreCandidate(candidate, profile),
-         reasons: buildReasons(candidate, profile),
-      }))
-      .sort((a, b) => b.score - a.score)
-      .slice(0, limit);
+   const ranked = uniqueCandidates.map(candidate => ({
+  movie: toRecommendedMovie(candidate),
+  score: scoreCandidate(candidate, profile),
+  reasons: buildReasons(candidate, profile)
+})).sort((a, b) => b.score - a.score);
 
    return ranked;

[Killed] ArrowFunction
features/recommendations/services/recommendationService.ts:295:12
    }
 
    const ranked = uniqueCandidates
-      .map((candidate) => ({
-         movie: toRecommendedMovie(candidate),
-         score: scoreCandidate(candidate, profile),
-         reasons: buildReasons(candidate, profile),
-      }))
+      .map(() => undefined)
       .sort((a, b) => b.score - a.score)
       .slice(0, limit);
killedBy: recommendationService prioritizes matching genres and excludes known movies
statusReason: Cannot read properties of undefined (reading 'movie')

[Survived] ArithmeticOperator
features/recommendations/services/recommendationService.ts:300:23
          score: scoreCandidate(candidate, profile),
          reasons: buildReasons(candidate, profile),
       }))
-      .sort((a, b) => b.score - a.score)
+      .sort((a, b) => b.score + a.score)
       .slice(0, limit);
 

[Survived] ArrowFunction
features/recommendations/services/recommendationService.ts:300:13
          score: scoreCandidate(candidate, profile),
          reasons: buildReasons(candidate, profile),
       }))
-      .sort((a, b) => b.score - a.score)
+      .sort(() => undefined)
       .slice(0, limit);
 

[Killed] BlockStatement
features/recommendations/services/recommendationService.ts:306:113
    return ranked;
 }
 
-export function getFavoriteGenreLabels(movies: MovieData[], feedback?: RecommendationFeedbackProfile): string[] {
-   return buildProfile(movies, feedback).favoriteGenreLabels;
-}
+export function getFavoriteGenreLabels(movies: MovieData[], feedback?: RecommendationFeedbackProfile): string[] {}
 
killedBy: recommendationService extracts favorite genre labels from user movies
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
