[Killed] BlockStatement
features/support/logic/sendSupportEmail.ts:21:72
    error: string | null;
 }
 
-export function validateSupportMessage(message: string): SupportResult {
-   if (!message.trim()) {
-      return { success: false, error: "A mensagem não pode estar vazia." };
-   }
-   return { success: true, error: null };
-}
+export function validateSupportMessage(message: string): SupportResult {}
 
 export function buildSupportEmailPayload(
killedBy: sendSupportEmailService returns validation error for empty message
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
features/support/logic/sendSupportEmail.ts:22:25
 }
 
 export function validateSupportMessage(message: string): SupportResult {
-   if (!message.trim()) {
-      return { success: false, error: "A mensagem não pode estar vazia." };
-   }
+   if (!message.trim()) {}
    return { success: true, error: null };
 }
killedBy: sendSupportEmailService returns validation error for empty message
statusReason: expected { success: false, …(1) } to deeply equal { success: false, …(1) }

[Killed] ConditionalExpression
features/support/logic/sendSupportEmail.ts:22:8
 }
 
 export function validateSupportMessage(message: string): SupportResult {
-   if (!message.trim()) {
+   if (true) {
       return { success: false, error: "A mensagem não pode estar vazia." };
    }
killedBy: sendSupportEmailService returns success when web3forms request succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
features/support/logic/sendSupportEmail.ts:23:25
 
 export function validateSupportMessage(message: string): SupportResult {
    if (!message.trim()) {
-      return { success: false, error: "A mensagem não pode estar vazia." };
+      return { success: true, error: "A mensagem não pode estar vazia." };
    }
    return { success: true, error: null };
killedBy: support logic validates empty message
statusReason: expected { success: true, …(1) } to deeply equal { success: false, …(1) }

[Killed] ObjectLiteral
features/support/logic/sendSupportEmail.ts:23:14
 
 export function validateSupportMessage(message: string): SupportResult {
    if (!message.trim()) {
-      return { success: false, error: "A mensagem não pode estar vazia." };
+      return {};
    }
    return { success: true, error: null };
killedBy: sendSupportEmailService returns validation error for empty message
statusReason: expected {} to deeply equal { success: false, …(1) }

[Killed] BooleanLiteral
features/support/logic/sendSupportEmail.ts:25:22
    if (!message.trim()) {
       return { success: false, error: "A mensagem não pode estar vazia." };
    }
-   return { success: true, error: null };
+   return { success: false, error: null };
 }
 
killedBy: sendSupportEmailService returns success when web3forms request succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
features/support/logic/sendSupportEmail.ts:25:11
    if (!message.trim()) {
       return { success: false, error: "A mensagem não pode estar vazia." };
    }
-   return { success: true, error: null };
+   return {};
 }
 
killedBy: sendSupportEmailService returns success when web3forms request succeeds
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
features/support/logic/sendSupportEmail.ts:34:24
    type: SupportTicketType,
    userEmail?: string,
    userId?: string
-): SupportEmailPayload {
-   return {
-      access_key: accessKey,
-      subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
-      from_name: "JJ Reviews App",
-      email: userEmail || "anonimo@jjreviews.com",
-      message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
-   };
-}
+): SupportEmailPayload {}
 
 export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {
killedBy: support logic builds payload with defaults
statusReason: Cannot read properties of undefined (reading 'access_key')

[Killed] ObjectLiteral
features/support/logic/sendSupportEmail.ts:35:11
    userEmail?: string,
    userId?: string
 ): SupportEmailPayload {
-   return {
-      access_key: accessKey,
-      subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
-      from_name: "JJ Reviews App",
-      email: userEmail || "anonimo@jjreviews.com",
-      message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
-   };
+   return {};
 }
 
killedBy: support logic builds payload with defaults
statusReason: expected undefined to be 'key' // Object.is equality

[Killed] MethodExpression
features/support/logic/sendSupportEmail.ts:37:45
 ): SupportEmailPayload {
    return {
       access_key: accessKey,
-      subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
+      subject: `[JJ Reviews] Novo Ticket: ${type.toLowerCase()}`,
       from_name: "JJ Reviews App",
       email: userEmail || "anonimo@jjreviews.com",
killedBy: support logic builds payload with defaults
statusReason: expected '[JJ Reviews] Novo Ticket: bug' to contain 'BUG'

[Killed] StringLiteral
features/support/logic/sendSupportEmail.ts:37:16
 ): SupportEmailPayload {
    return {
       access_key: accessKey,
-      subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
+      subject: ``,
       from_name: "JJ Reviews App",
       email: userEmail || "anonimo@jjreviews.com",
killedBy: support logic builds payload with defaults
statusReason: expected '' to contain 'BUG'

[Killed] ConditionalExpression
features/support/logic/sendSupportEmail.ts:39:14
       access_key: accessKey,
       subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
       from_name: "JJ Reviews App",
-      email: userEmail || "anonimo@jjreviews.com",
+      email: true,
       message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
    };
killedBy: support logic builds payload with defaults
statusReason: expected true to be 'anonimo@jjreviews.com' // Object.is equality

[Killed] LogicalOperator
features/support/logic/sendSupportEmail.ts:39:14
       access_key: accessKey,
       subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
       from_name: "JJ Reviews App",
-      email: userEmail || "anonimo@jjreviews.com",
+      email: userEmail && "anonimo@jjreviews.com",
       message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
    };
killedBy: support logic builds payload with defaults
statusReason: expected undefined to be 'anonimo@jjreviews.com' // Object.is equality

[Survived] ConditionalExpression
features/support/logic/sendSupportEmail.ts:40:80
       subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
       from_name: "JJ Reviews App",
       email: userEmail || "anonimo@jjreviews.com",
-      message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
+      message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${false}\n\nMensagem:\n${message}`,
    };
 }

[Survived] LogicalOperator
features/support/logic/sendSupportEmail.ts:40:46
       subject: `[JJ Reviews] Novo Ticket: ${type.toUpperCase()}`,
       from_name: "JJ Reviews App",
       email: userEmail || "anonimo@jjreviews.com",
-      message: `Tipo: ${type}\nUsuário ID: ${userId || "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
+      message: `Tipo: ${type}\nUsuário ID: ${userId && "Não logado"}\nEmail: ${userEmail || "Não informado"}\n\nMensagem:\n${message}`,
    };
 }

[Killed] BlockStatement
features/support/logic/sendSupportEmail.ts:44:109
    };
 }
 
-export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {
-   if (responseOk && result.success) {
-      return { success: true, error: null };
-   }
-
-   return {
-      success: false,
-      error: `Falha ao enviar email: ${result.message || "Erro ao conectar com o serviço de email."}`,
-   };
-}
+export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {}
 
 export function mapSupportEmailUnknownError(err: unknown): SupportResult {
killedBy: support logic maps success and failure api responses
statusReason: expected undefined to deeply equal { success: true, error: null }

[Killed] ConditionalExpression
features/support/logic/sendSupportEmail.ts:45:8
 }
 
 export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {
-   if (responseOk && result.success) {
+   if (true) {
       return { success: true, error: null };
    }
killedBy: support logic maps success and failure api responses
statusReason: expected { success: true, error: null } to deeply equal { success: false, …(1) }

[Killed] ConditionalExpression
features/support/logic/sendSupportEmail.ts:45:8
 }
 
 export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {
-   if (responseOk && result.success) {
+   if (false) {
       return { success: true, error: null };
    }
killedBy: sendSupportEmailService returns success when web3forms request succeeds
statusReason: expected { success: false, …(1) } to deeply equal { success: true, error: null }

[Killed] BooleanLiteral
features/support/logic/sendSupportEmail.ts:46:25
 
 export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {
    if (responseOk && result.success) {
-      return { success: true, error: null };
+      return { success: false, error: null };
    }
 
killedBy: support logic maps success and failure api responses
statusReason: expected { success: false, error: null } to deeply equal { success: true, error: null }

[Killed] ObjectLiteral
features/support/logic/sendSupportEmail.ts:46:14
 
 export function mapSupportEmailApiResult(responseOk: boolean, result: SupportEmailApiResult): SupportResult {
    if (responseOk && result.success) {
-      return { success: true, error: null };
+      return {};
    }
 
killedBy: sendSupportEmailService returns success when web3forms request succeeds
statusReason: expected {} to deeply equal { success: true, error: null }

[Killed] ObjectLiteral
features/support/logic/sendSupportEmail.ts:49:11
       return { success: true, error: null };
    }
 
-   return {
-      success: false,
-      error: `Falha ao enviar email: ${result.message || "Erro ao conectar com o serviço de email."}`,
-   };
+   return {};
 }
 
killedBy: sendSupportEmailService returns mapped error on api rejection
statusReason: expected {} to deeply equal { success: false, …(1) }

[Killed] ConditionalExpression
features/support/logic/sendSupportEmail.ts:51:40
 
    return {
       success: false,
-      error: `Falha ao enviar email: ${result.message || "Erro ao conectar com o serviço de email."}`,
+      error: `Falha ao enviar email: ${true}`,
    };
 }
killedBy: sendSupportEmailService returns mapped error on api rejection
statusReason: expected { success: false, …(1) } to deeply equal { success: false, …(1) }

[Killed] ConditionalExpression
features/support/logic/sendSupportEmail.ts:51:40
 
    return {
       success: false,
-      error: `Falha ao enviar email: ${result.message || "Erro ao conectar com o serviço de email."}`,
+      error: `Falha ao enviar email: ${false}`,
    };
 }
killedBy: sendSupportEmailService returns mapped error on api rejection
statusReason: expected { success: false, …(1) } to deeply equal { success: false, …(1) }

[Killed] BlockStatement
features/support/logic/sendSupportEmail.ts:55:74
    };
 }
 
-export function mapSupportEmailUnknownError(err: unknown): SupportResult {
-   const errorMessage = err instanceof Error ? err.message : "Erro desconhecido";
-   return { success: false, error: `Falha ao enviar email: ${errorMessage}` };
-}
+export function mapSupportEmailUnknownError(err: unknown): SupportResult {}
killedBy: sendSupportEmailService returns mapped error on thrown exception
statusReason: expected undefined to deeply equal { success: false, …(1) }

[NoCoverage] StringLiteral
features/support/logic/sendSupportEmail.ts:56:62
 }
 
 export function mapSupportEmailUnknownError(err: unknown): SupportResult {
-   const errorMessage = err instanceof Error ? err.message : "Erro desconhecido";
+   const errorMessage = err instanceof Error ? err.message : "";
    return { success: false, error: `Falha ao enviar email: ${errorMessage}` };
 }

[Killed] BooleanLiteral
features/support/logic/sendSupportEmail.ts:57:22
 
 export function mapSupportEmailUnknownError(err: unknown): SupportResult {
    const errorMessage = err instanceof Error ? err.message : "Erro desconhecido";
-   return { success: false, error: `Falha ao enviar email: ${errorMessage}` };
+   return { success: true, error: `Falha ao enviar email: ${errorMessage}` };
 }
killedBy: support logic maps unknown error
statusReason: expected { success: true, …(1) } to deeply equal { success: false, …(1) }
