[Killed] BlockStatement
components/GamesHub/services/dailyGameStorageService.ts:12:93
    revealedHintFields?: string[];
 }
 
-export function loadDailyGameProgress(progressStorageKey: string): DailyGameProgress | null {
-   try {
-      const persistedRaw = window.sessionStorage.getItem(progressStorageKey);
-      if (!persistedRaw) return null;
-      return JSON.parse(persistedRaw) as DailyGameProgress;
-   } catch {
-      window.sessionStorage.removeItem(progressStorageKey);
-      return null;
-   }
-}
+export function loadDailyGameProgress(progressStorageKey: string): DailyGameProgress | null {}
 
 export function saveDailyGameProgress(progressStorageKey: string, progress: DailyGameProgress): void {
killedBy: dailyGameStorageService salva e carrega progresso
statusReason: expected undefined to deeply equal { dateKey: '2026-03-21', …(5) }

[Killed] BlockStatement
components/GamesHub/services/dailyGameStorageService.ts:13:8
 }
 
 export function loadDailyGameProgress(progressStorageKey: string): DailyGameProgress | null {
-   try {
-      const persistedRaw = window.sessionStorage.getItem(progressStorageKey);
-      if (!persistedRaw) return null;
-      return JSON.parse(persistedRaw) as DailyGameProgress;
-   } catch {
+   try {} catch {
       window.sessionStorage.removeItem(progressStorageKey);
       return null;
killedBy: dailyGameStorageService salva e carrega progresso
statusReason: expected undefined to deeply equal { dateKey: '2026-03-21', …(5) }

[Killed] BooleanLiteral
components/GamesHub/services/dailyGameStorageService.ts:15:11
 export function loadDailyGameProgress(progressStorageKey: string): DailyGameProgress | null {
    try {
       const persistedRaw = window.sessionStorage.getItem(progressStorageKey);
-      if (!persistedRaw) return null;
+      if (persistedRaw) return null;
       return JSON.parse(persistedRaw) as DailyGameProgress;
    } catch {
killedBy: dailyGameStorageService salva e carrega progresso
statusReason: expected null to deeply equal { dateKey: '2026-03-21', …(5) }

[Killed] ConditionalExpression
components/GamesHub/services/dailyGameStorageService.ts:15:11
 export function loadDailyGameProgress(progressStorageKey: string): DailyGameProgress | null {
    try {
       const persistedRaw = window.sessionStorage.getItem(progressStorageKey);
-      if (!persistedRaw) return null;
+      if (true) return null;
       return JSON.parse(persistedRaw) as DailyGameProgress;
    } catch {
killedBy: dailyGameStorageService salva e carrega progresso
statusReason: expected null to deeply equal { dateKey: '2026-03-21', …(5) }

[Killed] BlockStatement
components/GamesHub/services/dailyGameStorageService.ts:17:12
       const persistedRaw = window.sessionStorage.getItem(progressStorageKey);
       if (!persistedRaw) return null;
       return JSON.parse(persistedRaw) as DailyGameProgress;
-   } catch {
-      window.sessionStorage.removeItem(progressStorageKey);
-      return null;
-   }
+   } catch {}
 }
 
killedBy: dailyGameStorageService remove item invalido quando JSON estiver corrompido
statusReason: expected undefined to be null

[Killed] BlockStatement
components/GamesHub/services/dailyGameStorageService.ts:23:102
    }
 }
 
-export function saveDailyGameProgress(progressStorageKey: string, progress: DailyGameProgress): void {
-   try {
-      window.sessionStorage.setItem(progressStorageKey, JSON.stringify(progress));
-   } catch {
-      // Ignore storage quota/serialization issues to keep gameplay working.
-   }
-}
+export function saveDailyGameProgress(progressStorageKey: string, progress: DailyGameProgress): void {}
 
 export function clearDailyGameProgress(progressStorageKey: string): void {
killedBy: dailyGameStorageService salva e carrega progresso
statusReason: expected null to deeply equal { dateKey: '2026-03-21', …(5) }

[Killed] BlockStatement
components/GamesHub/services/dailyGameStorageService.ts:24:8
 }
 
 export function saveDailyGameProgress(progressStorageKey: string, progress: DailyGameProgress): void {
-   try {
-      window.sessionStorage.setItem(progressStorageKey, JSON.stringify(progress));
-   } catch {
+   try {} catch {
       // Ignore storage quota/serialization issues to keep gameplay working.
    }
killedBy: dailyGameStorageService salva e carrega progresso
statusReason: expected null to deeply equal { dateKey: '2026-03-21', …(5) }

[Killed] BlockStatement
components/GamesHub/services/dailyGameStorageService.ts:31:74
    }
 }
 
-export function clearDailyGameProgress(progressStorageKey: string): void {
-   window.sessionStorage.removeItem(progressStorageKey);
-}
+export function clearDailyGameProgress(progressStorageKey: string): void {}
 
killedBy: dailyGameStorageService limpa progresso
statusReason: expected '{"dateKey":"2026-03-21","targetMovie"…' to be null
