[Killed] BlockStatement
features/lists/logic/listSocial.ts:3:71
 export type ListType = "private" | "partial_shared" | "full_shared";
 
-export function generateDuplicateTitle(originalTitle: string): string {
-  return `${originalTitle} (Cópia)`;
-}
+export function generateDuplicateTitle(originalTitle: string): string {}
 
 export function buildListShareUrl(listId: string, ownerUsername: string): string {
killedBy: listSocial Logic deve gerar o título de cópia corretamente
statusReason: expected undefined to be 'Favoritos (Cópia)' // Object.is equality

[Killed] BlockStatement
features/lists/logic/listSocial.ts:7:82
   return `${originalTitle} (Cópia)`;
 }
 
-export function buildListShareUrl(listId: string, ownerUsername: string): string {
-  const origin = typeof window !== "undefined" ? window.location.origin : "https://jj-reviews.vercel.app";
-  const path = ownerUsername ? `/perfil/${ownerUsername}` : "/";
-  return `${origin}${path}?aba=lists&listId=${listId}`;
-}
+export function buildListShareUrl(listId: string, ownerUsername: string): string {}
 
 export function requiresImmediateCollaborators(type: ListType): boolean {
killedBy: useListSocial handleShare successfully copies share URL to clipboard
statusReason: expected undefined to be 'http://localhost:3000/perfil/joao?aba…' // Object.is equality

[Killed] ConditionalExpression
features/lists/logic/listSocial.ts:8:18
 }
 
 export function buildListShareUrl(listId: string, ownerUsername: string): string {
-  const origin = typeof window !== "undefined" ? window.location.origin : "https://jj-reviews.vercel.app";
+  const origin = true ? window.location.origin : "https://jj-reviews.vercel.app";
   const path = ownerUsername ? `/perfil/${ownerUsername}` : "/";
   return `${origin}${path}?aba=lists&listId=${listId}`;
killedBy: listSocial Logic deve usar origin fallback quando window nao estiver disponivel
statusReason: Cannot read properties of undefined (reading 'location')

[Killed] EqualityOperator
features/lists/logic/listSocial.ts:8:18
 }
 
 export function buildListShareUrl(listId: string, ownerUsername: string): string {
-  const origin = typeof window !== "undefined" ? window.location.origin : "https://jj-reviews.vercel.app";
+  const origin = typeof window === "undefined" ? window.location.origin : "https://jj-reviews.vercel.app";
   const path = ownerUsername ? `/perfil/${ownerUsername}` : "/";
   return `${origin}${path}?aba=lists&listId=${listId}`;
killedBy: useListSocial handleShare successfully copies share URL to clipboard
statusReason: expected 'https://jj-reviews.vercel.app/perfil/…' to be 'http://localhost:3000/perfil/joao?aba…' // Object.is equality

[Killed] StringLiteral
features/lists/logic/listSocial.ts:9:61
 
 export function buildListShareUrl(listId: string, ownerUsername: string): string {
   const origin = typeof window !== "undefined" ? window.location.origin : "https://jj-reviews.vercel.app";
-  const path = ownerUsername ? `/perfil/${ownerUsername}` : "/";
+  const path = ownerUsername ? `/perfil/${ownerUsername}` : "";
   return `${origin}${path}?aba=lists&listId=${listId}`;
 }
killedBy: listSocial Logic deve gerar URL com caminho raiz quando nao houver dono
statusReason: expected 'http://localhost:3000?aba=lists&listI…' to be 'http://localhost:3000/?aba=lists&list…' // Object.is equality

[Killed] BlockStatement
features/lists/logic/listSocial.ts:13:73
   return `${origin}${path}?aba=lists&listId=${listId}`;
 }
 
-export function requiresImmediateCollaborators(type: ListType): boolean {
-  return type !== "private";
-}
+export function requiresImmediateCollaborators(type: ListType): boolean {}
killedBy: listSocial Logic deve identificar tipos que exigem colaboradores imediatos
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
features/lists/logic/listSocial.ts:14:10
 }
 
 export function requiresImmediateCollaborators(type: ListType): boolean {
-  return type !== "private";
+  return false;
 }
killedBy: listSocial Logic deve identificar tipos que exigem colaboradores imediatos
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
features/lists/logic/listSocial.ts:14:10
 }
 
 export function requiresImmediateCollaborators(type: ListType): boolean {
-  return type !== "private";
+  return type === "private";
 }
killedBy: listSocial Logic deve identificar tipos que exigem colaboradores imediatos
statusReason: expected true to be false // Object.is equality
