[Killed] BlockStatement
features/movies/services/movieReviewService.ts:3:82
 import { supabase } from "@/lib/supabase";
 
-export async function deleteReviewById(reviewId: string | number): Promise<void> {
-   const { error } = await supabase.from("reviews").delete().eq("id", reviewId);
-   if (error) throw error;
-}
+export async function deleteReviewById(reviewId: string | number): Promise<void> {}
 
 export async function removeMovieFromPrivateLists(tmdbId: number, privateListIds: string[]): Promise<void> {
killedBy: movieReviewService deletes review by id
statusReason: expected "vi.fn()" to be called with arguments: [ 'reviews' ]

Number of calls: 0

[Killed] StringLiteral
features/movies/services/movieReviewService.ts:4:42
 import { supabase } from "@/lib/supabase";
 
 export async function deleteReviewById(reviewId: string | number): Promise<void> {
-   const { error } = await supabase.from("reviews").delete().eq("id", reviewId);
+   const { error } = await supabase.from("").delete().eq("id", reviewId);
    if (error) throw error;
 }
killedBy: movieReviewService deletes review by id
statusReason: expected "vi.fn()" to be called with arguments: [ 'reviews' ]

Received:

  1st vi.fn() call:

  [
-   "reviews",

[Killed] ConditionalExpression
features/movies/services/movieReviewService.ts:5:8
 
 export async function deleteReviewById(reviewId: string | number): Promise<void> {
    const { error } = await supabase.from("reviews").delete().eq("id", reviewId);
-   if (error) throw error;
+   if (true) throw error;
 }
 
killedBy: movieReviewService deletes review by id
statusReason: promise rejected "null" instead of resolving

[Killed] ConditionalExpression
features/movies/services/movieReviewService.ts:5:8
 
 export async function deleteReviewById(reviewId: string | number): Promise<void> {
    const { error } = await supabase.from("reviews").delete().eq("id", reviewId);
-   if (error) throw error;
+   if (false) throw error;
 }
 
killedBy: movieReviewService throws when deleting review by id fails
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
features/movies/services/movieReviewService.ts:8:108
    if (error) throw error;
 }
 
-export async function removeMovieFromPrivateLists(tmdbId: number, privateListIds: string[]): Promise<void> {
-   if (privateListIds.length === 0) return;
-
-   const { error } = await supabase
-      .from("list_movies")
-      .delete()
-      .eq("tmdb_id", tmdbId)
-      .in("list_id", privateListIds);
-
-   if (error) throw error;
-}
+export async function removeMovieFromPrivateLists(tmdbId: number, privateListIds: string[]): Promise<void> {}
 
killedBy: movieReviewService removes movie from private lists
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_movies' ]

Number of calls: 0

[Killed] EqualityOperator
features/movies/services/movieReviewService.ts:9:8
 }
 
 export async function removeMovieFromPrivateLists(tmdbId: number, privateListIds: string[]): Promise<void> {
-   if (privateListIds.length === 0) return;
+   if (privateListIds.length !== 0) return;
 
    const { error } = await supabase
killedBy: movieReviewService removes movie from private lists
statusReason: expected "vi.fn()" to be called with arguments: [ 'list_movies' ]

Number of calls: 0

[Killed] ConditionalExpression
features/movies/services/movieReviewService.ts:9:8
 }
 
 export async function removeMovieFromPrivateLists(tmdbId: number, privateListIds: string[]): Promise<void> {
-   if (privateListIds.length === 0) return;
+   if (false) return;
 
    const { error } = await supabase
killedBy: movieReviewService skips delete when private list ids are empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "list_movies",
