[Killed] BlockStatement
features/notifications/logic/notificationOperations.ts:11:103
 /**
  * Transforma a resposta crua do Supabase no formato estrito do Front-end.
  */
-export function formatNotifications(rawData: RawNotification[] | null | undefined): AppNotification[] {
-   if (!rawData || !Array.isArray(rawData)) return [];
-
-   return rawData.map((notif) => {
-      const senderData = Array.isArray(notif.sender) ? notif.sender[0] : notif.sender;
-      
-      return {
-         ...notif,
-         sender: senderData || undefined,
-      } as AppNotification;
-   });
-}
+export function formatNotifications(rawData: RawNotification[] | null | undefined): AppNotification[] {}
 
 /**
killedBy: notificationOperations (Functional Core) 1. formatNotifications deve achatar o array do sender gerado pelo Supabase
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
features/notifications/logic/notificationOperations.ts:12:8
  * Transforma a resposta crua do Supabase no formato estrito do Front-end.
  */
 export function formatNotifications(rawData: RawNotification[] | null | undefined): AppNotification[] {
-   if (!rawData || !Array.isArray(rawData)) return [];
+   if (true) return [];
 
    return rawData.map((notif) => {
killedBy: notificationOperations (Functional Core) 1. formatNotifications deve achatar o array do sender gerado pelo Supabase
statusReason: Cannot read properties of undefined (reading 'sender')

[Killed] BooleanLiteral
features/notifications/logic/notificationOperations.ts:12:20
  * Transforma a resposta crua do Supabase no formato estrito do Front-end.
  */
 export function formatNotifications(rawData: RawNotification[] | null | undefined): AppNotification[] {
-   if (!rawData || !Array.isArray(rawData)) return [];
+   if (!rawData || Array.isArray(rawData)) return [];
 
    return rawData.map((notif) => {
killedBy: notificationOperations (Functional Core) 1. formatNotifications deve achatar o array do sender gerado pelo Supabase
statusReason: Cannot read properties of undefined (reading 'sender')

[Killed] BlockStatement
features/notifications/logic/notificationOperations.ts:14:34
 export function formatNotifications(rawData: RawNotification[] | null | undefined): AppNotification[] {
    if (!rawData || !Array.isArray(rawData)) return [];
 
-   return rawData.map((notif) => {
-      const senderData = Array.isArray(notif.sender) ? notif.sender[0] : notif.sender;
-      
-      return {
-         ...notif,
-         sender: senderData || undefined,
-      } as AppNotification;
-   });
+   return rawData.map((notif) => {});
 }
 
killedBy: notificationOperations (Functional Core) 1. formatNotifications deve achatar o array do sender gerado pelo Supabase
statusReason: Cannot read properties of undefined (reading 'sender')

[Killed] BlockStatement
features/notifications/logic/notificationOperations.ts:27:90
 /**
  * Conta quantas notificações ainda não foram lidas.
  */
-export function countUnread(notifications: AppNotification[] | null | undefined): number {
-   if (!notifications || !Array.isArray(notifications)) return 0;
-   return notifications.filter((n) => !n.is_read).length;
-}
+export function countUnread(notifications: AppNotification[] | null | undefined): number {}
killedBy: notificationOperations (Functional Core) 2. countUnread deve contar corretamente as notificações não lidas
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
features/notifications/logic/notificationOperations.ts:28:8
  * Conta quantas notificações ainda não foram lidas.
  */
 export function countUnread(notifications: AppNotification[] | null | undefined): number {
-   if (!notifications || !Array.isArray(notifications)) return 0;
+   if (true) return 0;
    return notifications.filter((n) => !n.is_read).length;
 }
killedBy: notificationOperations (Functional Core) 2. countUnread deve contar corretamente as notificações não lidas
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
features/notifications/logic/notificationOperations.ts:28:26
  * Conta quantas notificações ainda não foram lidas.
  */
 export function countUnread(notifications: AppNotification[] | null | undefined): number {
-   if (!notifications || !Array.isArray(notifications)) return 0;
+   if (!notifications || Array.isArray(notifications)) return 0;
    return notifications.filter((n) => !n.is_read).length;
 }
killedBy: notificationOperations (Functional Core) 2. countUnread deve contar corretamente as notificações não lidas
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
features/notifications/logic/notificationOperations.ts:29:11
  */
 export function countUnread(notifications: AppNotification[] | null | undefined): number {
    if (!notifications || !Array.isArray(notifications)) return 0;
-   return notifications.filter((n) => !n.is_read).length;
+   return notifications.length;
 }
killedBy: notificationOperations (Functional Core) 2. countUnread deve contar corretamente as notificações não lidas
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BooleanLiteral
features/notifications/logic/notificationOperations.ts:29:39
  */
 export function countUnread(notifications: AppNotification[] | null | undefined): number {
    if (!notifications || !Array.isArray(notifications)) return 0;
-   return notifications.filter((n) => !n.is_read).length;
+   return notifications.filter((n) => n.is_read).length;
 }
killedBy: notificationOperations (Functional Core) 2. countUnread deve contar corretamente as notificações não lidas
statusReason: expected 1 to be 2 // Object.is equality
