[Killed] BlockStatement
features/notifications/services/notificationsService.ts:4:92
 import { supabase } from "@/lib/supabase";
 import type { RawNotification } from "../logic/notificationOperations";
 
-export async function fetchRecentNotifications(userId: string): Promise<RawNotification[]> {
-   const { data, error } = await supabase
-      .from("notifications")
-      .select(
-         `
-               *,
-               sender:profiles!sender_id(username, avatar_url)
-            `
-      )
-      .eq("user_id", userId)
-      .order("created_at", { ascending: false })
-      .limit(50);
-
-   if (error) throw error;
-   return (data || []) as RawNotification[];
-}
+export async function fetchRecentNotifications(userId: string): Promise<RawNotification[]> {}
 
 export async function markNotificationAsRead(notificationId: string): Promise<void> {
killedBy: notificationsService fetches recent notifications
statusReason: expected undefined to deeply equal [ { id: 'n1' } ]

[Survived] StringLiteral
features/notifications/services/notificationsService.ts:13:11
                sender:profiles!sender_id(username, avatar_url)
             `
       )
-      .eq("user_id", userId)
+      .eq("", userId)
       .order("created_at", { ascending: false })
       .limit(50);

[Survived] BooleanLiteral
features/notifications/services/notificationsService.ts:14:41
             `
       )
       .eq("user_id", userId)
-      .order("created_at", { ascending: false })
+      .order("created_at", { ascending: true })
       .limit(50);
 

[Survived] ObjectLiteral
features/notifications/services/notificationsService.ts:14:28
             `
       )
       .eq("user_id", userId)
-      .order("created_at", { ascending: false })
+      .order("created_at", {})
       .limit(50);
 

[Killed] BlockStatement
features/notifications/services/notificationsService.ts:21:85
    return (data || []) as RawNotification[];
 }
 
-export async function markNotificationAsRead(notificationId: string): Promise<void> {
-   const { error } = await supabase
-      .from("notifications")
-      .update({ is_read: true })
-      .eq("id", notificationId);
-
-   if (error) throw error;
-}
+export async function markNotificationAsRead(notificationId: string): Promise<void> {}
 
 export async function markAllUserNotificationsAsRead(userId: string): Promise<void> {
killedBy: notificationsService throws when marking notification as read fails
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
features/notifications/services/notificationsService.ts:23:13
 
 export async function markNotificationAsRead(notificationId: string): Promise<void> {
    const { error } = await supabase
-      .from("notifications")
+      .from("")
       .update({ is_read: true })
       .eq("id", notificationId);

[Survived] BooleanLiteral
features/notifications/services/notificationsService.ts:24:26
 export async function markNotificationAsRead(notificationId: string): Promise<void> {
    const { error } = await supabase
       .from("notifications")
-      .update({ is_read: true })
+      .update({ is_read: false })
       .eq("id", notificationId);
 

[Survived] ObjectLiteral
features/notifications/services/notificationsService.ts:24:15
 export async function markNotificationAsRead(notificationId: string): Promise<void> {
    const { error } = await supabase
       .from("notifications")
-      .update({ is_read: true })
+      .update({})
       .eq("id", notificationId);
 

[Killed] BlockStatement
features/notifications/services/notificationsService.ts:30:85
    if (error) throw error;
 }
 
-export async function markAllUserNotificationsAsRead(userId: string): Promise<void> {
-   const { error } = await supabase
-      .from("notifications")
-      .update({ is_read: true })
-      .eq("user_id", userId)
-      .eq("is_read", false);
-
-   if (error) throw error;
-}
+export async function markAllUserNotificationsAsRead(userId: string): Promise<void> {}
 
 export function subscribeNotifications(userId: string, onInsert: () => void): () => void {
killedBy: notificationsService marks all user notifications as read
statusReason: expected "vi.fn()" to be called with arguments: [ 'notifications' ]

Number of calls: 0

[Survived] StringLiteral
features/notifications/services/notificationsService.ts:34:11
    const { error } = await supabase
       .from("notifications")
       .update({ is_read: true })
-      .eq("user_id", userId)
+      .eq("", userId)
       .eq("is_read", false);
 

[Survived] BooleanLiteral
features/notifications/services/notificationsService.ts:35:22
       .from("notifications")
       .update({ is_read: true })
       .eq("user_id", userId)
-      .eq("is_read", false);
+      .eq("is_read", true);
 
    if (error) throw error;

[Killed] BlockStatement
features/notifications/services/notificationsService.ts:40:90
    if (error) throw error;
 }
 
-export function subscribeNotifications(userId: string, onInsert: () => void): () => void {
-   const subscription = supabase
-      .channel("realtime:notifications")
-      .on(
-         "postgres_changes",
-         {
-            event: "INSERT",
-            schema: "public",
-            table: "notifications",
-            filter: `user_id=eq.${userId}`,
-         },
-         onInsert
-      )
-      .subscribe();
-
-   return () => {
-      supabase.removeChannel(subscription);
-   };
-}
+export function subscribeNotifications(userId: string, onInsert: () => void): () => void {}
 
killedBy: notificationsService subscribes and unsubscribes notification channel
statusReason: expected "vi.fn()" to be called with arguments: [ 'realtime:notifications' ]

Number of calls: 0

[Survived] StringLiteral
features/notifications/services/notificationsService.ts:46:20
       .on(
          "postgres_changes",
          {
-            event: "INSERT",
+            event: "",
             schema: "public",
             table: "notifications",

[Killed] BlockStatement
features/notifications/services/notificationsService.ts:55:17
       )
       .subscribe();
 
-   return () => {
-      supabase.removeChannel(subscription);
-   };
+   return () => {};
 }
 
killedBy: notificationsService subscribes and unsubscribes notification channel
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'notif-channel' } ]

Number of calls: 0
