[Killed] BlockStatement
features/profile/services/profileService.ts:8:84
    avatarUrl: string | null;
 }
 
-export async function fetchUserProfile(userId: string): Promise<UserProfileRecord> {
-   const { data, error } = await supabase
-      .from("profiles")
-      .select("avatar_url, username")
-      .eq("id", userId)
-      .single();
-
-   if (error) throw error;
-
-   return {
-      username: data?.username || "",
-      avatarUrl: data?.avatar_url || null,
-   };
-}
+export async function fetchUserProfile(userId: string): Promise<UserProfileRecord> {}
 
 export async function updateUserProfileName(userId: string, username: string): Promise<void> {
killedBy: profileService fetches and normalizes user profile
statusReason: expected undefined to deeply equal { username: 'joao', …(1) }

[Killed] ConditionalExpression
features/profile/services/profileService.ts:18:17
    if (error) throw error;
 
    return {
-      username: data?.username || "",
+      username: true,
       avatarUrl: data?.avatar_url || null,
    };
killedBy: profileService fetches and normalizes user profile
statusReason: expected { username: true, …(1) } to deeply equal { username: 'joao', …(1) }

[Killed] LogicalOperator
features/profile/services/profileService.ts:18:17
    if (error) throw error;
 
    return {
-      username: data?.username || "",
+      username: data?.username && "",
       avatarUrl: data?.avatar_url || null,
    };
killedBy: profileService fetches and normalizes user profile
statusReason: expected { username: '', …(1) } to deeply equal { username: 'joao', …(1) }

[Killed] LogicalOperator
features/profile/services/profileService.ts:19:18
 
    return {
       username: data?.username || "",
-      avatarUrl: data?.avatar_url || null,
+      avatarUrl: data?.avatar_url && null,
    };
 }
killedBy: profileService fetches and normalizes user profile
statusReason: expected { username: 'joao', avatarUrl: null } to deeply equal { username: 'joao', …(1) }

[Killed] ConditionalExpression
features/profile/services/profileService.ts:19:18
 
    return {
       username: data?.username || "",
-      avatarUrl: data?.avatar_url || null,
+      avatarUrl: true,
    };
 }
killedBy: profileService fetches and normalizes user profile
statusReason: expected { username: 'joao', avatarUrl: true } to deeply equal { username: 'joao', …(1) }

[Killed] BlockStatement
features/profile/services/profileService.ts:23:94
    };
 }
 
-export async function updateUserProfileName(userId: string, username: string): Promise<void> {
-   const { error } = await supabase
-      .from("profiles")
-      .update({ username })
-      .eq("id", userId);
-
-   if (error) throw error;
-}
+export async function updateUserProfileName(userId: string, username: string): Promise<void> {}
 
 export async function uploadUserAvatar(userId: string, imageBlob: Blob): Promise<string> {
killedBy: profileService throws when updating username fails
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
features/profile/services/profileService.ts:25:13
 
 export async function updateUserProfileName(userId: string, username: string): Promise<void> {
    const { error } = await supabase
-      .from("profiles")
+      .from("")
       .update({ username })
       .eq("id", userId);

[Killed] BlockStatement
features/profile/services/profileService.ts:32:90
    if (error) throw error;
 }
 
-export async function uploadUserAvatar(userId: string, imageBlob: Blob): Promise<string> {
-   const fileName = `${userId}-${Math.random()}.jpg`;
-
-   const { error: uploadError } = await supabase.storage
-      .from("avatars")
-      .upload(fileName, imageBlob, { upsert: true, contentType: "image/jpeg" });
-
-   if (uploadError) throw uploadError;
-
-   const {
-      data: { publicUrl },
-   } = supabase.storage.from("avatars").getPublicUrl(fileName);
-
-   const { error: updateError } = await supabase
-      .from("profiles")
-      .update({ avatar_url: publicUrl })
-      .eq("id", userId);
-
-   if (updateError) throw updateError;
-
-   return publicUrl;
-}
+export async function uploadUserAvatar(userId: string, imageBlob: Blob): Promise<string> {}
 
killedBy: profileService uploads avatar and persists public url
statusReason: expected undefined to be 'https://cdn/avatar.jpg' // Object.is equality

[Survived] BooleanLiteral
features/profile/services/profileService.ts:37:46
 
    const { error: uploadError } = await supabase.storage
       .from("avatars")
-      .upload(fileName, imageBlob, { upsert: true, contentType: "image/jpeg" });
+      .upload(fileName, imageBlob, { upsert: false, contentType: "image/jpeg" });
 
    if (uploadError) throw uploadError;

[Survived] StringLiteral
features/profile/services/profileService.ts:37:65
 
    const { error: uploadError } = await supabase.storage
       .from("avatars")
-      .upload(fileName, imageBlob, { upsert: true, contentType: "image/jpeg" });
+      .upload(fileName, imageBlob, { upsert: true, contentType: "" });
 
    if (uploadError) throw uploadError;

[Survived] StringLiteral
features/profile/services/profileService.ts:43:30
 
    const {
       data: { publicUrl },
-   } = supabase.storage.from("avatars").getPublicUrl(fileName);
+   } = supabase.storage.from("").getPublicUrl(fileName);
 
    const { error: updateError } = await supabase

[Survived] StringLiteral
features/profile/services/profileService.ts:46:13
    } = supabase.storage.from("avatars").getPublicUrl(fileName);
 
    const { error: updateError } = await supabase
-      .from("profiles")
+      .from("")
       .update({ avatar_url: publicUrl })
       .eq("id", userId);

[Survived] StringLiteral
features/profile/services/profileService.ts:48:11
    const { error: updateError } = await supabase
       .from("profiles")
       .update({ avatar_url: publicUrl })
-      .eq("id", userId);
+      .eq("", userId);
 
    if (updateError) throw updateError;

[Killed] ConditionalExpression
features/profile/services/profileService.ts:50:8
       .update({ avatar_url: publicUrl })
       .eq("id", userId);
 
-   if (updateError) throw updateError;
+   if (false) throw updateError;
 
    return publicUrl;
killedBy: profileService throws when profile update with avatar url fails
statusReason: promise resolved "'https://cdn/avatar.jpg'" instead of rejecting

[Killed] ConditionalExpression
features/profile/services/profileService.ts:50:8
       .update({ avatar_url: publicUrl })
       .eq("id", userId);
 
-   if (updateError) throw updateError;
+   if (true) throw updateError;
 
    return publicUrl;
killedBy: profileService uploads avatar and persists public url
statusReason: null
