[Killed] ObjectLiteral
components/GamesHub/logic/gameHelpContent.ts:9:12
 }
 
 export const GAME_HELP_MAP: Record<Exclude<GameId, "menu">, GameHelp> = {
-   battle: {
-      title: "Como jogar: Modo Batalha",
-      content:
-         "Crie um torneio mata-mata com seus filmes.\n\n" +
-         "Escolha a fonte:\n" +
-         "• Meus assistidos: Filmes que você já viu e avaliou\n" +
-         "• Lista selecionada: Filmes de uma lista específica\n" +
-         "• Rodada diária de 16: Filmes aleatórios do dia\n\n" +
-         "Gameplay:\n" +
-         "• A cada duelo, selecione seu favorito\n" +
-         "• O vencedor segue para a próxima rodada\n" +
-         "• Continue até restar 1 filme campeão\n\n" +
-         "obs: Se não tiver filmes suficientes para rodadas completas, o sistema adicionará byes (folgas).",
-   },
+   battle: {},
    daily_cover: {
       title: "Como jogar: Filme do Dia (Capa)",
killedBy: gameHelpContent cada modo possui titulo e conteudo preenchidos
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:10:14
 
 export const GAME_HELP_MAP: Record<Exclude<GameId, "menu">, GameHelp> = {
    battle: {
-      title: "Como jogar: Modo Batalha",
+      title: "",
       content:
          "Crie um torneio mata-mata com seus filmes.\n\n" +
killedBy: gameHelpContent cada modo possui titulo e conteudo preenchidos
statusReason: expected '' to contain 'Batalha'

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:19:10
          "• Rodada diária de 16: Filmes aleatórios do dia\n\n" +
          "Gameplay:\n" +
          "• A cada duelo, selecione seu favorito\n" +
-         "• O vencedor segue para a próxima rodada\n" +
+         "" +
          "• Continue até restar 1 filme campeão\n\n" +
          "obs: Se não tiver filmes suficientes para rodadas completas, o sistema adicionará byes (folgas).",

[Killed] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:24:14
          "obs: Se não tiver filmes suficientes para rodadas completas, o sistema adicionará byes (folgas).",
    },
    daily_cover: {
-      title: "Como jogar: Filme do Dia (Capa)",
+      title: "",
       content:
          "Adivinhe o filme pela capa, revelada progressivamente.\n\n" +
killedBy: gameHelpContent cada modo possui titulo e conteudo preenchidos
statusReason: expected '' to contain 'Capa'

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:26:10
    daily_cover: {
       title: "Como jogar: Filme do Dia (Capa)",
       content:
-         "Adivinhe o filme pela capa, revelada progressivamente.\n\n" +
+         "" +
          "Objetivo:\n" +
          "• Adivinhar qual filme é a capa com base nas pistas visuais\n" +

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:30:10
          "Objetivo:\n" +
          "• Adivinhar qual filme é a capa com base nas pistas visuais\n" +
          "• Começa com a capa totalmente desfocada\n" +
-         "• Conforme erra, mais da capa é revelada\n\n" +
+         "" +
          "Fontes disponíveis:\n" +
          "• Diário: Mesmo filme diário para todos os jogadores.\n" +

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:35:10
          "• Diário: Mesmo filme diário para todos os jogadores.\n" +
          "• Meus assistidos: Apenas seus filmes assistidos\n" +
          "• Lista: Filmes de uma lista específica\n\n" +
-         "Dicas:\n" +
+         "" +
          "• Disponível quando você tiver ≤3 vidas\n" +
          "• Revela 1 atributo (diretor, ano, gênero, etc) que ainda não acertou",

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:42:10
    daily_riddle: {
       title: "Como jogar: Filme do Dia (Enigma)",
       content:
-         "Adivinhe o filme com base em atributos.\n\n" +
+         "" +
          "Objetivo:\n" +
          "• Chutar títulos de filmes\n" +

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:45:10
          "Adivinhe o filme com base em atributos.\n\n" +
          "Objetivo:\n" +
          "• Chutar títulos de filmes\n" +
-         "• Receber feedback colorido sobre cada atributo comparado\n" +
+         "" +
          "• 6 vidas para acertar\n\n" +
          "Feedback dos atributos:\n" +

[Survived] StringLiteral
components/GamesHub/logic/gameHelpContent.ts:46:10
          "Objetivo:\n" +
          "• Chutar títulos de filmes\n" +
          "• Receber feedback colorido sobre cada atributo comparado\n" +
-         "• 6 vidas para acertar\n\n" +
+         "" +
          "Feedback dos atributos:\n" +
          "• ✅ Verde: Acertou\n" +
